/*
 * Copyright (C) Hisilicon Technologies Co., Ltd. 2019-2019. All rights reserved.
 * Description: gfx2d hal hwc
 * Author: sdk
 * Create: 2019-05-13
 */

#include "drv_gfx2d_struct.h"
#include "hi_gfx_comm_k.h"
#include "drv_gfx2d_hal.h"
#include "hi_reg_common.h"
#include "drv_gfx2d_errcode.h"
#include "drv_gfx2d_filter_para.h"
#include "drv_gfx2d_hal_hwc_adp.h"
#include "drv_gfx2d_mem.h"
#include "drv_gfx2d_config.h"
#include "hi_gfx_sys_k.h"
#include "drv_gfx2d_debug.h"
#include <linux/hisilicon/securec.h>
#include "tde_reg.h"
#include "drv_gfx2d_hal_features.h"

/* **************************** Macro Definition ************************************************* */
#define HWC_REG_BASE_ADDR 0x01400000
#define HWC_ISRNUM (116 + 32)
#define TDE_MMU_REG_BASEADDR ((HWC_REG_BASE_ADDR) + 0xF000)

#define GFX2D_HAL_MAX_NODE 7
#define GFX2D_CONFIG_MAX_ZMERATION 256

/* Obtain the symbol bits and the low 9 bits of the filter coefficients to form 10 bits */
#define HWC_GET_BITS_OF_FILTERPARA(para) ((((para)&0x80000000) >> 22) | ((para)&0x1ff))

#define GFX2D_HAL_HWC_HSTEP_FLOATLEN 20
#define GFX2D_HAL_HWC_NOSCALE_HSTEP (0x1 << GFX2D_HAL_HWC_HSTEP_FLOATLEN)

#define GFX2D_HAL_HWC_VSTEP_FLOATLEN 12
#define GFX2D_HAL_HWC_NOSCALE_VSTEP (0x1 << GFX2D_HAL_HWC_VSTEP_FLOATLEN)

#define GFX2D_CONFIG_NODE_SIZE ((sizeof(hwc_node) + 0xf) & 0xfffffff0)
#define GFX2D_ARRAY_SIZE(x) (sizeof(x) / sizeof((x)[0])) /* index is 0 */

#define GFX2D_HAL_SRCFMT_PKYUYV 32
#define GFX2D_HAL_SRCFMT_SP400 48
#define GFX2D_HAL_SRCFMT_SP422V 50
#define GFX2D_HAL_SRCFMT_SP444 52
#define GFX2D_HAL_RATIO_PRECISE 20

#define GFX2D_HAL_SLICE_WIDTH 512

#ifdef CONFIG_GFX_MMU_CLOCK

#endif
/* ************************** Structure Definition *********************************************** */
typedef union {
    struct {
        hi_u32 bit16X : 16;
        hi_u32 bit16Y : 16;
    } stBits;
    hi_u32 u32All;
} HWC_POS_U;

typedef union {
    struct {
        hi_u32 bit16Width : 16;
        hi_u32 bit16Height : 16;
    } stBits;
    hi_u32 u32All;
} HWC_RES_U;

typedef union {
    struct {
        hi_u32 bit9Idc0 : 9;
        hi_u32 bit9Idc1 : 9;
        hi_u32 bit9Idc2 : 9;
        hi_u32 bit1IsEnable : 1;
        hi_u32 bit1Reserved : 4;
    } stBits;
    hi_u32 u32All;
} HWC_VHDCSCIDC_U;

typedef union {
    struct {
        hi_u32 bit9Odc0 : 9;
        hi_u32 bit9Odc1 : 9;
        hi_u32 bit9Odc2 : 9;
        hi_u32 bit5Reserved : 5;
    } stBits;
    hi_u32 u32All;
} HWC_VHDCSCODC_U;

typedef union {
    struct {
        hi_u32 bit15Param0 : 15;
        hi_u32 bit1Reserved1 : 1;
        hi_u32 bit15Param1 : 15;
        hi_u32 bit1Reserved2 : 1;
    } stBits;
    hi_u32 u32All;
} HWC_VHDCSCPARAM_U;

typedef union {
    struct {
        hi_u32 bit24Ratio : 24;
        hi_u32 bit1Order : 1;
        hi_u32 bit1ChrmoaMode : 1;
        hi_u32 bit1LumMode : 1;
        hi_u32 bit1AlphaMode : 1;
        hi_u32 bit1IsChromaMid : 1;
        hi_u32 bit1IsLumMid : 1;
        hi_u32 bit1IsChromaEnable : 1;
        hi_u32 bit1IsLumEnable : 1;
    } stBits;
    hi_u32 u32All;
} HWC_VHDHSP_U;

typedef union {
    struct {
        hi_u32 bit28Offset : 28;
        hi_u32 bit4Reserved : 4;
    } stBits;
    hi_u32 u32All;
} HWC_VHDHOFFSET_U;

typedef union {
    struct {
        hi_u32 bit19Reserved : 19;
        hi_u32 bit2InFmt : 2;
        hi_u32 bit2OutFmt : 2;
        hi_u32 bit1ChromaMode : 1;
        hi_u32 bit1LumMode : 1;
        hi_u32 bit1Reserved1 : 1;
        hi_u32 bit1ChromaTap : 1;
        hi_u32 bit1Reserved2 : 1;
        hi_u32 bit1IsChromaMid : 1;
        hi_u32 bit1IsLumMid : 1;
        hi_u32 bit1IsChromaEnable : 1;
        hi_u32 bit1IsLumEnable : 1;
    } stBits;
    hi_u32 u32All;
} HWC_VHDVSP_U;

typedef union {
    struct {
        hi_u32 bit3Prio0 : 3;
        hi_u32 bit3Prio1 : 3;
        hi_u32 bit3Prio2 : 3;
        hi_u32 bit3Prio3 : 3;
        hi_u32 bit3Prio4 : 3;
        hi_u32 bit3Prio5 : 3;
        hi_u32 bit3Prio6 : 3;
        hi_u32 bit4AluMode : 4;                 /* [24..21]  */
        hi_u32 bit1CbmMode : 1; /* [25]      */ /* index is 25 */
        hi_u32 bit5Reserved : 5;                /* [30..26]  */
        hi_u32 bit1En : 1; /* [31]      */      /* index is 31 */
    } stBits;
    hi_u32 u32All;
} HWC_CBMMIX_U;

typedef union {
    struct {
#ifndef CONFIG_GFX_HWC_VERSION_3_0
        hi_u32 bit9Idc0 : 9;
        hi_u32 bit9Idc1 : 9;
        hi_u32 bit9Idc2 : 9;
        hi_u32 bit1IsEnable : 1;
        hi_u32 bit4Reserved : 4;
#else
        hi_u32 bit11Idc0 : 11;
        hi_u32 bit5Reserved : 5;
        hi_u32 bit11Idc1 : 11;
        hi_u32 bit4Reserved : 4;
        hi_u32 bit1IsEnable : 1;
#endif
    } stBits;
    hi_u32 u32All;
} HWC_OUTCSCIDC0_U;

typedef union {
    struct {
        hi_u32 bit11Idc2 : 11;
        hi_u32 bit21Reserved : 21;
    } stBits;
    hi_u32 u32All;
} HWC_OUTCSCIDC1_U;

typedef union {
    struct {
#ifndef CONFIG_GFX_HWC_VERSION_3_0
        hi_u32 bit9Odc0 : 9;
        hi_u32 bit9Odc1 : 9;
        hi_u32 bit9Odc2 : 9;
        hi_u32 bit5Reserved : 5;
#else
        hi_u32 bit11Odc0 : 11;
        hi_u32 bit5Reserved : 5;
        hi_u32 bit11Odc1 : 11;
        hi_u32 bit5Reserved1 : 5;
#endif
    } stBits;
    hi_u32 u32All;
} HWC_OUTCSCODC0_U;

typedef union {
    struct {
        hi_u32 bit11Odc2 : 11;
        hi_u32 bit21Reserved : 21;
    } stBits;
    hi_u32 u32All;
} HWC_OUTCSCODC1_U;

typedef union {
    struct {
        hi_u32 bit15Param0 : 15;
        hi_u32 bit1Reserved1 : 1;
        hi_u32 bit15Param1 : 15;
        hi_u32 bit1Reserved2 : 1;
    } stBits;
    hi_u32 u32All;
} HWC_OUTCSCPARAM_U;

typedef union {
    struct {
        hi_u32 bit29Reserved : 29;
        hi_u32 bit1DitherRound : 1;
        hi_u32 bit1Reserved : 1;
        hi_u32 bit1DitherEn : 1;
    } stBits;
    hi_u32 u32All;
} HWC_OUT_DITHER_CTRL_U;

typedef union {
    struct {
        hi_u32 bit1Reserved : 1;
        hi_u32 bit2HfirMode : 2;
        hi_u32 bit1MidEn : 1;
        hi_u32 bit1CkGtEn : 1;
        hi_u32 bit27Reserved : 27;
    } bits;
    hi_u32 u32All;
} HWC_OUT_HFIR_CTRL_U;

typedef union {
    struct {
        hi_u32 bit10Coef0 : 10;
        hi_u32 bit6Reserved0 : 6;
        hi_u32 bit10Coef1 : 10;
        hi_u32 bit6Reserved1 : 6;
    } bits;
    hi_u32 u32All;

} HWC_OUT_HFIRCOEF01_U;

typedef union {
    struct {
        hi_u32 bit1CmpEnable : 1;
        hi_u32 bit1LossEnable : 1;
        hi_u32 bit1SgmtType : 1;
        hi_u32 bit29Reserved : 29;
    } stBits;
    hi_u32 u32All;
} HWC_CMPCTRL_U;

typedef union {
    struct {
        hi_u32 bit13XPos : 13;
        hi_u32 bit3Reserved1 : 3;
        hi_u32 bit13YPos : 13;
        hi_u32 bit2Reserved2 : 2;
        hi_u32 bit1IsEnable : 1;
    } stBits;
    hi_u32 u32All;
} HWC_CROPPOS_U;

typedef union {
    struct {
        hi_u32 bit13Width : 13;
        hi_u32 bit3Reserved1 : 3;
        hi_u32 bit13Height : 13;
        hi_u32 bit2Reserved2 : 3;
    } stBits;
    hi_u32 u32All;
} HWC_CROPRESO_U;

typedef union {
    struct {
        hi_u32 bit1IsLossLess : 1;
        hi_u32 bit1IsAlphaLossLess : 1;
        hi_u32 bit1Mode : 1;
        hi_u32 bit2OsdMode : 2;
        hi_u32 bit1IsPartition : 1;
        hi_u32 bit3PartitionNum : 3;
        hi_u32 bit23Reserved : 23;
    } stBits;
    hi_u32 u32All;
} HWC_CMPGLBINFO_U;

typedef union {
    struct {
        hi_u32 bit13Width : 13;
        hi_u32 bit3Reserved1 : 3;
        hi_u32 bit13Height : 13;
        hi_u32 bit2Reserved2 : 3;
    } stBits;
    hi_u32 u32All;
} HWC_CMPRESO_U;

typedef union {
    struct {
        hi_u32 bit10BudgetBitsMb : 10;
        hi_u32 bit6Reserved1 : 6;
        hi_u32 bit10MinMbBits : 10;
        hi_u32 bit2Reserved2 : 6;
    } stBits;
    hi_u32 u32All;
} HWC_CMPCFG0_U;

typedef union {
    struct {
        hi_u32 bit10BudgetBitsMbCap : 10;
        hi_u32 bit6Reserved : 22;
    } stBits;
    hi_u32 u32All;
} HWC_CMPCFG1_U;

typedef union {
    struct {
        hi_u32 bit4MaxQp : 4;
        hi_u32 bit4Reserved1 : 4;
        hi_u32 bit4SadBitsNgain : 4;
        hi_u32 bit4Reserved2 : 4;
        hi_u32 bit3RcSmthNgain : 3;
        hi_u32 bit5Reserved3 : 5;
        hi_u32 bit4SpecialBitGain : 4;
        hi_u32 bit4Reserved4 : 4;
    } stBits;
    hi_u32 u32All;
} HWC_CMPCFG2_U;

typedef union {
    struct {
        hi_u32 bit7MaxSadThr : 7;
        hi_u32 bit9Reserved1 : 9;
        hi_u32 bit7MinSadThr : 7;
        hi_u32 bit9Reserved2 : 9;
    } stBits;
    hi_u32 u32All;
} HWC_CMPCFG3_U;

typedef union {
    struct {
        hi_u32 bit7SmthThr : 7;
        hi_u32 bit1Reserved1 : 1;
        hi_u32 bit7StillThr : 7;
        hi_u32 bit1Reserved2 : 1;
        hi_u32 bit10BigGradThr : 10;
        hi_u32 bit6Reserved3 : 6;
    } stBits;
    hi_u32 u32All;
} HWC_CMPCFG4_U;

typedef union {
    struct {
        hi_u32 bit6SmthPixNumThr : 6;
        hi_u32 bit2Reserved1 : 2;
        hi_u32 bit6StillPixNumThr : 6;
        hi_u32 bit2Reserved2 : 2;
        hi_u32 bit6NoisePixNumThr : 6;
        hi_u32 bit2Reserved3 : 2;
        hi_u32 bit6LargeSmthPixNumThr : 6;
        hi_u32 bit2Reserved4 : 2;
    } stBits;
    hi_u32 u32All;
} HWC_CMPCFG5_U;

typedef union {
    struct {
        hi_u32 bit7NoiseSad : 7;
        hi_u32 bit9Reserved1 : 9;
        hi_u32 bit9PixDiffThr : 9;
        hi_u32 bit7Reserved2 : 7;
    } stBits;
    hi_u32 u32All;
} HWC_CMPCFG6_U;

typedef union {
    struct {
        hi_u32 bit7AdjSadBitsThr : 7;
        hi_u32 bit1Reserved1 : 1;
        hi_u32 bit8MaxTrowBits : 8;
        hi_u32 bit16Reserved2 : 16;
    } stBits;
    hi_u32 u32All;
} HWC_CMPCFG7_U;

typedef union {
    struct {
        hi_u32 bit8QpInc1BitsThr : 8;
        hi_u32 bit8QpDec1BitsThr : 8;
        hi_u32 bit8QpInc2BitsThr : 8;
        hi_u32 bit8QpDec2BitsThr : 8;
    } stBits;
    hi_u32 u32All;
} HWC_CMPCFG8_U;

typedef union {
    struct {
        hi_u32 bit10ForceQpThr : 10;
        hi_u32 bit6Reserved1 : 6;
        hi_u32 bit10ForceQpThrCap : 10;
        hi_u32 bit6Reserved2 : 6;
    } stBits;
    hi_u32 u32All;
} HWC_CMPCFG9_U;

typedef struct {
    hi_u32 u32AqListHeadAddr;
    hi_u32 u32HwcCtl;
    hi_u32 u32MaskInt;
    hi_u32 u32IntClr;
    hi_u32 u32Int;
    hi_u32 u32TimeCnt;
    hi_u32 u32MiscEllaneous;
} HWC_REG_S;

typedef struct {
    hi_u32 u32Status;
    hi_u32 u32Reserved[39]; /* index is 39 */
    hi_u32 u32WCnt;
} HWC_DEBUG_REG_S;

#ifdef GFX2D_ALPHADETECT_SUPPORT
typedef struct {
    hi_u32 u32AlphaSum[9]; /* index is 9 */
} HWC_ALPHASUM_REG_S;
#endif

typedef union {
    struct {
        hi_u32 bit6Fmt : 6;                        /* [5..0]    */
        hi_u32 bit5ArgbOrder : 5;                  /* [10..6]   */
        hi_u32 bit1UVOrder : 1; /* [11]      */    /* index is 11 */
        hi_u32 bit2ExpandMode : 2;                 /* [13..12]  */
        hi_u32 bit1ClutMode : 1; /* [14]      */   /* index is 14 */
        hi_u32 bit1RgbMode : 1; /* [15]      */    /* index is 15 */
        hi_u32 bit1_sp_bitw : 1;                   /* [16]  */
        hi_u32 bit1Reserved0 : 1;                  /* [17]  */
        hi_u32 bit1AlphaRange : 1; /* [18]      */ /* index is 18 */
        hi_u32 bit1VScanOrd : 1; /* [19]      */   /* index is 19 */
        hi_u32 bit1HScanOrd : 1; /* [20]      */   /* index is 20 */
        hi_u32 bit1422Pro : 1; /* [21]      */     /* index is 21 */
        hi_u32 bit7Reserved1 : 6;                  /* [27..22]  */
        hi_u32 bit1_afbc_en : 1;                   /* [28]  */
        hi_u32 bit1_dma : 1;                       /* [29]  */
        hi_u32 bit1IsDim : 1; /* [30]      */      /* index is 30 */
        hi_u32 bit1IsEnable : 1; /* [31]      */   /* index is 31 */
    } stBits;
    hi_u32 u32All;
} HWC_SRCCTL_U;

typedef union {
    struct {
        hi_u32 bit6Fmt : 6;                      /* [5..0]    */
        hi_u32 bit5ArgbOrder : 5;                /* [10..6]   */
        hi_u32 bit1UVOrder : 1; /* [11]      */  /* index is 11 */
        hi_u32 bit2ExpandMode : 2;               /* [13..12]  */
        hi_u32 bit1ClutMode : 1; /* [14]      */ /* index is 14 */
#ifndef CONFIG_GFX_HWC_VERSION_3_0
        hi_u32 bit4Reserved0 : 3; /* [17..15]  */
#else
        hi_u32 bit1RgbMode : 1; /* [15]      */ /* index is 15 */
        hi_u32 bit2Reserved0 : 2;               /* [17..16]  */
#endif
        hi_u32 bit1AlphaRange : 1; /* [18]      */ /* index is 18 */
        hi_u32 bit1VScanOrd : 1; /* [19]      */   /* index is 19 */
        hi_u32 bit1HScanOrd : 1; /* [20]      */   /* index is 20 */
        hi_u32 bit1422Pro : 1; /* [21]      */     /* index is 21 */
        hi_u32 bit7Reserved1 : 7;                  /* [28..22]  */
        hi_u32 reverse : 1; /* [29]      */        /* index is 29 */
        hi_u32 bit1IsDim : 1; /* [30]      */      /* index is 30 */
        hi_u32 bit1IsEnable : 1; /* [31]      */   /* index is 31 */
    } stBits;
    hi_u32 u32All;
} HWC_SRCCTL1_U;

typedef union {
    struct {
        hi_u32 bit8Alpha0 : 8;     /* [7..0]  */
        hi_u32 bit8Alpha1 : 8;     /* [15..8]  */
        hi_u32 bit16Reserved : 16; /* [31..16]  */
    } stBits;
    hi_u32 u32All;
} HWC_ALPHA_U;

typedef union {
    struct {
        hi_u32 bit16SrcCmdInterval : 16;            /* [15..0]  */
        hi_u32 bit15Reserved : 15;                  /* [30..16] */
        hi_u32 bit1SrcCmdCtrlEn : 1; /* [31]     */ /* index is 31 */
    } stBits;
    hi_u32 u32All;
} HWC_SRC_CMD_CTL_U;

typedef struct {
    HWC_SRCCTL_U unCtrl; /* 0x0 */
    hi_u32 phy_addr_h;
    hi_u32 phy_addr;
    hi_u32 ch1_addr_addr_h;
    hi_u32 ch1_addr_addr_l;
    hi_u32 stride;
    hi_u32 stride1;
    HWC_RES_U unRes;     /* 0x14 */
    hi_u32 u32DimValue;  /* 0x18 */
    HWC_ALPHA_U unAlpha; /* 0x1c */
    hi_u32 u32PixOffset; /* 0x20 */
} video_layer;

typedef struct {
    HWC_SRCCTL_U unCtrl; /* 0x0 */
    hi_u32 phy_addr_h;
    hi_u32 phy_addr;     /* 0x4 */
    hi_u32 stride;       /* 0xc */
    HWC_RES_U unRes;     /* 0x14 */
    hi_u32 u32DimValue;  /* 0x18 */
    HWC_ALPHA_U unAlpha; /* 0x1c */
    hi_u32 u32PixOffset; /* 0x20 */
} gfx_layer;

typedef union {
    struct {
        hi_u32 bit6Fmt : 6;
        hi_u32 bit5ArgbOrder : 5;
        hi_u32 bit1CbcrOrder : 1;
        hi_u32 bit5Reserved0 : 5;
        hi_u32 bit1Dither : 1;
        hi_u32 bit1AlphaRange : 1;
        hi_u32 bit1VScanOrder : 1;
        hi_u32 bit1HScanOrder : 1;
        hi_u32 bit2Reserved1 : 2;
        hi_u32 bit1CmpEn : 1;
        hi_u32 bit1CmpAddrChangeEn : 1;
        hi_u32 adapt_32b_en : 1;
        hi_u32 dst_ch2_mmu_bypass : 1;
        hi_u32 bit1ChormeMmuBypass : 1;
        hi_u32 bit1LumMmuBypass : 1;
        hi_u32 bit1ARMmuBypass : 1;
        hi_u32 bit1GBMmuBypass : 1;
        hi_u32 bit1Enable : 1;
    } stBits;
    hi_u32 u32All;
} HWC_OUTCTL_U;

/* Define the union U_DES_ALPHA */
typedef union {
    struct {
        hi_u32 bit8AlphaThreshold : 8;      /* [7..0]  */
        hi_u32 bit1CropMode : 1; /* [8]  */ /* index is 8 */
        hi_u32 bit1CropEn : 1; /* [9]  */   /* index is 9 */
        hi_u32 bit22Reserved : 22;          /* [31..10]  */
    } stBits;
    hi_u32 u32All;
} HWC_OUTALPHA_U;

typedef union {
    struct {
        hi_u32 bit16OutCmdInterval : 16;            /* [15..0]  */
        hi_u32 bit15Reserved : 15;                  /* [30..16] */
        hi_u32 bit1OutCmdCtrlEn : 1; /* [31]     */ /* index is 31 */
    } stBits;
    hi_u32 u32All;
} HWC_OUT_CMD_CTL_U;

typedef union {
    struct {
        hi_u32 bit1Src1Ch0MmuBypass : 1; /* [0]  */ /* index is 0 */
        hi_u32 bit1Src1Ch1MmuBypass : 1; /* [1]  */ /* index is 1 */
        hi_u32 bit1Src2Ch0MmuBypass : 1; /* [2]  */ /* index is 2 */
        hi_u32 bit1Src2Ch1MmuBypass : 1; /* [3]  */ /* index is 3 */
        hi_u32 bit1Src3MmuBypass : 1; /* [4]  */    /* index is 4 */
        hi_u32 bit1Src4MmuBypass : 1; /* [5]  */    /* index is 5 */
        hi_u32 bit1Src5MmuBypass : 1; /* [6]  */    /* index is 6 */
        hi_u32 bit1Src6MmuBypass : 1; /* [7]  */    /* index is 7 */
        hi_u32 bit1Src7MmuBypass : 1; /* [8]  */    /* index is 8 */
        hi_u32 bit1ClutMmuBypass : 1; /* [9]  */    /* index is 9 */
        hi_u32 bit6Reserved0 : 6;                   /* [15..10]  */
        hi_u32 bit1Src1Ch0Prot : 1; /* [16]  */     /* index is 16 */
        hi_u32 bit1Src1Ch1Prot : 1; /* [17]  */     /* index is 17 */
        hi_u32 bit1Src2Ch0Prot : 1; /* [18]  */     /* index is 18 */
        hi_u32 bit1Src2Ch1Prot : 1; /* [19]  */     /* index is 19 */
        hi_u32 bit1Src3Prot : 1; /* [20]  */        /* index is 20 */
        hi_u32 bit1Src4Prot : 1; /* [21]  */        /* index is 21 */
        hi_u32 bit1Src5Prot : 1; /* [22]  */        /* index is 22 */
        hi_u32 bit1Src6Prot : 1; /* [23]  */        /* index is 23 */
        hi_u32 bit1Src7Prot : 1; /* [24]  */        /* index is 24 */
        hi_u32 bit7Reserved1 : 7;                   /* [31..25]  */
    } stBits;
    hi_u32 u32All;
} HWC_MMU_PROT_CTL_U;

typedef union {
    struct {
        hi_u32 bit16_src2_hpzme_width : 16;        /* [15..0]  */
        hi_u32 bit4_src2_hpzme_mode : 4;           /* [19..16]  */
        hi_u32 bit10_Reserved0 : 11;               /* [30..20]  */
        hi_u32 bit1_src2_hpzme_en : 1; /* [31]  */ /* index is 0 */
    } stBits;
    hi_u32 u32All;
} HWC_HPZME_U;

typedef union {
    struct {
        hi_u32 bit1CscMode : 1; /* [0]  */      /* index is 0 */
        hi_u32 bit1OutPremultEn : 1; /* [1]  */ /* index is 1 */
        hi_u32 bit30Reserved : 30;              /* [31..2]  */
    } stBits;
    hi_u32 u32All;
} HWC_CSCMUX_U;

typedef union {
    struct {
        hi_u32 bit2HDswmMode : 2;                    /* [1..0]  */
        hi_u32 bit2Reserved0 : 2;                    /* [3..2]  */
        hi_u32 bit1VDswmMode : 1; /* [4]  */         /* index is 4 */
        hi_u32 bit1AlphaDectectClear : 1; /* [5]  */ /* index is 5 */
        hi_u32 bit1AlphaDectectEn : 1; /* [6]  */    /* index is 6 */
        hi_u32 bit25Reserved1 : 25;                  /* [31..7]  */
    } stBits;
    hi_u32 u32All;
} HWC_OUTDSWM_U;

typedef union {
    struct {
        hi_u32 bit1GlobalAlphaEnable : 1; /* [0]  */ /* index is 0 */
        hi_u32 bit1PixelAlphaEnable : 1; /* [1]  */  /* index is 1 */
        hi_u32 bit1bPreMul : 1; /* [2]  */           /* index is 2 */
        hi_u32 bit1MultiGEn : 1; /* [3]  */          /* index is 3 */
        hi_u32 bit4BlendMode : 4;                    /* [7..4]  */
        hi_u32 bit8GlobalAlpha : 8;                  /* [15..8]  */
        hi_u32 bit15Reserved : 15;                   /* [30..16]  */
        hi_u32 bit1bCovBlend : 1; /* [31]  */        /* index is 31 */
    } stBits;
    hi_u32 u32All;
} HWC_CBMPARA_U;

typedef struct {
    HWC_CBMPARA_U unCbmPara;
    HWC_POS_U unCbmStartPos;
} HWC_CBMINFO_S;

typedef struct {
    u_src1_window0_stpos window0_stpos;
    u_src1_window0_edpos window0_edpos;
    u_src1_window0_stpos window1_stpos;
    u_src1_window0_edpos window1_edpos;
    u_src1_window0_stpos window2_stpos;
    u_src1_window0_edpos window2_edpos;
    u_src1_window0_stpos window3_stpos;
    u_src1_window0_edpos window3_edpos;
} dim_window_s;

typedef struct {
    u_src1_window0_rgb window0_rgb;
    u_src1_window0_a window0_a;
    u_src1_window0_rgb window1_rgb;
    u_src1_window0_a window1_a;
    u_src1_window0_rgb window2_rgb;
    u_src1_window0_a window2_a;
    u_src1_window0_rgb window3_rgb;
    u_src1_window0_a window3_a;
} window_argb_s;

typedef struct {
    u_src1_hsp src1_hsp;           /* 0x1000 */
    u_src1_hloffset src1_hloffset; /* 0x1004 */
    u_src1_hcoffset src1_hcoffset; /* 0x1008 */
    unsigned int reserved_20[61];  /* 61: 0x100c~0x10fc */
    u_src1_vsp src1_vsp;           /* 0x1100 */
    u_src1_vsr src1_vsr;           /* 0x1104 */
    u_src1_voffset src1_voffset;   /* 0x1108 */
    u_src1_zmeoreso src1_zme_out_reso;
    u_src1_zmeireso src1_zme_in_reso;
    unsigned int reserved_21[59]; /* 59: 0x1114~0x11fc */
} src_zme_s;

typedef struct {
    u_src_hipp_csc_ctrl src_hipp_csc_ctrl;       /* 0x1900 */
    u_src_hipp_csc_coef00 src_hipp_csc_coef00;   /* 0x1904 */
    u_src_hipp_csc_coef01 src_hipp_csc_coef01;   /* 0x1908 */
    u_src_hipp_csc_coef02 src_hipp_csc_coef02;   /* 0x190c */
    u_src_hipp_csc_coef10 src_hipp_csc_coef10;   /* 0x1910 */
    u_src_hipp_csc_coef11 src_hipp_csc_coef11;   /* 0x1914 */
    u_src_hipp_csc_coef12 src_hipp_csc_coef12;   /* 0x1918 */
    u_src_hipp_csc_coef20 src_hipp_csc_coef20;   /* 0x191c */
    u_src_hipp_csc_coef21 src_hipp_csc_coef21;   /* 0x1920 */
    u_src_hipp_csc_coef22 src_hipp_csc_coef22;   /* 0x1924 */
    u_src_hipp_csc_scale src_hipp_csc_scale;     /* 0x1928 */
    u_src_hipp_csc_idc0 src_hipp_csc_idc0;       /* 0x192c */
    u_src_hipp_csc_idc1 src_hipp_csc_idc1;       /* 0x1930 */
    u_src_hipp_csc_idc2 src_hipp_csc_idc2;       /* 0x1934 */
    u_src_hipp_csc_odc0 src_hipp_csc_odc0;       /* 0x1938 */
    u_src_hipp_csc_odc1 src_hipp_csc_odc1;       /* 0x193c */
    u_src_hipp_csc_odc2 src_hipp_csc_odc2;       /* 0x1940 */
    u_src_hipp_csc_min_y src_hipp_csc_min_y;     /* 0x1944 */
    u_src_hipp_csc_min_c src_hipp_csc_min_c;     /* 0x1948 */
    u_src_hipp_csc_max_y src_hipp_csc_max_y;     /* 0x194c */
    u_src_hipp_csc_max_c src_hipp_csc_max_c;     /* 0x1950 */
    u_src_hipp_csc2_coef00 src_hipp_csc2_coef00; /* 0x1954 */
    u_src_hipp_csc2_coef01 src_hipp_csc2_coef01; /* 0x1958 */
    u_src_hipp_csc2_coef02 src_hipp_csc2_coef02; /* 0x195c */
    u_src_hipp_csc2_coef10 src_hipp_csc2_coef10; /* 0x1960 */
    u_src_hipp_csc2_coef11 src_hipp_csc2_coef11; /* 0x1964 */
    u_src_hipp_csc2_coef12 src_hipp_csc2_coef12; /* 0x1968 */
    u_src_hipp_csc2_coef20 src_hipp_csc2_coef20; /* 0x196c */
    u_src_hipp_csc2_coef21 src_hipp_csc2_coef21; /* 0x1970 */
    u_src_hipp_csc2_coef22 src_hipp_csc2_coef22; /* 0x1974 */
    u_src_hipp_csc2_scale src_hipp_csc2_scale;   /* 0x1978 */
    u_src_hipp_csc2_idc0 src_hipp_csc2_idc0;     /* 0x197c */
    u_src_hipp_csc2_idc1 src_hipp_csc2_idc1;     /* 0x1980 */
    u_src_hipp_csc2_idc2 src_hipp_csc2_idc2;     /* 0x1984 */
    u_src_hipp_csc2_odc0 src_hipp_csc2_odc0;     /* 0x1988 */
    u_src_hipp_csc2_odc1 src_hipp_csc2_odc1;     /* 0x198c */
    u_src_hipp_csc2_odc2 src_hipp_csc2_odc2;     /* 0x1990 */
    u_src_hipp_csc2_min_y src_hipp_csc2_min_y;   /* 0x1994 */
    u_src_hipp_csc2_min_c src_hipp_csc2_min_c;   /* 0x1998 */
    u_src_hipp_csc2_max_y src_hipp_csc2_max_y;   /* 0x199c */
    u_src_hipp_csc2_max_c src_hipp_csc2_max_c;   /* 0x19a0 */
    unsigned int reserved_27[23];                /* 23: 0x19a4~0x19fc */
} hipp_csc_s;

typedef struct {
    u_src1_afbc_rsv src_afbc_rsv;
    u_src1_afbc_mac_ctrl src_afbc_mac_ctrl;
    unsigned int reserved_34[6];                              /* 6: 0x2008~0x201c */
    u_src1_afbc_smmu_bypass src_afbc_smmu_bypass;             /* 0x2020 */
    unsigned int reserved_35[8];                              /* 8: 0x2024~0x2040 */
    u_src1_afbc_src_reso src_afbc_src_reso;                   /* 0x2044 */
    u_src1_afbc_src_crop src_afbc_src_crop;                   /* 0x2048 */
    u_src1_afbc_ireso src_afbc_ireso;                         /* 0x204c */
    u_src1_afbc_addr_h src_afbc_addr_h;                       /* 0x2050 */
    u_src1_afbc_addr_l src_afbc_addr_l;                       /* 0x2054 */
    unsigned int reserved_36[2];                              /* 2: 0x2058~0x205c */
    u_src1_afbc_stride src_afbc_stride;                       /* 0x2060 */
    unsigned int reserved_37[7];                              /* 7: 0x2064~0x207c */
    u_src1_afbc_head_addr_h src_afbc_head_addr_h;             /* 0x2080 */
    u_src1_afbc_head_addr_l src_afbc_head_addr_l;             /* 0x2084 */
    u_src1_afbc_head_stride src_afbc_head_stride;             /* 0x2088 */
    unsigned int reserved_38[13];                             /* 13: 0x208c~0x20bc */
    u_src1_afbc_debug_ctrl src_afbc_debug_ctrl;               /* 0x20c0 */
    u_src1_afbc_press_ctrl src_afbc_press_ctrl;               /* 0x20c4 */
    unsigned int reserved_39[6];                              /* 6: 0x20c8~0x20dc */
    u_src1_afbc_in_ar_checksum0 src_afbc_in_ar_checksum0;     /* 0x20e0 */
    u_src1_afbc_in_ar_checksum1 src_afbc_in_ar_checksum1;     /* 0x20e4 */
    u_src1_afbc_in_gb_checksum0 src_afbc_in_gb_checksum0;     /* 0x20e8 */
    u_src1_afbc_in_gb_checksum1 src_afbc_in_gb_checksum1;     /* 0x20ec */
    u_src1_afbc_chn0_fifosta0 src_afbc_chn0_fifosta0;         /* 0x20f0 */
    u_src1_afbc_chn0_fifosta1 src_afbc_chn0_fifosta1;         /* 0x20f4 */
    u_src1_afbc_chn1_fifosta0 src_afbc_chn1_fifosta0;         /* 0x20f8 */
    u_src1_afbc_chn1_fifosta1 src_afbc_chn1_fifosta1;         /* 0x20fc */
    u_src1_afbc_cur_flow src_afbc_cur_flow;                   /* 0x2100 */
    u_src1_afbc_cur_sreq_time src_afbc_cur_sreq_time;         /* 0x2104 */
    u_src1_afbc_last_flow src_afbc_last_flow;                 /* 0x2108 */
    u_src1_afbc_last_sreq_time src_afbc_last_sreq_time;       /* 0x210c */
    u_src1_afbc_busy_time src_afbc_busy_time;                 /* 0x2110 */
    u_src1_afbc_ar_neednordy_time src_afbc_ar_neednordy_time; /* 0x2114 */
    u_src1_afbc_gb_neednordy_time src_afbc_gb_neednordy_time; /* 0x2118 */
    unsigned int reserved_40;                                 /* 0x211c */
    u_src1_afbc_work_reso src_afbc_work_reso;                 /* 0x2120 */
    u_src1_afbc_work_finfo src_afbc_work_finfo;               /* 0x2124 */
    u_src1_afbc_last_addr src_afbc_last_addr;                 /* 0x2128 */
    unsigned int reserved_41;                                 /* 0x212c */
    u_src1_afbc_work_read_ctrl src_afbc_work_read_ctrl;       /* 0x2130 */
    u_src1_afbc_work_smmu_ctrl src_afbc_work_smmu_ctrl;       /* 0x2134 */
    u_src1_afbc_work_addr src_afbc_work_addr;                 /* 0x2138 */
    u_src1_afbc_work_naddr src_afbc_work_naddr;               /* 0x213c */
    u_src1_afbc_dcmp_cfg src_afbc_dcmp_cfg;                   /* 0x2140 */
    u_src1_afbc_dcmp0_error src_afbc_dcmp0_error;             /* 0x2144 */
    u_src1_afbc_dcmp0_debug src_afbc_dcmp0_debug;             /* 0x2148 */
    u_src1_afbc_dcmp1_error src_afbc_dcmp1_error;             /* 0x214c */
    u_src1_afbc_dcmp1_debug src_afbc_dcmp1_debug;             /* 0x2150 */
    unsigned int reserved_42[43];                             /* 43: 0x2154~0x21fc */
} src_afbc_cfg_s;

typedef struct {
    unsigned int reserved_60[700];                                         /* 700: 0x2b10~0x35fc */
    u_src1_db_imap_ctrl src1_db_imap_ctrl;                                 /* 0x3600 */
    u_src1_db_imap_in_rangemin src1_db_imap_in_rangemin;                   /* 0x3604 */
    u_src1_db_imap_in_range src1_db_imap_in_range;                         /* 0x3608 */
    u_src1_db_imap_in_rangeinv src1_db_imap_in_rangeinv;                   /* 0x360c */
    u_src1_db_imap_iptoff0 src1_db_imap_iptoff0;                           /* 0x3610 */
    u_src1_db_imap_iptoff1 src1_db_imap_iptoff1;                           /* 0x3614 */
    u_src1_db_imap_iptoff2 src1_db_imap_iptoff2;                           /* 0x3618 */
    u_src1_db_imap_iptscale src1_db_imap_iptscale;                         /* 0x361c */
    u_src1_db_imap_para_ren src1_db_imap_para_ren;                         /* 0x3620 */
    u_src1_db_imap_para_data src1_db_imap_para_data;                       /* 0x3624 */
    u_src1_db_imap_para_up src1_db_imap_para_up;                           /* 0x3628 */
    u_src1_db_imap_degamma_clip_max src1_db_imap_degamma_clip_max;         /* 0x362c */
    u_src1_db_imap_degamma_clip_min src1_db_imap_degamma_clip_min;         /* 0x3630 */
    u_src1_db_imap_ladj_weight src1_db_imap_ladj_weight;                   /* 0x3634 */
    unsigned int reserved_61[50];                                          /* 50: 0x3638~0x36fc */
    u_src1_db_imap_yuv2rgb_ctrl src1_db_imap_yuv2rgb_ctrl;                 /* 0x3700 */
    u_src1_db_imap_yuv2rgb_coef00 src1_db_imap_yuv2rgb_coef00;             /* 0x3704 */
    u_src1_db_imap_yuv2rgb_coef01 src1_db_imap_yuv2rgb_coef01;             /* 0x3708 */
    u_src1_db_imap_yuv2rgb_coef02 src1_db_imap_yuv2rgb_coef02;             /* 0x370c */
    u_src1_db_imap_yuv2rgb_coef03 src1_db_imap_yuv2rgb_coef03;             /* 0x3710 */
    u_src1_db_imap_yuv2rgb_coef04 src1_db_imap_yuv2rgb_coef04;             /* 0x3714 */
    u_src1_db_imap_yuv2rgb_coef05 src1_db_imap_yuv2rgb_coef05;             /* 0x3718 */
    u_src1_db_imap_yuv2rgb_coef06 src1_db_imap_yuv2rgb_coef06;             /* 0x371c */
    u_src1_db_imap_yuv2rgb_coef07 src1_db_imap_yuv2rgb_coef07;             /* 0x3720 */
    u_src1_db_imap_yuv2rgb_coef08 src1_db_imap_yuv2rgb_coef08;             /* 0x3724 */
    u_src1_db_imap_yuv2rgb_coef10 src1_db_imap_yuv2rgb_coef10;             /* 0x3728 */
    u_src1_db_imap_yuv2rgb_coef11 src1_db_imap_yuv2rgb_coef11;             /* 0x372c */
    u_src1_db_imap_yuv2rgb_coef12 src1_db_imap_yuv2rgb_coef12;             /* 0x3730 */
    u_src1_db_imap_yuv2rgb_coef13 src1_db_imap_yuv2rgb_coef13;             /* 0x3734 */
    u_src1_db_imap_yuv2rgb_coef14 src1_db_imap_yuv2rgb_coef14;             /* 0x3738 */
    u_src1_db_imap_yuv2rgb_coef15 src1_db_imap_yuv2rgb_coef15;             /* 0x373c */
    u_src1_db_imap_yuv2rgb_coef16 src1_db_imap_yuv2rgb_coef16;             /* 0x3740 */
    u_src1_db_imap_yuv2rgb_coef17 src1_db_imap_yuv2rgb_coef17;             /* 0x3744 */
    u_src1_db_imap_yuv2rgb_coef18 src1_db_imap_yuv2rgb_coef18;             /* 0x3748 */
    u_src1_db_imap_yuv2rgb_scale2p src1_db_imap_yuv2rgb_scale2p;           /* 0x374c */
    u_src1_db_imap_yuv2rgb_in_dc00 src1_db_imap_yuv2rgb_in_dc00;           /* 0x3750 */
    u_src1_db_imap_yuv2rgb_in_dc01 src1_db_imap_yuv2rgb_in_dc01;           /* 0x3754 */
    u_src1_db_imap_yuv2rgb_in_dc02 src1_db_imap_yuv2rgb_in_dc02;           /* 0x3758 */
    u_src1_db_imap_yuv2rgb_out_dc00 src1_db_imap_yuv2rgb_out_dc00;         /* 0x375c */
    u_src1_db_imap_yuv2rgb_out_dc01 src1_db_imap_yuv2rgb_out_dc01;         /* 0x3760 */
    u_src1_db_imap_yuv2rgb_out_dc02 src1_db_imap_yuv2rgb_out_dc02;         /* 0x3764 */
    u_src1_db_imap_yuv2rgb_in_dc10 src1_db_imap_yuv2rgb_in_dc10;           /* 0x3768 */
    u_src1_db_imap_yuv2rgb_in_dc11 src1_db_imap_yuv2rgb_in_dc11;           /* 0x376c */
    u_src1_db_imap_yuv2rgb_in_dc12 src1_db_imap_yuv2rgb_in_dc12;           /* 0x3770 */
    u_src1_db_imap_yuv2rgb_out_dc10 src1_db_imap_yuv2rgb_out_dc10;         /* 0x3774 */
    u_src1_db_imap_yuv2rgb_out_dc11 src1_db_imap_yuv2rgb_out_dc11;         /* 0x3778 */
    u_src1_db_imap_yuv2rgb_out_dc12 src1_db_imap_yuv2rgb_out_dc12;         /* 0x377c */
    u_src1_db_imap_yuv2rgb_min src1_db_imap_yuv2rgb_min;                   /* 0x3780 */
    u_src1_db_imap_yuv2rgb_max src1_db_imap_yuv2rgb_max;                   /* 0x3784 */
    u_src1_db_imap_yuv2rgb_thr src1_db_imap_yuv2rgb_thr;                   /* 0x3788 */
    unsigned int reserved_62[29];                                          /* 29: 0x378c~0x37fc */
    u_src1_db_imap_rgb2lms_ctrl src1_db_imap_rgb2lms_ctrl;                 /* 0x3800 */
    u_src1_db_imap_rgb2lms_coef0 src1_db_imap_rgb2lms_coef0;               /* 0x3804 */
    u_src1_db_imap_rgb2lms_coef1 src1_db_imap_rgb2lms_coef1;               /* 0x3808 */
    u_src1_db_imap_rgb2lms_coef2 src1_db_imap_rgb2lms_coef2;               /* 0x380c */
    u_src1_db_imap_rgb2lms_coef3 src1_db_imap_rgb2lms_coef3;               /* 0x3810 */
    u_src1_db_imap_rgb2lms_coef4 src1_db_imap_rgb2lms_coef4;               /* 0x3814 */
    u_src1_db_imap_rgb2lms_coef5 src1_db_imap_rgb2lms_coef5;               /* 0x3818 */
    u_src1_db_imap_rgb2lms_coef6 src1_db_imap_rgb2lms_coef6;               /* 0x381c */
    u_src1_db_imap_rgb2lms_coef7 src1_db_imap_rgb2lms_coef7;               /* 0x3820 */
    u_src1_db_imap_rgb2lms_coef8 src1_db_imap_rgb2lms_coef8;               /* 0x3824 */
    u_src1_db_imap_rgb2lms_scale2p src1_db_imap_rgb2lms_scale2p;           /* 0x3828 */
    u_src1_db_imap_rgb2lms_min src1_db_imap_rgb2lms_min;                   /* 0x382c */
    u_src1_db_imap_rgb2lms_max src1_db_imap_rgb2lms_max;                   /* 0x3830 */
    u_src1_db_imap_rgb2lms_in_dc0 src1_db_imap_rgb2lms_in_dc0;             /* 0x3834 */
    u_src1_db_imap_rgb2lms_in_dc1 src1_db_imap_rgb2lms_in_dc1;             /* 0x3838 */
    u_src1_db_imap_rgb2lms_in_dc2 src1_db_imap_rgb2lms_in_dc2;             /* 0x383c */
    unsigned int reserved_63[48];                                          /* 48: 0x3840~0x38fc */
    u_src1_db_imap_lms2ipt_ctrl src1_db_imap_lms2ipt_ctrl;                 /* 0x3900 */
    u_src1_db_imap_lms2ipt_coef0 src1_db_imap_lms2ipt_coef0;               /* 0x3904 */
    u_src1_db_imap_lms2ipt_coef1 src1_db_imap_lms2ipt_coef1;               /* 0x3908 */
    u_src1_db_imap_lms2ipt_coef2 src1_db_imap_lms2ipt_coef2;               /* 0x390c */
    u_src1_db_imap_lms2ipt_coef3 src1_db_imap_lms2ipt_coef3;               /* 0x3910 */
    u_src1_db_imap_lms2ipt_coef4 src1_db_imap_lms2ipt_coef4;               /* 0x3914 */
    u_src1_db_imap_lms2ipt_coef5 src1_db_imap_lms2ipt_coef5;               /* 0x3918 */
    u_src1_db_imap_lms2ipt_coef6 src1_db_imap_lms2ipt_coef6;               /* 0x391c */
    u_src1_db_imap_lms2ipt_coef7 src1_db_imap_lms2ipt_coef7;               /* 0x3920 */
    u_src1_db_imap_lms2ipt_coef8 src1_db_imap_lms2ipt_coef8;               /* 0x3924 */
    u_src1_db_imap_lms2ipt_scale2p src1_db_imap_lms2ipt_scale2p;           /* 0x3928 */
    u_src1_db_imap_lms2ipt_min src1_db_imap_lms2ipt_min;                   /* 0x392c */
    u_src1_db_imap_lms2ipt_max src1_db_imap_lms2ipt_max;                   /* 0x3930 */
    u_src1_db_imap_lms2ipt_out_dc0 src1_db_imap_lms2ipt_out_dc0;           /* 0x3934 */
    u_src1_db_imap_lms2ipt_out_dc1 src1_db_imap_lms2ipt_out_dc1;           /* 0x3938 */
    u_src1_db_imap_lms2ipt_out_dc2 src1_db_imap_lms2ipt_out_dc2;           /* 0x393c */
    u_src1_db_imap_lms2ipt_in_dc0 src1_db_imap_lms2ipt_in_dc0;             /* 0x3940 */
    u_src1_db_imap_lms2ipt_in_dc1 src1_db_imap_lms2ipt_in_dc1;             /* 0x3944 */
    u_src1_db_imap_lms2ipt_in_dc2 src1_db_imap_lms2ipt_in_dc2;             /* 0x3948 */
    unsigned int reserved_64[45];                                          /* 45: 0x394c~0x39fc */
    u_src1_db_imap_tmap_v1_ctrl src1_db_imap_tmap_v1_ctrl;                 /* 0x3a00 */
    u_src1_db_imap_tmap_v1_ren src1_db_imap_tmap_v1_ren;                   /* 0x3a04 */
    u_src1_db_imap_tmap_v1_data src1_db_imap_tmap_v1_data;                 /* 0x3a08 */
    u_src1_db_imap_tmap_v1_mix_alpha src1_db_imap_tmap_v1_mix_alpha;       /* 0x3a0c */
    u_src1_db_imap_tmap_v1_step1 src1_db_imap_tmap_v1_step1;               /* 0x3a10 */
    u_src1_db_imap_tmap_v1_step2 src1_db_imap_tmap_v1_step2;               /* 0x3a14 */
    u_src1_db_imap_tmap_v1_pos1 src1_db_imap_tmap_v1_pos1;                 /* 0x3a18 */
    u_src1_db_imap_tmap_v1_pos2 src1_db_imap_tmap_v1_pos2;                 /* 0x3a1c */
    u_src1_db_imap_tmap_v1_pos3 src1_db_imap_tmap_v1_pos3;                 /* 0x3a20 */
    u_src1_db_imap_tmap_v1_pos4 src1_db_imap_tmap_v1_pos4;                 /* 0x3a24 */
    u_src1_db_imap_tmap_v1_pos5 src1_db_imap_tmap_v1_pos5;                 /* 0x3a28 */
    u_src1_db_imap_tmap_v1_pos6 src1_db_imap_tmap_v1_pos6;                 /* 0x3a2c */
    u_src1_db_imap_tmap_v1_pos7 src1_db_imap_tmap_v1_pos7;                 /* 0x3a30 */
    u_src1_db_imap_tmap_v1_pos8 src1_db_imap_tmap_v1_pos8;                 /* 0x3a34 */
    u_src1_db_imap_tmap_v1_num1 src1_db_imap_tmap_v1_num1;                 /* 0x3a38 */
    u_src1_db_imap_tmap_v1_num2 src1_db_imap_tmap_v1_num2;                 /* 0x3a3c */
    unsigned int reserved_65[12];                                          /* 12: 0x3a40~0x3a6c */
    u_src1_db_imap_tmap_v1_luma_coef0 src1_db_imap_tmap_v1_luma_coef0;     /* 0x3a70 */
    u_src1_db_imap_tmap_v1_luma_coef1 src1_db_imap_tmap_v1_luma_coef1;     /* 0x3a74 */
    u_src1_db_imap_tmap_v1_luma_coef2 src1_db_imap_tmap_v1_luma_coef2;     /* 0x3a78 */
    u_src1_db_imap_tmap_v1_luma_scale src1_db_imap_tmap_v1_luma_scale;     /* 0x3a7c */
    u_src1_db_imap_tmap_v1_coef_scale src1_db_imap_tmap_v1_coef_scale;     /* 0x3a80 */
    u_src1_db_imap_tmap_v1_out_clip_min src1_db_imap_tmap_v1_out_clip_min; /* 0x3a84 */
    u_src1_db_imap_tmap_v1_out_clip_max src1_db_imap_tmap_v1_out_clip_max; /* 0x3a88 */
    u_src1_db_imap_tmap_v1_out_dc0 src1_db_imap_tmap_v1_out_dc0;           /* 0x3a8c */
    u_src1_db_imap_tmap_v1_out_dc1 src1_db_imap_tmap_v1_out_dc1;           /* 0x3a90 */
    u_src1_db_imap_tmap_v1_out_dc2 src1_db_imap_tmap_v1_out_dc2;           /* 0x3a94 */
    unsigned int reserved_66[26];                                          /* 26: 0x3a98~0x3afc */
    u_src1_db_imap_cacm_reg0 src1_db_imap_cacm_reg0;                       /* 0x3b00 */
    u_src1_db_imap_cacm_reg1 src1_db_imap_cacm_reg1;                       /* 0x3b04 */
    u_src1_db_imap_cacm_reg2 src1_db_imap_cacm_reg2;                       /* 0x3b08 */
    u_src1_db_imap_cacm_reg3 src1_db_imap_cacm_reg3;                       /* 0x3b0c */
} src_hdr_cfg_s;

typedef struct {
    u_src1_xdp_gfx_halfp0 src1_xdp_gfx_halfp0;   /* 0x7000 */
    u_src1_xdp_gfx_halfp1 src1_xdp_gfx_halfp1;   /* 0x7004 */
    u_src1_xdp_gfx_halfp2 src1_xdp_gfx_halfp2;   /* 0x7008 */
    u_src1_xdp_gfx_halfp3 src1_xdp_gfx_halfp3;   /* 0x700c */
    u_src1_xdp_gfx_halfp4 src1_xdp_gfx_halfp4;   /* 0x7010 */
    u_src1_xdp_gfx_halfp5 src1_xdp_gfx_halfp5;   /* 0x7014 */
    u_src1_xdp_gfx_halfp6 src1_xdp_gfx_halfp6;   /* 0x7018 */
    u_src1_xdp_gfx_halfp7 src1_xdp_gfx_halfp7;   /* 0x701c */
    u_src1_xdp_gfx_halfp8 src1_xdp_gfx_halfp8;   /* 0x7020 */
    u_src1_xdp_gfx_halfp9 src1_xdp_gfx_halfp9;   /* 0x7024 */
    u_src1_xdp_gfx_halfp10 src1_xdp_gfx_halfp10; /* 0x7028 */
    u_src1_xdp_gfx_halfp11 src1_xdp_gfx_halfp11; /* 0x702c */
    u_src1_xdp_gfx_halfp12 src1_xdp_gfx_halfp12; /* 0x7030 */
    u_src1_xdp_gfx_halfp13 src1_xdp_gfx_halfp13; /* 0x7034 */
    u_src1_xdp_gfx_halfp14 src1_xdp_gfx_halfp14; /* 0x7038 */
    u_src1_xdp_gfx_halfp15 src1_xdp_gfx_halfp15; /* 0x703c */
    u_src1_xdp_gfx_halfp16 src1_xdp_gfx_halfp16; /* 0x7040 */
    unsigned int reserved_89[47];                /* 47: 0x7044~0x70fc */
} src_vdp_gfx_hal_fp_s;

typedef struct {
    u_tde_src1_hdr_para_haddr_high src1_hdr_para_haddr_high;     /* 0x40 */
    u_tde_src1_hdr_para_haddr_low src1_hdr_para_haddr_low;       /* 0x44 */
    u_tde_src1_hdr_1_para_haddr_high src1_hdr_1_para_haddr_high; /* 0x48 */
    u_tde_src1_hdr_1_para_haddr_low src1_hdr_1_para_haddr_low;   /* 0x4c */
    u_tde_src1_hdr_2_para_haddr_high src1_hdr_2_para_haddr_high; /* 0x50 */
    u_tde_src1_hdr_2_para_haddr_low src1_hdr_2_para_haddr_low;   /* 0x54 */
    u_tde_src1_hdr_3_para_haddr_high src1_hdr_3_para_haddr_high; /* 0x58 */
    u_tde_src1_hdr_3_para_haddr_low src1_hdr_3_para_haddr_low;   /* 0x5c */
} src_hdr_para_addr_s;

typedef struct {
    u_tde_src1_hdr_cfg_addr_low src1_hdr_cfg_addr_low;   /* 0x1a0 */
    u_tde_src1_hdr_cfg_addr_high src1_hdr_cfg_addr_high; /* 0x1a4 */
} src_hdr_cfg_addr_s;

typedef struct {
    u_tde_src1_zme_haddr_high src1_zme_haddr_high;               /* 0x0 */
    u_tde_src1_zme_haddr_low src1_zme_haddr_low;                 /* 0x4 */
    u_tde_src1_zme_vaddr_high src1_zme_vaddr_high;               /* 0x8 */
    u_tde_src1_zme_vaddr_low src1_zme_vaddr_low;                 /* 0xc */
    u_tde_src2_zme_haddr_high src2_zme_haddr_high;               /* 0x10 */
    u_tde_src2_zme_haddr_low src2_zme_haddr_low;                 /* 0x14 */
    u_tde_src2_zme_vaddr_high src2_zme_vaddr_high;               /* 0x18 */
    u_tde_src2_zme_vaddr_low src2_zme_vaddr_low;                 /* 0x1c */
    u_tde_src3_zme_haddr_high src3_zme_haddr_high;               /* 0x20 */
    u_tde_src3_zme_haddr_low src3_zme_haddr_low;                 /* 0x24 */
    u_tde_src3_zme_vaddr_high src3_zme_vaddr_high;               /* 0x28 */
    u_tde_src3_zme_vaddr_low src3_zme_vaddr_low;                 /* 0x2c */
    unsigned int reserved_0[4];                                  /* 4: 0x30~0x3c */
    u_tde_src1_hdr_para_haddr_high src1_hdr_para_haddr_high;     /* 0x40 */
    u_tde_src1_hdr_para_haddr_low src1_hdr_para_haddr_low;       /* 0x44 */
    u_tde_src1_hdr_1_para_haddr_high src1_hdr_1_para_haddr_high; /* 0x48 */
    u_tde_src1_hdr_1_para_haddr_low src1_hdr_1_para_haddr_low;   /* 0x4c */
    u_tde_src1_hdr_2_para_haddr_high src1_hdr_2_para_haddr_high; /* 0x50 */
    u_tde_src1_hdr_2_para_haddr_low src1_hdr_2_para_haddr_low;   /* 0x54 */
    u_tde_src1_hdr_3_para_haddr_high src1_hdr_3_para_haddr_high; /* 0x58 */
    u_tde_src1_hdr_3_para_haddr_low src1_hdr_3_para_haddr_low;   /* 0x5c */
    u_tde_src3_hdr_para_haddr_high src3_hdr_para_haddr_high;     /* 0x60 */
    u_tde_src3_hdr_para_haddr_low src3_hdr_para_haddr_low;       /* 0x64 */
    u_tde_src3_hdr_1_para_haddr_high src3_hdr_1_para_haddr_high; /* 0x68 */
    u_tde_src3_hdr_1_para_haddr_low src3_hdr_1_para_haddr_low;   /* 0x6c */
    u_tde_src3_hdr_2_para_haddr_high src3_hdr_2_para_haddr_high; /* 0x70 */
    u_tde_src3_hdr_2_para_haddr_low src3_hdr_2_para_haddr_low;   /* 0x74 */
    u_tde_src3_hdr_3_para_haddr_high src3_hdr_3_para_haddr_high; /* 0x78 */
    u_tde_src3_hdr_3_para_haddr_low src3_hdr_3_para_haddr_low;   /* 0x7c */
    u_tde_src4_hdr_para_haddr_high src4_hdr_para_haddr_high;     /* 0x80 */
    u_tde_src4_hdr_para_haddr_low src4_hdr_para_haddr_low;       /* 0x84 */
    u_tde_src4_hdr_1_para_haddr_high src4_hdr_1_para_haddr_high; /* 0x88 */
    u_tde_src4_hdr_1_para_haddr_low src4_hdr_1_para_haddr_low;   /* 0x8c */
    u_tde_src4_hdr_2_para_haddr_high src4_hdr_2_para_haddr_high; /* 0x90 */
    u_tde_src4_hdr_2_para_haddr_low src4_hdr_2_para_haddr_low;   /* 0x94 */
    u_tde_src4_hdr_3_para_haddr_high src4_hdr_3_para_haddr_high; /* 0x98 */
    u_tde_src4_hdr_3_para_haddr_low src4_hdr_3_para_haddr_low;   /* 0x9c */
    u_tde_src5_hdr_para_haddr_high src5_hdr_para_haddr_high;     /* 0xa0 */
    u_tde_src5_hdr_para_haddr_low src5_hdr_para_haddr_low;       /* 0xa4 */
    u_tde_src5_hdr_1_para_haddr_high src5_hdr_1_para_haddr_high; /* 0xa8 */
    u_tde_src5_hdr_1_para_haddr_low src5_hdr_1_para_haddr_low;   /* 0xac */
    u_tde_src5_hdr_2_para_haddr_high src5_hdr_2_para_haddr_high; /* 0xb0 */
    u_tde_src5_hdr_2_para_haddr_low src5_hdr_2_para_haddr_low;   /* 0xb4 */
    u_tde_src5_hdr_3_para_haddr_high src5_hdr_3_para_haddr_high; /* 0xb8 */
    u_tde_src5_hdr_3_para_haddr_low src5_hdr_3_para_haddr_low;   /* 0xbc */
    unsigned int reserved_1[16];                                 /* 16: 0xc0~0xfc */
    u_para_up para_up;                                           /* 0x100 */
    unsigned int reserved_2[37];                                 /* 37: 0x104~0x194 */
    u_tde_gfx_cfg_addr_low gfx_cfg_addr_low;                     /* 0x198 */
    u_tde_gfx_addr_high gfx_addr_high;                           /* 0x19c */
    u_tde_src1_hdr_cfg_addr_low src1_hdr_cfg_addr_low;           /* 0x1a0 */
    u_tde_src1_hdr_cfg_addr_high src1_hdr_cfg_addr_high;         /* 0x1a4 */
    u_tde_src3_hdr_cfg_addr_low src3_hdr_cfg_addr_low;           /* 0x1a8 */
    u_tde_src3_hdr_cfg_addr_high src3_hdr_cfg_addr_high;         /* 0x1ac */
    u_tde_src4_hdr_cfg_addr_low src4_hdr_cfg_addr_low;           /* 0x1b0 */
    u_tde_src4_hdr_cfg_addr_high src4_hdr_cfg_addr_high;         /* 0x1b4 */
    u_tde_src5_hdr_cfg_addr_low src5_hdr_cfg_addr_low;           /* 0x1b8 */
    u_tde_src5_hdr_cfg_addr_high src5_hdr_cfg_addr_high;         /* 0x1bc */
    u_tde_zme_cfg_addr_low zme_cfg_addr_low;                     /* 0x1c0 */
    u_tde_zme_cfg_addr_high zme_cfg_addr_high;                   /* 0x1c4 */
    unsigned int reserved_3[2];                                  /* 2: 0x1c8~0x1cc */
    u_tde_lut_cfg_addr_high lut_cfg_addr_high;                   /* 0x1d0 */
    u_tde_lut_cfg_addr_low lut_cfg_addr_low;                     /* 0x1d4 */
    unsigned int reserved_4[2];                                  /* 2: 0x1d8~0x1dc */
    u_tde_cbm_cfg_addr_high cbm_cfg_addr_high;                   /* 0x1e0 */
    u_tde_cbm_cfg_addr_low cbm_cfg_addr_low;                     /* 0x1e4 */
    u_tde_afbc_cfg_addr_high afbc_cfg_addr_high;                 /* 0x1e8 */
    u_tde_afbc_cfg_addr_low afbc_cfg_addr_low;                   /* 0x1ec */
    u_tde_intmask intmask;                                       /* 0x1f0 */
    u_tde_nodeid nodeid;                                         /* 0x1f4 */
    hi_u32 next_node_phyaddr;                                    /* 0x1f8 */
    u_tde_pnext_hi tde_pnext_hi;                                 /* 0x1fc */
    video_layer src_Layer[2];                                    /* 0x200 */
    hi_u32 reserve;                                              /* 0x258 */
    gfx_layer astLayer[8];                                       /* 8: 0x25c ~ 0x358 */
    u_dst_ctrl dst_ctrl;                                         /* 0x35c */
    hi_u32 dst_ch0_addr_h;
    hi_u32 dst_ch0_addr_l;
    hi_u32 dst_ch1_addr_h;
    hi_u32 dst_ch1_addr_l;
    hi_u32 dst_ch2_addr_h;
    hi_u32 dst_ch2_addr_l;
    hi_u32 dst_ch0_stride;
    hi_u32 dst_ch1_stride;
    hi_u32 dst_ch2_stride;
    u_dst_imgsize dst_image_size;        /* 0x384 */
    u_dst_alpha dst_alpha;               /* 0x388 */
    HWC_POS_U unOutCropStart;            /* 0x38c */
    HWC_POS_U unOutCropEnd;              /* 0x390 */
    hi_u32 u32OutPixOffset;              /* 0x394 */
    u_dst_head0_addr_h dst_head0_addr_h; /* 0x398 */
    hi_u32 dst_head0_addr_l;             /* 0x39c */
    u_dst_head1_addr_h dst_head1_addr_h; /* 0x3a0 */
    hi_u32 dst_head1_addr_l;             /* 0x3a4 */
    u_dst_ch0_chk_sum dst_ch0_chk_sum;   /* 0x3a8 */
    u_dst_ch1_chk_sum dst_ch1_chk_sum;   /* 0x3ac */
    u_dst_ch2_chk_sum dst_ch2_chk_sum;   /* 0x3b0 */
    u_dst_cmd_ctrl dst_cmd_ctrl;         /* 0x3b4 */
#ifdef CONFIG_GFX_HWC_VERSION_3_0
    HWC_MMU_PROT_CTL_U unMmuCtl; /* 0x3b8 */
#endif
    u_stt_alpha_addr_h stt_alpha_addr_h; /* 0x3bc */
    u_stt_alpha_addr_l stt_alpha_addr_l; /* 0x3c0 */
    u_dst_head0_stride dst_head0_stride;
    u_dst_head1_stride dst_head1_stride;
    unsigned int reserved_5[13];                           /* 13 :0x3cc~0x3fc */
    u_dst_line_osd_cmp_glb_info dst_line_osd_cmp_glb_info; /* 0x400 */
    u_dst_line_osd_cmp_rc_cfg0 dst_line_osd_cmp_rc_cfg0;   /* 0x404 */
    u_dst_line_osd_cmp_rc_cfg1 dst_line_osd_cmp_rc_cfg1;   /* 0x408 */
    u_dst_line_osd_cmp_rc_cfg2 dst_line_osd_cmp_rc_cfg2;   /* 0x40c */
    u_dst_line_osd_cmp_rc_cfg3 dst_line_osd_cmp_rc_cfg3;   /* 0x410 */
    u_dst_line_osd_cmp_rc_cfg4 dst_line_osd_cmp_rc_cfg4;   /* 0x414 */
    u_dst_line_osd_cmp_rc_cfg5 dst_line_osd_cmp_rc_cfg5;   /* 0x418 */
    u_dst_line_osd_cmp_rc_cfg6 dst_line_osd_cmp_rc_cfg6;   /* 0x41c */
    u_dst_line_osd_cmp_rc_cfg7 dst_line_osd_cmp_rc_cfg7;   /* 0x420 */
    u_dst_line_osd_cmp_rc_cfg8 dst_line_osd_cmp_rc_cfg8;   /* 0x424 */
    u_dst_line_osd_cmp_rc_cfg9 dst_line_osd_cmp_rc_cfg9;   /* 0x428 */
    u_dst_line_osd_cmp_rc_cfg10 dst_line_osd_cmp_rc_cfg10; /* 0x42c */
    u_dst_line_osd_cmp_rc_cfg11 dst_line_osd_cmp_rc_cfg11; /* 0x430 */
    u_dst_line_osd_cmp_rc_cfg12 dst_line_osd_cmp_rc_cfg12; /* 0x434 */
    u_dst_line_osd_cmp_rc_cfg13 dst_line_osd_cmp_rc_cfg13; /* 0x438 */
    u_dst_line_osd_cmp_rc_cfg14 dst_line_osd_cmp_rc_cfg14; /* 0x43c */
    u_dst_line_osd_cmp_rc_cfg15 dst_line_osd_cmp_rc_cfg15; /* 0x440 */
    u_dst_line_osd_cmp_rc_cfg16 dst_line_osd_cmp_rc_cfg16; /* 0x444 */
    u_dst_line_osd_cmp_rsv dst_line_osd_cmp_rsv;
    u_dst_line_osd_cmp_glb_st dst_line_osd_cmp_glb_st;
    u_dst_line_osd_cmp_dbg_reg dst_line_osd_cmp_dbg_reg;
    unsigned int reserved_6[43];                 /* 43: 0x454~0x4fc */
    u_tde_start tde_start;                       /* 0x500 */
    unsigned int reserved_7[3];                  /* 3: 0x504~0x50c */
    u_tde_rawint tde_rawint;                     /* 0x510 */
    u_tde_intstate tde_intstate;                 /* 0x514 */
    unsigned int reserved_8[2];                  /* 2: 0x518~0x51c */
    u_tde_memctrl tde_memctrl;                   /* 0x520 */
    u_tde_memctrl1 tde_memctrl1;                 /* 0x524 */
    unsigned int reserved_9[2];                  /* 2: 0x528~0x52c */
    u_tde_miscellaneous tde_miscellaneous;       /* 0x530 */
    u_tde_timeout tde_timeout;                   /* 0x534 */
    unsigned int reserved_10[50];                /* 50: 0x538~0x5fc */
    u_tde_mst_outstanding tde_mst_outstanding;   /* 0x600 */
    u_tde_mst_ctrl tde_mst_ctrl;                 /* 0x604 */
    unsigned int reserved_11[2];                 /* 2: 0x608~0x60c */
    u_tde_mst_rchn_prio0 tde_mst_rchn_prio0;     /* 0x610 */
    unsigned int reserved_12;                    /* 0x614 */
    u_tde_mst_wchn_prio0 tde_mst_wchn_prio0;     /* 0x618 */
    unsigned int reserved_13[9];                 /* 9: 0x61c~0x63c */
    u_tde_mst_bus_err_clr tde_mst_bus_err_clr;   /* 0x640 */
    u_tde_mst_bus_err tde_mst_bus_err;           /* 0x644 */
    unsigned int reserved_14[2];                 /* 2: 0x648~0x64c */
    u_tde_mst_src0_status0 tde_mst_src0_status0; /* 0x650 */
    u_tde_mst_src0_status1 tde_mst_src0_status1; /* 0x654 */
    unsigned int reserved_15[6];                 /* 6: 0x658~0x66c */
    u_tde_mst_debug_ctrl tde_mst_debug_ctrl;     /* 0x670 */
    u_tde_mst_debug_clr tde_mst_debug_clr;       /* 0x674 */
    unsigned int reserved_16[2];                 /* 2: 0x678~0x67c */
    u_tde_mst0_det_latency tde_mst0_det_latency; /* 0x680 */
    unsigned int reserved_17[3];                 /* 3: 0x684~0x68c */
    u_tde_mst0_rd_info tde_mst0_rd_info;         /* 0x690 */
    u_tde_mst0_wr_info tde_mst0_wr_info;         /* 0x694 */
    unsigned int reserved_18[90];                /* 90: 0x698~0x7fc */
    u_cbmctrl cbm_ctrl;                          /* 0x800 */
    u_cbmprio cbmprio;                           /* 0x804 */
    u_cbmbkgrgb cbmbkgrgb;                       /* 0x808 */
    u_cbmbkga cbmbkga;                           /* 0x80c */
    u_cbmcolorizealu1 cbmcolorizealu1;           /* 0x810 */
    u_cbmparaalu1 cbmparaalu1;                   /* 0x814 */
    u_cbmkeyparaalu1 cbmkeyparaalu1;             /* 0x818 */
    u_cbmkeyminalu1 cbmkeyminalu1;               /* 0x81c */
    u_cbmkeyaminalu1 cbmkeyaminalu1;             /* 0x820 */
    u_cbmkeymaxalu1 cbmkeymaxalu1;               /* 0x824 */
    u_cbmkeyamaxalu1 cbmkeyamaxalu1;             /* 0x828 */
    u_cbmkeymaskalu1 cbmkeymaskalu1;             /* 0x82c */
    u_cbmkeyamaskalu1 cbmkeyamaskalu1;           /* 0x830 */
    u_cbmcolorizealu2 cbmcolorizealu2;           /* 0x834 */
    u_cbmparaalu2 cbmparaalu2;                   /* 0x838 */
    u_cbmkeyparaalu2 cbmkeyparaalu2;             /* 0x83c */
    u_cbmkeyminalu2 cbmkeyminalu2;               /* 0x840 */
    u_cbmkeyaminalu2 cbmkeyaminalu2;             /* 0x844 */
    u_cbmkeymaxalu2 cbmkeymaxalu2;               /* 0x848 */
    u_cbmkeyamaxalu2 cbmkeyamaxalu2;             /* 0x84c */
    u_cbmkeymaskalu2 cbmkeymaskalu2;             /* 0x850 */
    u_cbmkeyamaskalu2 cbmkeyamaskalu2;           /* 0x854 */
    u_srcmiddle_cbmpara srcmiddle_cbmpara;       /* 0x858 */
    HWC_CBMINFO_S cbm_info[10];                  /* 10 layer: 0x85c */
    u_cbmmixwindowctrl1 cbmmixwindowctrl1;       /* 0x8ac */
    u_cbmmixwindowctrl2 cbmmixwindowctrl2;       /* 0x8b0 */
    dim_window_s dim_window[10];                 /* 10 layer: 0x8b4 ~ 0x9f0 */
    window_argb_s window_argb[10];               /* 10 layer: 0x9f4 ~ 0x0B30 */
    u_cbm_imgsize cbm_imgsize;                   /* 0xb34 */
    unsigned int reserved_19[306];               /* 306: 0xb38~0xffc */
    src_zme_s src_zme[3];                        /* 3 layer support zme */
    unsigned int reserved_20[128];               /* 128: 0x17fc */
    u_src1_hpzme src_hpzme[3];                   /* 3 layer support zme */
    unsigned int reserved_26[61];                /* 61: 0x180c~0x18fc */
    hipp_csc_s hipp_csc[3];                      /* 3 for src src3 dst */
    u_tde_csc_ctrl tde_csc_ctrl;                 /* 0x1c00 */
    unsigned int reserved_30[63];                /* 63: 0x1c04~0x1cfc */
    u_dst_h_dswm dst_h_dswm;
    unsigned int reserved_31; /* 0x1d04 */
    u_dst_h_dwsm_hloffset dst_h_dwsm_hloffset;
    u_dst_h_dwsm_hcoffset dst_h_dwsm_hcoffset;
    unsigned int reserved_32[60]; /* 60: 0x1d10~0x1dfc */
    u_dst_v_dswm dst_v_dswm;

    hi_u32 u32AXIID;  /* 0x4f0 */
    hi_u32 u32NodeId; /* 0x4f4 */
    hi_void *pNextNode;
    hi_void *pFirstNode;
} hwc_node;

/* hardware layer ID definition */
#define HWC_LAYER_ID hwc_layer_id

/* horizontal Coefficient Storage: Each 8 Coefficient Group, 3 + 3 + 2 occupies 12 byte */
#define HWC_HORIZON_LUM_PARA_SIZE_PERLEVEL (((GFX2D_FILTER_PHASE * 12) + 0xf) & 0xfffffff0)
/* Vertical Coefficient Storage: Each group of 4 coefficients occupies 8 byte. */
#define HWC_VERTICAL_LUM_PARA_SIZE_PERLEVEL (((GFX2D_FILTER_PHASE * 8) + 0xf) & 0xfffffff0)

#define HWC_HORIZON_CHM_PARA_SIZE_PERLEVEL (((GFX2D_FILTER_PHASE * 12) + 0xf) & 0xfffffff0)
#define HWC_VERTICAL_CHM_PARA_SIZE_PERLEVEL (((GFX2D_FILTER_PHASE * 8) + 0xf) & 0xfffffff0)

#define HWC_HORIZON_PARA_SIZE_PERLEVEL (HWC_HORIZON_LUM_PARA_SIZE_PERLEVEL)
#define HWC_VERTICAL_PARA_SIZE_PERLEVEL (HWC_VERTICAL_LUM_PARA_SIZE_PERLEVEL)

#define HWC_HORIZON_PARA_SIZE_TOTAL (GFX2D_FILTER_LEVELS * HWC_HORIZON_PARA_SIZE_PERLEVEL)
