/*
 * Copyright (c) Huawei Technologies Co., Ltd. 2016-2019. All rights reserved.
 * Description: vpss reg stt head file
 * Author: zhangjunyu
 * Create: 2016/07/01
 */

#ifndef __VPSS_REG_STT_H__
#define __VPSS_REG_STT_H__

/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN00 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin00 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin00;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN01 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin01 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin01;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN02 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin02 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin02;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN03 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin03 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin03;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN04 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin04 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin04;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN05 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin05 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin05;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN06 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin06 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin06;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN07 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin07 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin07;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN08 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin08 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin08;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN09 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin09 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin09;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN10 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin10 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin10;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN11 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin11 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin11;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN12 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin12 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin12;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN13 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin13 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin13;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN14 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin14 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin14;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN15 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin15 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin15;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN16 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin16 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin16;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN17 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin17 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin17;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN18 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin18 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin18;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN19 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin19 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin19;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN20 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin20 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin20;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN21 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin21 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin21;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN22 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin22 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin22;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN23 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin23 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin23;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN24 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin24 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin24;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN25 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin25 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin25;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN26 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin26 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin26;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN27 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin27 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin27;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN28 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin28 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin28;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN29 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin29 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin29;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN30 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin30 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin30;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN31 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin31 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin31;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN32 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin32 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin32;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN33 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin33 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin33;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN34 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin34 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin34;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN35 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin35 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin35;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN36 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin36 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin36;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN37 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin37 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin37;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN38 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin38 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin38;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN39 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin39 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin39;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN40 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin40 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin40;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN41 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin41 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin41;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN42 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin42 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin42;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN43 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin43 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin43;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN44 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin44 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin44;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN45 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin45 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin45;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN46 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin46 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin46;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN47 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin47 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin47;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN48 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin48 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin48;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN49 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin49 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin49;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN50 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin50 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin50;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN51 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin51 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin51;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN52 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin52 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin52;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN53 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin53 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin53;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN54 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin54 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin54;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN55 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin55 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin55;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN56 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin56 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin56;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN57 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin57 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin57;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN58 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin58 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin58;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN59 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin59 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin59;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN60 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin60 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin60;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN61 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin61 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin61;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN62 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin62 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin62;
/* Define the union U_VPSS_WSTT_TMP_AHISTOBIN63 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin63 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_ahistobin63;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD00 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield00 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield00;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD01 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield01 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield01;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD02 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield02 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield02;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD03 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield03 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield03;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD04 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield04 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield04;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD05 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield05 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield05;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD06 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield06 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield06;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD07 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield07 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield07;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD08 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield08 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield08;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD09 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield09 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield09;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD10 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield10 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield10;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD11 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield11 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield11;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD12 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield12 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield12;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD13 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield13 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield13;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD14 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield14 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield14;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD15 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield15 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield15;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD16 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield16 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield16;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD17 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield17 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield17;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD18 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield18 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield18;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD19 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield19 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield19;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD20 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield20 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield20;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD21 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield21 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield21;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD22 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield22 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield22;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD23 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield23 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield23;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD24 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield24 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield24;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD25 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield25 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield25;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD26 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield26 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield26;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD27 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield27 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield27;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD28 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield28 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield28;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD29 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield29 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield29;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD30 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield30 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield30;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD31 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield31 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield31;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD32 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield32 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield32;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD33 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield33 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield33;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD34 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield34 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield34;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD35 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield35 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield35;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD36 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield36 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield36;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD37 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield37 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield37;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD38 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield38 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield38;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD39 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield39 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield39;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD40 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield40 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield40;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD41 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield41 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield41;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD42 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield42 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield42;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD43 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield43 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield43;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD44 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield44 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield44;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD45 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield45 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield45;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD46 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield46 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield46;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD47 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield47 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield47;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD48 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield48 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield48;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD49 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield49 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield49;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD50 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield50 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield50;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD51 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield51 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield51;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD52 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield52 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield52;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD53 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield53 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield53;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD54 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield54 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield54;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD55 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield55 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield55;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD56 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield56 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield56;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD57 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield57 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield57;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD58 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield58 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield58;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD59 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield59 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield59;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD60 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield60 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield60;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD61 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield61 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield61;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD62 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield62 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield62;
/* Define the union U_VPSS_WSTT_TMP_S32HISTOOFNEWESTFIELD63 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield63 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_s32_histoofnewestfield63;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_00 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_00 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_00;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_01 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_01 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_01;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_02 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_02 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_02;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_03 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_03 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_03;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_04 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_04 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_04;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_05 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_05 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_05;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_06 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_06 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_06;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_07 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_07 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_07;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_08 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_08 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_08;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_09 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_09 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_09;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_10 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_10 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_10;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_11 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_11 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_11;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_12 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_12 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_12;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_13 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_13 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_13;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_14 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_14 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_14;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_15 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_15 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_15;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_16 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_16 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_16;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_17 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_17 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_17;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_18 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_18 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_18;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_19 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_19 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_19;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_20 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_20 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_20;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_21 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_21 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_21;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_22 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_22 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_22;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_23 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_23 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_23;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_24 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_24 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_24;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_25 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_25 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_25;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_26 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_26 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_26;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_27 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_27 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_27;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_28 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_28 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_28;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_29 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_29 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_29;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_30 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_30 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_30;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_31 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_31 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_31;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_32 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_32 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_32;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_33 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_33 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_33;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_34 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_34 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_34;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_35 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_35 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_35;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_36 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_36 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_36;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_37 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_37 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_37;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_38 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_38 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_38;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_39 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_39 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_39;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_40 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_40 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_40;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_41 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_41 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_41;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_42 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_42 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_42;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_43 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_43 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_43;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_44 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_44 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_44;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_45 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_45 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_45;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_46 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_46 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_46;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_47 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_47 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_47;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_48 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_48 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_48;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_49 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_49 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_49;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_50 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_50 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_50;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_51 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_51 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_51;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_52 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_52 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_52;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_53 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_53 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_53;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_54 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_54 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_54;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_55 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_55 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_55;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_56 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_56 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_56;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_57 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_57 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_57;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_58 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_58 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_58;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_59 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_59 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_59;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_60 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_60 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_60;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_61 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_61 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_61;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_62 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_62 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_62;
/* Define the union U_VPSS_WSTT_TMP_COMBHISTOBIN6523_63 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_63 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tmp_combhistobin6523_63;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_0;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_1 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_1;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_2 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_2;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_3 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_3;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_4 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_4 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_4;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_5 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_5 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_5;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_6 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_6 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_6;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_7 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_7 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_7;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_8 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_8 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_8;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_9 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_9 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_9;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_10 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_10 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_10;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_11 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_11 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_11;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_12 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_12 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_12;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_13 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_13 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_13;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_14 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_14 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_14;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_15 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_15 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_15;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_16 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vline_stt_in_16 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_16;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_RESERVE0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_reserve0;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_RESERVE1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_reserve1;
/* Define the union U_VPSS_WSTT_HIPP_DI_VLINE_STT_RESERVE2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_vline_stt_reserve2;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_00 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_00 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_00;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_01 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_01 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_01;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_02 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_02 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_02;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_03 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_03 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_03;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_04 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_04 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_04;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_05 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_05 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_05;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_06 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_06 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_06;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_07 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_07 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_07;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_08 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_08 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_08;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_09 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_09 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_09;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_10 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_10 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_10;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_11 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_11 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_11;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_12 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_12 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_12;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_13 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_13 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_13;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_14 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_14 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_14;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_15 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_15 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_15;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_16 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_16 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_16;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_17 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_17 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_17;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_18 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_18 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_18;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_19 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_19 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_19;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_20 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_20 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_20;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_21 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_21 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_21;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_22 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_22 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_22;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_23 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_23 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_23;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_24 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_24 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_24;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_25 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_25 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_25;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_26 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_26 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_26;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_27 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_27 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_27;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_28 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_28 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_28;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_29 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_29 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_29;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_30 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_30 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_30;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_31 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_31 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_31;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_32 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_32 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_32;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_33 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_33 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_33;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_34 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_34 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_34;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_35 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_35 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_35;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_36 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_36 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_36;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_37 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_37 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_37;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_38 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_38 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_38;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_39 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_39 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_39;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_40 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_40 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_40;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_41 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_41 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_41;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_42 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_42 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_42;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_43 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_43 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_43;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_44 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_44 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_44;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_45 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_45 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_45;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_46 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_46 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_46;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_47 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_47 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_47;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_48 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_48 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_48;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_49 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_49 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_49;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_50 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_50 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_50;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_51 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_51 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_51;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_52 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_52 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_52;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_53 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_53 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_53;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_54 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_54 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_54;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_55 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_55 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_55;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_56 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_56 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_56;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_57 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_57 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_57;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_58 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_58 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_58;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_59 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_59 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_59;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_60 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_60 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_60;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_61 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_61 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_61;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_62 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_62 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_62;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6503_63 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_63 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6503_63;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_00 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_00 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_00;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_01 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_01 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_01;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_02 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_02 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_02;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_03 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_03 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_03;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_04 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_04 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_04;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_05 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_05 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_05;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_06 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_06 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_06;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_07 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_07 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_07;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_08 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_08 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_08;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_09 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_09 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_09;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_10 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_10 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_10;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_11 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_11 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_11;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_12 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_12 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_12;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_13 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_13 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_13;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_14 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_14 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_14;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_15 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_15 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_15;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_16 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_16 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_16;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_17 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_17 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_17;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_18 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_18 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_18;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_19 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_19 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_19;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_20 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_20 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_20;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_21 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_21 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_21;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_22 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_22 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_22;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_23 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_23 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_23;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_24 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_24 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_24;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_25 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_25 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_25;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_26 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_26 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_26;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_27 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_27 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_27;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_28 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_28 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_28;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_29 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_29 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_29;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_30 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_30 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_30;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_31 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_31 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_31;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_32 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_32 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_32;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_33 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_33 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_33;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_34 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_34 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_34;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_35 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_35 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_35;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_36 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_36 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_36;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_37 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_37 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_37;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_38 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_38 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_38;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_39 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_39 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_39;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_40 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_40 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_40;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_41 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_41 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_41;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_42 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_42 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_42;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_43 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_43 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_43;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_44 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_44 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_44;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_45 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_45 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_45;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_46 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_46 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_46;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_47 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_47 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_47;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_48 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_48 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_48;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_49 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_49 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_49;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_50 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_50 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_50;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_51 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_51 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_51;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_52 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_52 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_52;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_53 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_53 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_53;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_54 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_54 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_54;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_55 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_55 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_55;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_56 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_56 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_56;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_57 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_57 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_57;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_58 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_58 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_58;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_59 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_59 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_59;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_60 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_60 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_60;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_61 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_61 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_61;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_62 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_62 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_62;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6523_63 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6523_63 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6523_63;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_00 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_00 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_00;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_01 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_01 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_01;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_02 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_02 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_02;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_03 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_03 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_03;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_04 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_04 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_04;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_05 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_05 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_05;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_06 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_06 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_06;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_07 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_07 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_07;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_08 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_08 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_08;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_09 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_09 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_09;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_10 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_10 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_10;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_11 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_11 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_11;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_12 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_12 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_12;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_13 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_13 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_13;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_14 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_14 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_14;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_15 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_15 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_15;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_16 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_16 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_16;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_17 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_17 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_17;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_18 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_18 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_18;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_19 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_19 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_19;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_20 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_20 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_20;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_21 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_21 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_21;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_22 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_22 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_22;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_23 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_23 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_23;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_24 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_24 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_24;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_25 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_25 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_25;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_26 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_26 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_26;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_27 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_27 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_27;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_28 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_28 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_28;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_29 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_29 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_29;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_30 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_30 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_30;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_31 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_31 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_31;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_32 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_32 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_32;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_33 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_33 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_33;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_34 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_34 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_34;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_35 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_35 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_35;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_36 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_36 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_36;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_37 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_37 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_37;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_38 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_38 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_38;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_39 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_39 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_39;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_40 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_40 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_40;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_41 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_41 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_41;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_42 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_42 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_42;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_43 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_43 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_43;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_44 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_44 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_44;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_45 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_45 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_45;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_46 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_46 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_46;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_47 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_47 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_47;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_48 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_48 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_48;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_49 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_49 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_49;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_50 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_50 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_50;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_51 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_51 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_51;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_52 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_52 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_52;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_53 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_53 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_53;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_54 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_54 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_54;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_55 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_55 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_55;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_56 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_56 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_56;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_57 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_57 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_57;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_58 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_58 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_58;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_59 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_59 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_59;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_60 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_60 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_60;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_61 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_61 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_61;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_62 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_62 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_62;
/* Define the union U_VPSS_WSTT_COMBHISTOBIN6512_63 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int combhistobin6503_63 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_combhistobin6512_63;
/* Define the union U_VPSS_WSTT_AHISTOBIN00 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin00 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin00;
/* Define the union U_VPSS_WSTT_AHISTOBIN01 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin01 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin01;
/* Define the union U_VPSS_WSTT_AHISTOBIN02 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin02 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin02;
/* Define the union U_VPSS_WSTT_AHISTOBIN03 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin03 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin03;
/* Define the union U_VPSS_WSTT_AHISTOBIN04 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin04 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin04;
/* Define the union U_VPSS_WSTT_AHISTOBIN05 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin05 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin05;
/* Define the union U_VPSS_WSTT_AHISTOBIN06 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin06 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin06;
/* Define the union U_VPSS_WSTT_AHISTOBIN07 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin07 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin07;
/* Define the union U_VPSS_WSTT_AHISTOBIN08 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin08 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin08;
/* Define the union U_VPSS_WSTT_AHISTOBIN09 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin09 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin09;
/* Define the union U_VPSS_WSTT_AHISTOBIN10 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin10 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin10;
/* Define the union U_VPSS_WSTT_AHISTOBIN11 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin11 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin11;
/* Define the union U_VPSS_WSTT_AHISTOBIN12 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin12 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin12;
/* Define the union U_VPSS_WSTT_AHISTOBIN13 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin13 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin13;
/* Define the union U_VPSS_WSTT_AHISTOBIN14 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin14 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin14;
/* Define the union U_VPSS_WSTT_AHISTOBIN15 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin15 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin15;
/* Define the union U_VPSS_WSTT_AHISTOBIN16 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin16 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin16;
/* Define the union U_VPSS_WSTT_AHISTOBIN17 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin17 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin17;
/* Define the union U_VPSS_WSTT_AHISTOBIN18 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin18 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin18;
/* Define the union U_VPSS_WSTT_AHISTOBIN19 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin19 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin19;
/* Define the union U_VPSS_WSTT_AHISTOBIN20 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin20 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin20;
/* Define the union U_VPSS_WSTT_AHISTOBIN21 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin21 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin21;
/* Define the union U_VPSS_WSTT_AHISTOBIN22 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin22 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin22;
/* Define the union U_VPSS_WSTT_AHISTOBIN23 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin23 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin23;
/* Define the union U_VPSS_WSTT_AHISTOBIN24 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin24 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin24;
/* Define the union U_VPSS_WSTT_AHISTOBIN25 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin25 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin25;
/* Define the union U_VPSS_WSTT_AHISTOBIN26 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin26 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin26;
/* Define the union U_VPSS_WSTT_AHISTOBIN27 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin27 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin27;
/* Define the union U_VPSS_WSTT_AHISTOBIN28 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin28 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin28;
/* Define the union U_VPSS_WSTT_AHISTOBIN29 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin29 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin29;
/* Define the union U_VPSS_WSTT_AHISTOBIN30 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin30 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin30;
/* Define the union U_VPSS_WSTT_AHISTOBIN31 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin31 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin31;
/* Define the union U_VPSS_WSTT_AHISTOBIN32 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin32 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin32;
/* Define the union U_VPSS_WSTT_AHISTOBIN33 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin33 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin33;
/* Define the union U_VPSS_WSTT_AHISTOBIN34 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin34 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin34;
/* Define the union U_VPSS_WSTT_AHISTOBIN35 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin35 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin35;
/* Define the union U_VPSS_WSTT_AHISTOBIN36 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin36 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin36;
/* Define the union U_VPSS_WSTT_AHISTOBIN37 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin37 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin37;
/* Define the union U_VPSS_WSTT_AHISTOBIN38 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin38 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin38;
/* Define the union U_VPSS_WSTT_AHISTOBIN39 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin39 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin39;
/* Define the union U_VPSS_WSTT_AHISTOBIN40 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin40 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin40;
/* Define the union U_VPSS_WSTT_AHISTOBIN41 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin41 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin41;
/* Define the union U_VPSS_WSTT_AHISTOBIN42 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin42 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin42;
/* Define the union U_VPSS_WSTT_AHISTOBIN43 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin43 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin43;
/* Define the union U_VPSS_WSTT_AHISTOBIN44 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin44 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin44;
/* Define the union U_VPSS_WSTT_AHISTOBIN45 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin45 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin45;
/* Define the union U_VPSS_WSTT_AHISTOBIN46 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin46 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin46;
/* Define the union U_VPSS_WSTT_AHISTOBIN47 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin47 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin47;
/* Define the union U_VPSS_WSTT_AHISTOBIN48 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin48 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin48;
/* Define the union U_VPSS_WSTT_AHISTOBIN49 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin49 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin49;
/* Define the union U_VPSS_WSTT_AHISTOBIN50 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin50 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin50;
/* Define the union U_VPSS_WSTT_AHISTOBIN51 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin51 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin51;
/* Define the union U_VPSS_WSTT_AHISTOBIN52 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin52 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin52;
/* Define the union U_VPSS_WSTT_AHISTOBIN53 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin53 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin53;
/* Define the union U_VPSS_WSTT_AHISTOBIN54 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin54 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin54;
/* Define the union U_VPSS_WSTT_AHISTOBIN55 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin55 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin55;
/* Define the union U_VPSS_WSTT_AHISTOBIN56 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin56 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin56;
/* Define the union U_VPSS_WSTT_AHISTOBIN57 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin57 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin57;
/* Define the union U_VPSS_WSTT_AHISTOBIN58 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin58 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin58;
/* Define the union U_VPSS_WSTT_AHISTOBIN59 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin59 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin59;
/* Define the union U_VPSS_WSTT_AHISTOBIN60 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin60 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin60;
/* Define the union U_VPSS_WSTT_AHISTOBIN61 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin61 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin61;
/* Define the union U_VPSS_WSTT_AHISTOBIN62 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin62 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin62;
/* Define the union U_VPSS_WSTT_AHISTOBIN63 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ahistobin63 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ahistobin63;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD00 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield00 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield00;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD01 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield01 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield01;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD02 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield02 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield02;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD03 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield03 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield03;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD04 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield04 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield04;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD05 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield05 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield05;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD06 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield06 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield06;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD07 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield07 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield07;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD08 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield08 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield08;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD09 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield09 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield09;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD10 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield10 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield10;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD11 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield11 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield11;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD12 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield12 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield12;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD13 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield13 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield13;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD14 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield14 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield14;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD15 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield15 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield15;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD16 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield16 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield16;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD17 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield17 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield17;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD18 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield18 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield18;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD19 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield19 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield19;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD20 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield20 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield20;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD21 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield21 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield21;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD22 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield22 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield22;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD23 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield23 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield23;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD24 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield24 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield24;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD25 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield25 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield25;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD26 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield26 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield26;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD27 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield27 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield27;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD28 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield28 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield28;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD29 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield29 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield29;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD30 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield30 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield30;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD31 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield31 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield31;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD32 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield32 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield32;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD33 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield33 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield33;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD34 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield34 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield34;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD35 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield35 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield35;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD36 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield36 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield36;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD37 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield37 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield37;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD38 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield38 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield38;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD39 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield39 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield39;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD40 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield40 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield40;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD41 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield41 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield41;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD42 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield42 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield42;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD43 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield43 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield43;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD44 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield44 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield44;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD45 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield45 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield45;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD46 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield46 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield46;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD47 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield47 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield47;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD48 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield48 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield48;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD49 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield49 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield49;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD50 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield50 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield50;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD51 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield51 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield51;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD52 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield52 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield52;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD53 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield53 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield53;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD54 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield54 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield54;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD55 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield55 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield55;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD56 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield56 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield56;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD57 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield57 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield57;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD58 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield58 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield58;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD59 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield59 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield59;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD60 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield60 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield60;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD61 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield61 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield61;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD62 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield62 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield62;
/* Define the union U_VPSS_WSTT_S32HISTOOFNEWESTFIELD63 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32histoofnewestfield63 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_histoofnewestfield63;
/* Define the union U_VPSS_WSTT_PCCBWDTKR_U */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pccbwdtkr_u : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pccbwdtkr_u;
/* Define the union U_VPSS_WSTT_PCCBWDTKR_D */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pccbwdtkr_d : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pccbwdtkr_d;
/* Define the union U_VPSS_WSTT_PCCBWDTKR_L */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pccbwdtkr_l : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pccbwdtkr_l;
/* Define the union U_VPSS_WSTT_PCCBWDTKR_R */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pccbwdtkr_r : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pccbwdtkr_r;
/* Define the union U_VPSS_WSTT_PCCFWDTKR_U */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pccfwdtkr_u : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pccfwdtkr_u;
/* Define the union U_VPSS_WSTT_PCCFWDTKR_D */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pccfwdtkr_d : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pccfwdtkr_d;
/* Define the union U_VPSS_WSTT_PCCFWDTKR_L */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pccfwdtkr_l : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pccfwdtkr_l;
/* Define the union U_VPSS_WSTT_PCCFWDTKR_R */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pccfwdtkr_r : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pccfwdtkr_r;
/* Define the union U_VPSS_WSTT_PCCMATCH */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pccmatch : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pccmatch;
/* Define the union U_VPSS_WSTT_PCCNONMATCH */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pccnonmatch : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pccnonmatch;
/* Define the union U_VPSS_WSTT_PCCCRSS */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pcccrss : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pcccrss;
/* Define the union U_VPSS_WSTT_PCCFWDTKR */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pccfwdtkr : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pccfwdtkr;
/* Define the union U_VPSS_WSTT_PCCBWDTKR */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pccbwdtkr : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pccbwdtkr;
/* Define the union U_VPSS_WSTT_MATCHUM */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int matchum : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_matchum;
/* Define the union U_VPSS_WSTT_NONMATCHUM */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int nonmatchum : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_nonmatchum;
/* Define the union U_VPSS_WSTT_MATCHUM2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int matchum2 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_matchum2;
/* Define the union U_VPSS_WSTT_NONMATCHUM2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int nonmatchum2 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_nonmatchum2;
/* Define the union U_VPSS_WSTT_S32FRMITDIFF */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32frmitdiff : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_frmitdiff;
/* Define the union U_VPSS_WSTT_S32FRMITDIFFBE */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int s32frmitdiffbe : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_s32_frmitdiffbe;
/* Define the union U_VPSS_WSTT_IFMD_RESERVED_0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ifmd_reserved_0;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_0;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad1 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_1;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad2 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_2;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad3 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_3;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_4 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad4 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_4;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_5 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad5 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_5;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_6 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad6 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_6;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_7 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad7 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_7;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_8 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad8 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_8;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_9 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad9 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_9;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_10 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad10 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_10;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_11 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad11 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_11;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_12 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad12 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_12;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_13 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad13 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_13;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_14 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad14 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_14;
/* Define the union U_VPSS_WSTT_PD_STLBLK_SAD_15 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int stlblk_sad15 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_stlblk_sad_15;
/* Define the union U_VPSS_WSTT_PD_LASI_CNT_00 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int lasi_14_cnt_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_lasi_cnt_00;
/* Define the union U_VPSS_WSTT_PD_LASI_CNT_01 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int lasi_32_cnt_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_lasi_cnt_01;
/* Define the union U_VPSS_WSTT_PD_LASI_CNT_02 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int lasi_34_cnt_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_lasi_cnt_02;
/* Define the union U_VPSS_WSTT_PD_LASI_CNT_10 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int lasi_14_cnt_1 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_lasi_cnt_10;
/* Define the union U_VPSS_WSTT_PD_LASI_CNT_11 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int lasi_32_cnt_1 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_lasi_cnt_11;
/* Define the union U_VPSS_WSTT_PD_LASI_CNT_12 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int lasi_34_cnt_1 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_lasi_cnt_12;
/* Define the union U_VPSS_WSTT_PD_RESERVED_0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_reserved_0;
/* Define the union U_VPSS_WSTT_PD_RESERVED_1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_pd_reserved_1;
/* Define the union U_VPSS_WSTT_HIPP_DI_FILM0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int film_video_max_num : 10; /* [9..0] */
        unsigned int reserved_0 : 22;         /* [31..10] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_film0;

/* Define the union U_VPSS_WSTT_HIPP_DI_FILM1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int film_video_line_num : 10; /* [9..0] */
        unsigned int reserved_0 : 22;          /* [31..10] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_film1;

/* Define the union U_VPSS_WSTT_HIPP_DI_FILM2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int blk_fea_cnt_frame : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_film2;
/* Define the union U_VPSS_WSTT_HIPP_DI_FILM3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int pxl_fea_cnt_frame : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_film3;
/* Define the union U_VPSS_WSTT_HIPP_DI_FILM4 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int max_err_line : 10; /* [9..0] */
        unsigned int reserved_0 : 22;   /* [31..10] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_film4;

/* Define the union U_VPSS_WSTT_HIPP_DI_FILM5 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int total_err_line : 10; /* [9..0] */
        unsigned int reserved_0 : 22;     /* [31..10] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_film5;

/* Define the union U_VPSS_WSTT_HIPP_DI_RESERVE0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_reserve0;
/* Define the union U_VPSS_WSTT_HIPP_DI_RESERVE1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_reserve1;
/* Define the union U_VPSS_WSTT_HIPP_DI_JITTER0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int jitter_small_mv_num0 : 16; /* [15..0] */
        unsigned int jitter_small_mv_num1 : 16; /* [31..16] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_jitter0;

/* Define the union U_VPSS_WSTT_HIPP_DI_JITTER1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int jitter_small_mv_num2 : 16; /* [15..0] */
        unsigned int jitter_small_mv_num3 : 16; /* [31..16] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_jitter1;

/* Define the union U_VPSS_WSTT_HIPP_DI_JITTER2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int jitter_big_mv_num0 : 16; /* [15..0] */
        unsigned int jitter_big_mv_num1 : 16; /* [31..16] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_jitter2;

/* Define the union U_VPSS_WSTT_HIPP_DI_JITTER3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int jitter_big_mv_num2 : 16; /* [15..0] */
        unsigned int jitter_big_mv_num3 : 16; /* [31..16] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_jitter3;

/* Define the union U_VPSS_WSTT_HIPP_DI_SLIGHT0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int still_cnt : 22;  /* [21..0] */
        unsigned int reserved_0 : 10; /* [31..22] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_slight0;

/* Define the union U_VPSS_WSTT_HIPP_DI_SLIGHT1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int still_fea_cnt : 22; /* [21..0] */
        unsigned int reserved_0 : 10;    /* [31..22] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_slight1;

/* Define the union U_VPSS_WSTT_HIPP_DI_SLIGHT2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int not_found_fea_cnt : 22; /* [21..0] */
        unsigned int reserved_0 : 10;        /* [31..22] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_slight2;

/* Define the union U_VPSS_WSTT_HIPP_DI_RESERVE2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_reserve2;
/* Define the union U_VPSS_WSTT_HIPP_DI_FUSION0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int jitter_area_mc_fea_cnt : 22; /* [21..0] */
        unsigned int reserved_0 : 10;             /* [31..22] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_fusion0;

/* Define the union U_VPSS_WSTT_HIPP_DI_FUSION1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int non_jitter_area_mc_fea_cnt : 22; /* [21..0] */
        unsigned int reserved_0 : 10;                 /* [31..22] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_fusion1;

/* Define the union U_VPSS_WSTT_HIPP_DI_RESERVE3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_reserve3;
/* Define the union U_VPSS_WSTT_HIPP_DI_RESERVE4 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_hipp_di_reserve4;
/* Define the union U_VPSS_WSTT_MT_STAT0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int mt_stat0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_mt_stat0;
/* Define the union U_VPSS_WSTT_MT_STAT1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int mt_stat1 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_mt_stat1;
/* Define the union U_VPSS_WSTT_MT_STAT2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int mt_stat2 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_mt_stat2;
/* Define the union U_VPSS_WSTT_MT_STAT3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int mt_stat3 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_mt_stat3;
/* Define the union U_VPSS_WSTT_ZMVSAD_STAT0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int zmvsad_stat0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_zmvsad_stat0;
/* Define the union U_VPSS_WSTT_ZMVSAD_STAT1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int zmvsad_stat1 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_zmvsad_stat1;
/* Define the union U_VPSS_WSTT_ZMVSAD_STAT2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int zmvsad_stat2 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_zmvsad_stat2;
/* Define the union U_VPSS_WSTT_ZMVSAD_STAT3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int zmvsad_stat3 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_zmvsad_stat3;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_1 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_1;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_2 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_2;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_3 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_3;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_4 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_4 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_4;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_5 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_5 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_5;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_6 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_6 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_6;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_7 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_7 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_7;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_8 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_8 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_8;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_9 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_9 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_9;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_10 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_10 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_10;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_11 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_11 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_11;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_12 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_12 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_12;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_13 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_13 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_13;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_14 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_14 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_14;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_15 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_15 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_15;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_16 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_16 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_16;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_17 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_17 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_17;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_18 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_18 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_18;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_19 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_19 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_19;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_20 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_20 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_20;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_21 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_21 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_21;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_22 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_22 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_22;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_23 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_23 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_23;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_24 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_24 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_24;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_25 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_25 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_25;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_26 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_26 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_26;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_27 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_27 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_27;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_28 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_28 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_28;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_29 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_29 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_29;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_30 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_30 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_30;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_31 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_31 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_31;
/* Define the union U_VPSS_WSTT_SCD_HIST_BIN_32 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int scd_hist_bin_32 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_scd_hist_bin_32;
/* Define the union U_VPSS_WSTT_TNR_NOISEPOINTCNT_MIN */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int noisepointcntmin : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tnr_noisepointcnt_min;
/* Define the union U_VPSS_WSTT_TNR_NOISEPOINTCNT_MED */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int noisepointcntmed : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tnr_noisepointcnt_med;
/* Define the union U_VPSS_WSTT_TNR_NOISEPOINTCNT_MAX */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int noisepointcntmax : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tnr_noisepointcnt_max;
/* Define the union U_VPSS_WSTT_TNR_NOISEPOINTNUM */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int noisepointnum : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tnr_noisepointnum;
/* Define the union U_VPSS_WSTT_TNR_SUMNOISEINFO_MIN */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int sumnoiseinfomin : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tnr_sumnoiseinfo_min;
/* Define the union U_VPSS_WSTT_TNR_SUMNOISEINFO_MED */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int sumnoiseinfomed : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tnr_sumnoiseinfo_med;
/* Define the union U_VPSS_WSTT_TNR_SUMNOISEINFO_MAX */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int sumnoiseinfomax : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tnr_sumnoiseinfo_max;
/* Define the union U_VPSS_WSTT_TNR_RESERVED */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_tnr_reserved;
/* Define the union U_VPSS_WSTT_DB_HY_COUNTER */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int db_hy_counter : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hy_counter;
/* Define the union U_VPSS_WSTT_DB_BORDER */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int db_border : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_border;
/* Define the union U_VPSS_WSTT_DB_HY_SIZE */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hy_size : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;  /* [15..7] */
        unsigned int hy_counter : 12; /* [27..16] */
        unsigned int reserved_1 : 4;  /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hy_size;

/* Define the union U_VPSS_WSTT_DB_HC_SIZE */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hc_size : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;  /* [15..7] */
        unsigned int hc_counter : 12; /* [27..16] */
        unsigned int reserved_1 : 4;  /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hc_size;

/* Define the union U_VPSS_WSTT_DB_VY_SIZE */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vy_size : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;  /* [15..7] */
        unsigned int vy_counter : 12; /* [27..16] */
        unsigned int reserved_1 : 4;  /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_vy_size;

/* Define the union U_VPSS_WSTT_DB_MAX_INDEX */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hy_val_idx : 3; /* [2..0] */
        unsigned int reserved_0 : 1; /* [3] */
        unsigned int hy_wgt_idx : 3; /* [6..4] */
        unsigned int reserved_1 : 1; /* [7] */
        unsigned int vy_val_idx : 3; /* [10..8] */
        unsigned int reserved_2 : 1; /* [11] */
        unsigned int vy_wgt_idx : 3; /* [14..12] */
        unsigned int reserved_3 : 1; /* [15] */
        unsigned int hu_val_idx : 3; /* [18..16] */
        unsigned int reserved_4 : 1; /* [19] */
        unsigned int hu_wgt_idx : 3; /* [22..20] */
        unsigned int reserved_5 : 1; /* [23] */
        unsigned int hv_val_idx : 3; /* [26..24] */
        unsigned int reserved_6 : 1; /* [27] */
        unsigned int hv_wgt_idx : 3; /* [30..28] */
        unsigned int reserved_7 : 1; /* [31] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_max_index;

/* Define the union U_VPSS_WSTT_DB_HY_SIZE_IDX0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hy_size_idx0 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hy_counter_idx0 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hy_size_idx0;

/* Define the union U_VPSS_WSTT_DB_HY_SIZE_IDX1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hy_size_idx1 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hy_counter_idx1 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hy_size_idx1;

/* Define the union U_VPSS_WSTT_DB_HY_SIZE_IDX2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hy_size_idx2 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hy_counter_idx2 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hy_size_idx2;

/* Define the union U_VPSS_WSTT_DB_HY_SIZE_IDX3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hy_size_idx3 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hy_counter_idx3 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hy_size_idx3;

/* Define the union U_VPSS_WSTT_DB_HY_SIZE_IDX4 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hy_size_idx4 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hy_counter_idx4 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hy_size_idx4;

/* Define the union U_VPSS_WSTT_DB_HY_SIZE_IDX5 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hy_size_idx5 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hy_counter_idx5 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hy_size_idx5;

/* Define the union U_VPSS_WSTT_DB_HY_SIZE_IDX6 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hy_size_idx6 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hy_counter_idx6 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hy_size_idx6;

/* Define the union U_VPSS_WSTT_DB_HY_SIZE_IDX7 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hy_size_idx7 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hy_counter_idx7 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hy_size_idx7;

/* Define the union U_VPSS_WSTT_DB_VY_SIZE_IDX0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vy_size_idx0 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int vy_counter_idx0 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_vy_size_idx0;

/* Define the union U_VPSS_WSTT_DB_VY_SIZE_IDX1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vy_size_idx1 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int vy_counter_idx1 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_vy_size_idx1;

/* Define the union U_VPSS_WSTT_DB_VY_SIZE_IDX2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vy_size_idx2 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int vy_counter_idx2 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_vy_size_idx2;

/* Define the union U_VPSS_WSTT_DB_VY_SIZE_IDX3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vy_size_idx3 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int vy_counter_idx3 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_vy_size_idx3;

/* Define the union U_VPSS_WSTT_DB_VY_SIZE_IDX4 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vy_size_idx4 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int vy_counter_idx4 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_vy_size_idx4;

/* Define the union U_VPSS_WSTT_DB_VY_SIZE_IDX5 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vy_size_idx5 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int vy_counter_idx5 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_vy_size_idx5;

/* Define the union U_VPSS_WSTT_DB_VY_SIZE_IDX6 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vy_size_idx6 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int vy_counter_idx6 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_vy_size_idx6;

/* Define the union U_VPSS_WSTT_DB_VY_SIZE_IDX7 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int vy_size_idx7 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int vy_counter_idx7 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_vy_size_idx7;

/* Define the union U_VPSS_WSTT_DB_HU_SIZE_IDX0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hu_size_idx0 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hu_counter_idx0 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hu_size_idx0;

/* Define the union U_VPSS_WSTT_DB_HU_SIZE_IDX1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hu_size_idx1 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hu_counter_idx1 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hu_size_idx1;

/* Define the union U_VPSS_WSTT_DB_HU_SIZE_IDX2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hu_size_idx2 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hu_counter_idx2 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hu_size_idx2;

/* Define the union U_VPSS_WSTT_DB_HU_SIZE_IDX3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hu_size_idx3 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hu_counter_idx3 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hu_size_idx3;

/* Define the union U_VPSS_WSTT_DB_HU_SIZE_IDX4 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hu_size_idx4 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hu_counter_idx4 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hu_size_idx4;

/* Define the union U_VPSS_WSTT_DB_HU_SIZE_IDX5 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hu_size_idx5 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hu_counter_idx5 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hu_size_idx5;

/* Define the union U_VPSS_WSTT_DB_HU_SIZE_IDX6 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hu_size_idx6 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hu_counter_idx6 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hu_size_idx6;

/* Define the union U_VPSS_WSTT_DB_HU_SIZE_IDX7 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hu_size_idx7 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hu_counter_idx7 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hu_size_idx7;

/* Define the union U_VPSS_WSTT_DB_HV_SIZE_IDX0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hv_size_idx0 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hv_counter_idx0 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hv_size_idx0;

/* Define the union U_VPSS_WSTT_DB_HV_SIZE_IDX1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hv_size_idx1 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hv_counter_idx1 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hv_size_idx1;

/* Define the union U_VPSS_WSTT_DB_HV_SIZE_IDX2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hv_size_idx2 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hv_counter_idx2 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hv_size_idx2;

/* Define the union U_VPSS_WSTT_DB_HV_SIZE_IDX3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hv_size_idx3 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hv_counter_idx3 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hv_size_idx3;

/* Define the union U_VPSS_WSTT_DB_HV_SIZE_IDX4 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hv_size_idx4 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hv_counter_idx4 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hv_size_idx4;

/* Define the union U_VPSS_WSTT_DB_HV_SIZE_IDX5 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hv_size_idx5 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hv_counter_idx5 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hv_size_idx5;

/* Define the union U_VPSS_WSTT_DB_HV_SIZE_IDX6 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hv_size_idx6 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hv_counter_idx6 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hv_size_idx6;

/* Define the union U_VPSS_WSTT_DB_HV_SIZE_IDX7 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int hv_size_idx7 : 7;     /* [6..0] */
        unsigned int reserved_0 : 9;       /* [15..7] */
        unsigned int hv_counter_idx7 : 12; /* [27..16] */
        unsigned int reserved_1 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_hv_size_idx7;

/* Define the union U_VPSS_WSTT_DB_BORD_STR */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int bord_str_vy : 8; /* [7..0] */
        unsigned int bord_str_hy : 8; /* [15..8] */
        unsigned int reserved_0 : 16; /* [31..16] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_bord_str;

/* Define the union U_VPSS_WSTT_DB_RESERVED_0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_reserved_0;
/* Define the union U_VPSS_WSTT_DB_RESERVED_1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_reserved_1;
/* Define the union U_VPSS_WSTT_DB_RESERVED_2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_db_reserved_2;
/* Define the union U_VPSS_WSTT_CCS_2D_GLBCC */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int ccs_2d_glbcc : 20; /* [19..0] */
        unsigned int reserved_0 : 12;   /* [31..20] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ccs_2_d_glbcc;

/* Define the union U_VPSS_WSTT_CCS_2D_RESERVED_0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ccs_2_d_reserved_0;
/* Define the union U_VPSS_WSTT_CCS_2D_RESERVED_1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ccs_2_d_reserved_1;
/* Define the union U_VPSS_WSTT_CCS_2D_RESERVED_2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int reserved_0 : 32; /* [31..0] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_ccs_2_d_reserved_2;
/* Define the union U_VPSS_WSTT_LBD_STT_SPACE_0 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int space_top : 12; /* [11..0] */
        unsigned int reserved_0 : 4; /* [15..12] */
        unsigned int space_bot : 12; /* [27..16] */
        unsigned int reserved_1 : 4; /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_lbd_stt_space_0;

/* Define the union U_VPSS_WSTT_LBD_STT_SPACE_1 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int space_left : 12;  /* [11..0] */
        unsigned int reserved_0 : 4;   /* [15..12] */
        unsigned int space_right : 12; /* [27..16] */
        unsigned int reserved_1 : 4;   /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_lbd_stt_space_1;

/* Define the union U_VPSS_WSTT_LBD_STT_SPACE_2 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int temp_top_shift : 4;   /* [3..0] */
        unsigned int reserved_0 : 4;       /* [7..4] */
        unsigned int temp_bot_shift : 4;   /* [11..8] */
        unsigned int reserved_1 : 4;       /* [15..12] */
        unsigned int temp_left_shift : 4;  /* [19..16] */
        unsigned int reserved_2 : 4;       /* [23..20] */
        unsigned int temp_right_shift : 4; /* [27..24] */
        unsigned int reserved_3 : 4;       /* [31..28] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_lbd_stt_space_2;

/* Define the union U_VPSS_WSTT_LBD_STT_SPACE_3 */
typedef union {
    /* Define the struct bits */
    struct {
        unsigned int frm_flag : 1;    /* [0] */
        unsigned int reserved_0 : 31; /* [31..1] */
    } bits;

    /* Define an unsigned member */
    unsigned int u32;
} u_vpss_wstt_lbd_stt_space_3;

// ==============================================================================
/* Define the global struct */
typedef struct {
    u_vpss_wstt_tmp_ahistobin00 vpss_wstt_tmp_ahistobin00;                           /* 0x0 */
    u_vpss_wstt_tmp_ahistobin01 vpss_wstt_tmp_ahistobin01;                           /* 0x4 */
    u_vpss_wstt_tmp_ahistobin02 vpss_wstt_tmp_ahistobin02;                           /* 0x8 */
    u_vpss_wstt_tmp_ahistobin03 vpss_wstt_tmp_ahistobin03;                           /* 0xc */
    u_vpss_wstt_tmp_ahistobin04 vpss_wstt_tmp_ahistobin04;                           /* 0x10 */
    u_vpss_wstt_tmp_ahistobin05 vpss_wstt_tmp_ahistobin05;                           /* 0x14 */
    u_vpss_wstt_tmp_ahistobin06 vpss_wstt_tmp_ahistobin06;                           /* 0x18 */
    u_vpss_wstt_tmp_ahistobin07 vpss_wstt_tmp_ahistobin07;                           /* 0x1c */
    u_vpss_wstt_tmp_ahistobin08 vpss_wstt_tmp_ahistobin08;                           /* 0x20 */
    u_vpss_wstt_tmp_ahistobin09 vpss_wstt_tmp_ahistobin09;                           /* 0x24 */
    u_vpss_wstt_tmp_ahistobin10 vpss_wstt_tmp_ahistobin10;                           /* 0x28 */
    u_vpss_wstt_tmp_ahistobin11 vpss_wstt_tmp_ahistobin11;                           /* 0x2c */
    u_vpss_wstt_tmp_ahistobin12 vpss_wstt_tmp_ahistobin12;                           /* 0x30 */
    u_vpss_wstt_tmp_ahistobin13 vpss_wstt_tmp_ahistobin13;                           /* 0x34 */
    u_vpss_wstt_tmp_ahistobin14 vpss_wstt_tmp_ahistobin14;                           /* 0x38 */
    u_vpss_wstt_tmp_ahistobin15 vpss_wstt_tmp_ahistobin15;                           /* 0x3c */
    u_vpss_wstt_tmp_ahistobin16 vpss_wstt_tmp_ahistobin16;                           /* 0x40 */
    u_vpss_wstt_tmp_ahistobin17 vpss_wstt_tmp_ahistobin17;                           /* 0x44 */
    u_vpss_wstt_tmp_ahistobin18 vpss_wstt_tmp_ahistobin18;                           /* 0x48 */
    u_vpss_wstt_tmp_ahistobin19 vpss_wstt_tmp_ahistobin19;                           /* 0x4c */
    u_vpss_wstt_tmp_ahistobin20 vpss_wstt_tmp_ahistobin20;                           /* 0x50 */
    u_vpss_wstt_tmp_ahistobin21 vpss_wstt_tmp_ahistobin21;                           /* 0x54 */
    u_vpss_wstt_tmp_ahistobin22 vpss_wstt_tmp_ahistobin22;                           /* 0x58 */
    u_vpss_wstt_tmp_ahistobin23 vpss_wstt_tmp_ahistobin23;                           /* 0x5c */
    u_vpss_wstt_tmp_ahistobin24 vpss_wstt_tmp_ahistobin24;                           /* 0x60 */
    u_vpss_wstt_tmp_ahistobin25 vpss_wstt_tmp_ahistobin25;                           /* 0x64 */
    u_vpss_wstt_tmp_ahistobin26 vpss_wstt_tmp_ahistobin26;                           /* 0x68 */
    u_vpss_wstt_tmp_ahistobin27 vpss_wstt_tmp_ahistobin27;                           /* 0x6c */
    u_vpss_wstt_tmp_ahistobin28 vpss_wstt_tmp_ahistobin28;                           /* 0x70 */
    u_vpss_wstt_tmp_ahistobin29 vpss_wstt_tmp_ahistobin29;                           /* 0x74 */
    u_vpss_wstt_tmp_ahistobin30 vpss_wstt_tmp_ahistobin30;                           /* 0x78 */
    u_vpss_wstt_tmp_ahistobin31 vpss_wstt_tmp_ahistobin31;                           /* 0x7c */
    u_vpss_wstt_tmp_ahistobin32 vpss_wstt_tmp_ahistobin32;                           /* 0x80 */
    u_vpss_wstt_tmp_ahistobin33 vpss_wstt_tmp_ahistobin33;                           /* 0x84 */
    u_vpss_wstt_tmp_ahistobin34 vpss_wstt_tmp_ahistobin34;                           /* 0x88 */
    u_vpss_wstt_tmp_ahistobin35 vpss_wstt_tmp_ahistobin35;                           /* 0x8c */
    u_vpss_wstt_tmp_ahistobin36 vpss_wstt_tmp_ahistobin36;                           /* 0x90 */
    u_vpss_wstt_tmp_ahistobin37 vpss_wstt_tmp_ahistobin37;                           /* 0x94 */
    u_vpss_wstt_tmp_ahistobin38 vpss_wstt_tmp_ahistobin38;                           /* 0x98 */
    u_vpss_wstt_tmp_ahistobin39 vpss_wstt_tmp_ahistobin39;                           /* 0x9c */
    u_vpss_wstt_tmp_ahistobin40 vpss_wstt_tmp_ahistobin40;                           /* 0xa0 */
    u_vpss_wstt_tmp_ahistobin41 vpss_wstt_tmp_ahistobin41;                           /* 0xa4 */
    u_vpss_wstt_tmp_ahistobin42 vpss_wstt_tmp_ahistobin42;                           /* 0xa8 */
    u_vpss_wstt_tmp_ahistobin43 vpss_wstt_tmp_ahistobin43;                           /* 0xac */
    u_vpss_wstt_tmp_ahistobin44 vpss_wstt_tmp_ahistobin44;                           /* 0xb0 */
    u_vpss_wstt_tmp_ahistobin45 vpss_wstt_tmp_ahistobin45;                           /* 0xb4 */
    u_vpss_wstt_tmp_ahistobin46 vpss_wstt_tmp_ahistobin46;                           /* 0xb8 */
    u_vpss_wstt_tmp_ahistobin47 vpss_wstt_tmp_ahistobin47;                           /* 0xbc */
    u_vpss_wstt_tmp_ahistobin48 vpss_wstt_tmp_ahistobin48;                           /* 0xc0 */
    u_vpss_wstt_tmp_ahistobin49 vpss_wstt_tmp_ahistobin49;                           /* 0xc4 */
    u_vpss_wstt_tmp_ahistobin50 vpss_wstt_tmp_ahistobin50;                           /* 0xc8 */
    u_vpss_wstt_tmp_ahistobin51 vpss_wstt_tmp_ahistobin51;                           /* 0xcc */
    u_vpss_wstt_tmp_ahistobin52 vpss_wstt_tmp_ahistobin52;                           /* 0xd0 */
    u_vpss_wstt_tmp_ahistobin53 vpss_wstt_tmp_ahistobin53;                           /* 0xd4 */
    u_vpss_wstt_tmp_ahistobin54 vpss_wstt_tmp_ahistobin54;                           /* 0xd8 */
    u_vpss_wstt_tmp_ahistobin55 vpss_wstt_tmp_ahistobin55;                           /* 0xdc */
    u_vpss_wstt_tmp_ahistobin56 vpss_wstt_tmp_ahistobin56;                           /* 0xe0 */
    u_vpss_wstt_tmp_ahistobin57 vpss_wstt_tmp_ahistobin57;                           /* 0xe4 */
    u_vpss_wstt_tmp_ahistobin58 vpss_wstt_tmp_ahistobin58;                           /* 0xe8 */
    u_vpss_wstt_tmp_ahistobin59 vpss_wstt_tmp_ahistobin59;                           /* 0xec */
    u_vpss_wstt_tmp_ahistobin60 vpss_wstt_tmp_ahistobin60;                           /* 0xf0 */
    u_vpss_wstt_tmp_ahistobin61 vpss_wstt_tmp_ahistobin61;                           /* 0xf4 */
    u_vpss_wstt_tmp_ahistobin62 vpss_wstt_tmp_ahistobin62;                           /* 0xf8 */
    u_vpss_wstt_tmp_ahistobin63 vpss_wstt_tmp_ahistobin63;                           /* 0xfc */
    u_vpss_wstt_tmp_s32_histoofnewestfield00 vpss_wstt_tmp_s32_histoofnewestfield00; /* 0x100 */
    u_vpss_wstt_tmp_s32_histoofnewestfield01 vpss_wstt_tmp_s32_histoofnewestfield01; /* 0x104 */
    u_vpss_wstt_tmp_s32_histoofnewestfield02 vpss_wstt_tmp_s32_histoofnewestfield02; /* 0x108 */
    u_vpss_wstt_tmp_s32_histoofnewestfield03 vpss_wstt_tmp_s32_histoofnewestfield03; /* 0x10c */
    u_vpss_wstt_tmp_s32_histoofnewestfield04 vpss_wstt_tmp_s32_histoofnewestfield04; /* 0x110 */
    u_vpss_wstt_tmp_s32_histoofnewestfield05 vpss_wstt_tmp_s32_histoofnewestfield05; /* 0x114 */
    u_vpss_wstt_tmp_s32_histoofnewestfield06 vpss_wstt_tmp_s32_histoofnewestfield06; /* 0x118 */
    u_vpss_wstt_tmp_s32_histoofnewestfield07 vpss_wstt_tmp_s32_histoofnewestfield07; /* 0x11c */
    u_vpss_wstt_tmp_s32_histoofnewestfield08 vpss_wstt_tmp_s32_histoofnewestfield08; /* 0x120 */
    u_vpss_wstt_tmp_s32_histoofnewestfield09 vpss_wstt_tmp_s32_histoofnewestfield09; /* 0x124 */
    u_vpss_wstt_tmp_s32_histoofnewestfield10 vpss_wstt_tmp_s32_histoofnewestfield10; /* 0x128 */
    u_vpss_wstt_tmp_s32_histoofnewestfield11 vpss_wstt_tmp_s32_histoofnewestfield11; /* 0x12c */
    u_vpss_wstt_tmp_s32_histoofnewestfield12 vpss_wstt_tmp_s32_histoofnewestfield12; /* 0x130 */
    u_vpss_wstt_tmp_s32_histoofnewestfield13 vpss_wstt_tmp_s32_histoofnewestfield13; /* 0x134 */
    u_vpss_wstt_tmp_s32_histoofnewestfield14 vpss_wstt_tmp_s32_histoofnewestfield14; /* 0x138 */
    u_vpss_wstt_tmp_s32_histoofnewestfield15 vpss_wstt_tmp_s32_histoofnewestfield15; /* 0x13c */
    u_vpss_wstt_tmp_s32_histoofnewestfield16 vpss_wstt_tmp_s32_histoofnewestfield16; /* 0x140 */
    u_vpss_wstt_tmp_s32_histoofnewestfield17 vpss_wstt_tmp_s32_histoofnewestfield17; /* 0x144 */
    u_vpss_wstt_tmp_s32_histoofnewestfield18 vpss_wstt_tmp_s32_histoofnewestfield18; /* 0x148 */
    u_vpss_wstt_tmp_s32_histoofnewestfield19 vpss_wstt_tmp_s32_histoofnewestfield19; /* 0x14c */
    u_vpss_wstt_tmp_s32_histoofnewestfield20 vpss_wstt_tmp_s32_histoofnewestfield20; /* 0x150 */
    u_vpss_wstt_tmp_s32_histoofnewestfield21 vpss_wstt_tmp_s32_histoofnewestfield21; /* 0x154 */
    u_vpss_wstt_tmp_s32_histoofnewestfield22 vpss_wstt_tmp_s32_histoofnewestfield22; /* 0x158 */
    u_vpss_wstt_tmp_s32_histoofnewestfield23 vpss_wstt_tmp_s32_histoofnewestfield23; /* 0x15c */
    u_vpss_wstt_tmp_s32_histoofnewestfield24 vpss_wstt_tmp_s32_histoofnewestfield24; /* 0x160 */
    u_vpss_wstt_tmp_s32_histoofnewestfield25 vpss_wstt_tmp_s32_histoofnewestfield25; /* 0x164 */
    u_vpss_wstt_tmp_s32_histoofnewestfield26 vpss_wstt_tmp_s32_histoofnewestfield26; /* 0x168 */
    u_vpss_wstt_tmp_s32_histoofnewestfield27 vpss_wstt_tmp_s32_histoofnewestfield27; /* 0x16c */
    u_vpss_wstt_tmp_s32_histoofnewestfield28 vpss_wstt_tmp_s32_histoofnewestfield28; /* 0x170 */
    u_vpss_wstt_tmp_s32_histoofnewestfield29 vpss_wstt_tmp_s32_histoofnewestfield29; /* 0x174 */
    u_vpss_wstt_tmp_s32_histoofnewestfield30 vpss_wstt_tmp_s32_histoofnewestfield30; /* 0x178 */
    u_vpss_wstt_tmp_s32_histoofnewestfield31 vpss_wstt_tmp_s32_histoofnewestfield31; /* 0x17c */
    u_vpss_wstt_tmp_s32_histoofnewestfield32 vpss_wstt_tmp_s32_histoofnewestfield32; /* 0x180 */
    u_vpss_wstt_tmp_s32_histoofnewestfield33 vpss_wstt_tmp_s32_histoofnewestfield33; /* 0x184 */
    u_vpss_wstt_tmp_s32_histoofnewestfield34 vpss_wstt_tmp_s32_histoofnewestfield34; /* 0x188 */
    u_vpss_wstt_tmp_s32_histoofnewestfield35 vpss_wstt_tmp_s32_histoofnewestfield35; /* 0x18c */
    u_vpss_wstt_tmp_s32_histoofnewestfield36 vpss_wstt_tmp_s32_histoofnewestfield36; /* 0x190 */
    u_vpss_wstt_tmp_s32_histoofnewestfield37 vpss_wstt_tmp_s32_histoofnewestfield37; /* 0x194 */
    u_vpss_wstt_tmp_s32_histoofnewestfield38 vpss_wstt_tmp_s32_histoofnewestfield38; /* 0x198 */
    u_vpss_wstt_tmp_s32_histoofnewestfield39 vpss_wstt_tmp_s32_histoofnewestfield39; /* 0x19c */
    u_vpss_wstt_tmp_s32_histoofnewestfield40 vpss_wstt_tmp_s32_histoofnewestfield40; /* 0x1a0 */
    u_vpss_wstt_tmp_s32_histoofnewestfield41 vpss_wstt_tmp_s32_histoofnewestfield41; /* 0x1a4 */
    u_vpss_wstt_tmp_s32_histoofnewestfield42 vpss_wstt_tmp_s32_histoofnewestfield42; /* 0x1a8 */
    u_vpss_wstt_tmp_s32_histoofnewestfield43 vpss_wstt_tmp_s32_histoofnewestfield43; /* 0x1ac */
    u_vpss_wstt_tmp_s32_histoofnewestfield44 vpss_wstt_tmp_s32_histoofnewestfield44; /* 0x1b0 */
    u_vpss_wstt_tmp_s32_histoofnewestfield45 vpss_wstt_tmp_s32_histoofnewestfield45; /* 0x1b4 */
    u_vpss_wstt_tmp_s32_histoofnewestfield46 vpss_wstt_tmp_s32_histoofnewestfield46; /* 0x1b8 */
    u_vpss_wstt_tmp_s32_histoofnewestfield47 vpss_wstt_tmp_s32_histoofnewestfield47; /* 0x1bc */
    u_vpss_wstt_tmp_s32_histoofnewestfield48 vpss_wstt_tmp_s32_histoofnewestfield48; /* 0x1c0 */
    u_vpss_wstt_tmp_s32_histoofnewestfield49 vpss_wstt_tmp_s32_histoofnewestfield49; /* 0x1c4 */
    u_vpss_wstt_tmp_s32_histoofnewestfield50 vpss_wstt_tmp_s32_histoofnewestfield50; /* 0x1c8 */
    u_vpss_wstt_tmp_s32_histoofnewestfield51 vpss_wstt_tmp_s32_histoofnewestfield51; /* 0x1cc */
    u_vpss_wstt_tmp_s32_histoofnewestfield52 vpss_wstt_tmp_s32_histoofnewestfield52; /* 0x1d0 */
    u_vpss_wstt_tmp_s32_histoofnewestfield53 vpss_wstt_tmp_s32_histoofnewestfield53; /* 0x1d4 */
    u_vpss_wstt_tmp_s32_histoofnewestfield54 vpss_wstt_tmp_s32_histoofnewestfield54; /* 0x1d8 */
    u_vpss_wstt_tmp_s32_histoofnewestfield55 vpss_wstt_tmp_s32_histoofnewestfield55; /* 0x1dc */
    u_vpss_wstt_tmp_s32_histoofnewestfield56 vpss_wstt_tmp_s32_histoofnewestfield56; /* 0x1e0 */
    u_vpss_wstt_tmp_s32_histoofnewestfield57 vpss_wstt_tmp_s32_histoofnewestfield57; /* 0x1e4 */
    u_vpss_wstt_tmp_s32_histoofnewestfield58 vpss_wstt_tmp_s32_histoofnewestfield58; /* 0x1e8 */
    u_vpss_wstt_tmp_s32_histoofnewestfield59 vpss_wstt_tmp_s32_histoofnewestfield59; /* 0x1ec */
    u_vpss_wstt_tmp_s32_histoofnewestfield60 vpss_wstt_tmp_s32_histoofnewestfield60; /* 0x1f0 */
    u_vpss_wstt_tmp_s32_histoofnewestfield61 vpss_wstt_tmp_s32_histoofnewestfield61; /* 0x1f4 */
    u_vpss_wstt_tmp_s32_histoofnewestfield62 vpss_wstt_tmp_s32_histoofnewestfield62; /* 0x1f8 */
    u_vpss_wstt_tmp_s32_histoofnewestfield63 vpss_wstt_tmp_s32_histoofnewestfield63; /* 0x1fc */
    u_vpss_wstt_tmp_combhistobin6523_00 vpss_wstt_tmp_combhistobin6523_00;           /* 0x200 */
    u_vpss_wstt_tmp_combhistobin6523_01 vpss_wstt_tmp_combhistobin6523_01;           /* 0x204 */
    u_vpss_wstt_tmp_combhistobin6523_02 vpss_wstt_tmp_combhistobin6523_02;           /* 0x208 */
    u_vpss_wstt_tmp_combhistobin6523_03 vpss_wstt_tmp_combhistobin6523_03;           /* 0x20c */
    u_vpss_wstt_tmp_combhistobin6523_04 vpss_wstt_tmp_combhistobin6523_04;           /* 0x210 */
    u_vpss_wstt_tmp_combhistobin6523_05 vpss_wstt_tmp_combhistobin6523_05;           /* 0x214 */
    u_vpss_wstt_tmp_combhistobin6523_06 vpss_wstt_tmp_combhistobin6523_06;           /* 0x218 */
    u_vpss_wstt_tmp_combhistobin6523_07 vpss_wstt_tmp_combhistobin6523_07;           /* 0x21c */
    u_vpss_wstt_tmp_combhistobin6523_08 vpss_wstt_tmp_combhistobin6523_08;           /* 0x220 */
    u_vpss_wstt_tmp_combhistobin6523_09 vpss_wstt_tmp_combhistobin6523_09;           /* 0x224 */
    u_vpss_wstt_tmp_combhistobin6523_10 vpss_wstt_tmp_combhistobin6523_10;           /* 0x228 */
    u_vpss_wstt_tmp_combhistobin6523_11 vpss_wstt_tmp_combhistobin6523_11;           /* 0x22c */
    u_vpss_wstt_tmp_combhistobin6523_12 vpss_wstt_tmp_combhistobin6523_12;           /* 0x230 */
    u_vpss_wstt_tmp_combhistobin6523_13 vpss_wstt_tmp_combhistobin6523_13;           /* 0x234 */
    u_vpss_wstt_tmp_combhistobin6523_14 vpss_wstt_tmp_combhistobin6523_14;           /* 0x238 */
    u_vpss_wstt_tmp_combhistobin6523_15 vpss_wstt_tmp_combhistobin6523_15;           /* 0x23c */
    u_vpss_wstt_tmp_combhistobin6523_16 vpss_wstt_tmp_combhistobin6523_16;           /* 0x240 */
    u_vpss_wstt_tmp_combhistobin6523_17 vpss_wstt_tmp_combhistobin6523_17;           /* 0x244 */
    u_vpss_wstt_tmp_combhistobin6523_18 vpss_wstt_tmp_combhistobin6523_18;           /* 0x248 */
    u_vpss_wstt_tmp_combhistobin6523_19 vpss_wstt_tmp_combhistobin6523_19;           /* 0x24c */
    u_vpss_wstt_tmp_combhistobin6523_20 vpss_wstt_tmp_combhistobin6523_20;           /* 0x250 */
    u_vpss_wstt_tmp_combhistobin6523_21 vpss_wstt_tmp_combhistobin6523_21;           /* 0x254 */
    u_vpss_wstt_tmp_combhistobin6523_22 vpss_wstt_tmp_combhistobin6523_22;           /* 0x258 */
    u_vpss_wstt_tmp_combhistobin6523_23 vpss_wstt_tmp_combhistobin6523_23;           /* 0x25c */
    u_vpss_wstt_tmp_combhistobin6523_24 vpss_wstt_tmp_combhistobin6523_24;           /* 0x260 */
    u_vpss_wstt_tmp_combhistobin6523_25 vpss_wstt_tmp_combhistobin6523_25;           /* 0x264 */
    u_vpss_wstt_tmp_combhistobin6523_26 vpss_wstt_tmp_combhistobin6523_26;           /* 0x268 */
    u_vpss_wstt_tmp_combhistobin6523_27 vpss_wstt_tmp_combhistobin6523_27;           /* 0x26c */
    u_vpss_wstt_tmp_combhistobin6523_28 vpss_wstt_tmp_combhistobin6523_28;           /* 0x270 */
    u_vpss_wstt_tmp_combhistobin6523_29 vpss_wstt_tmp_combhistobin6523_29;           /* 0x274 */
    u_vpss_wstt_tmp_combhistobin6523_30 vpss_wstt_tmp_combhistobin6523_30;           /* 0x278 */
    u_vpss_wstt_tmp_combhistobin6523_31 vpss_wstt_tmp_combhistobin6523_31;           /* 0x27c */
    u_vpss_wstt_tmp_combhistobin6523_32 vpss_wstt_tmp_combhistobin6523_32;           /* 0x280 */
    u_vpss_wstt_tmp_combhistobin6523_33 vpss_wstt_tmp_combhistobin6523_33;           /* 0x284 */
    u_vpss_wstt_tmp_combhistobin6523_34 vpss_wstt_tmp_combhistobin6523_34;           /* 0x288 */
    u_vpss_wstt_tmp_combhistobin6523_35 vpss_wstt_tmp_combhistobin6523_35;           /* 0x28c */
    u_vpss_wstt_tmp_combhistobin6523_36 vpss_wstt_tmp_combhistobin6523_36;           /* 0x290 */
    u_vpss_wstt_tmp_combhistobin6523_37 vpss_wstt_tmp_combhistobin6523_37;           /* 0x294 */
    u_vpss_wstt_tmp_combhistobin6523_38 vpss_wstt_tmp_combhistobin6523_38;           /* 0x298 */
    u_vpss_wstt_tmp_combhistobin6523_39 vpss_wstt_tmp_combhistobin6523_39;           /* 0x29c */
    u_vpss_wstt_tmp_combhistobin6523_40 vpss_wstt_tmp_combhistobin6523_40;           /* 0x2a0 */
    u_vpss_wstt_tmp_combhistobin6523_41 vpss_wstt_tmp_combhistobin6523_41;           /* 0x2a4 */
    u_vpss_wstt_tmp_combhistobin6523_42 vpss_wstt_tmp_combhistobin6523_42;           /* 0x2a8 */
    u_vpss_wstt_tmp_combhistobin6523_43 vpss_wstt_tmp_combhistobin6523_43;           /* 0x2ac */
    u_vpss_wstt_tmp_combhistobin6523_44 vpss_wstt_tmp_combhistobin6523_44;           /* 0x2b0 */
    u_vpss_wstt_tmp_combhistobin6523_45 vpss_wstt_tmp_combhistobin6523_45;           /* 0x2b4 */
    u_vpss_wstt_tmp_combhistobin6523_46 vpss_wstt_tmp_combhistobin6523_46;           /* 0x2b8 */
    u_vpss_wstt_tmp_combhistobin6523_47 vpss_wstt_tmp_combhistobin6523_47;           /* 0x2bc */
    u_vpss_wstt_tmp_combhistobin6523_48 vpss_wstt_tmp_combhistobin6523_48;           /* 0x2c0 */
    u_vpss_wstt_tmp_combhistobin6523_49 vpss_wstt_tmp_combhistobin6523_49;           /* 0x2c4 */
    u_vpss_wstt_tmp_combhistobin6523_50 vpss_wstt_tmp_combhistobin6523_50;           /* 0x2c8 */
    u_vpss_wstt_tmp_combhistobin6523_51 vpss_wstt_tmp_combhistobin6523_51;           /* 0x2cc */
    u_vpss_wstt_tmp_combhistobin6523_52 vpss_wstt_tmp_combhistobin6523_52;           /* 0x2d0 */
    u_vpss_wstt_tmp_combhistobin6523_53 vpss_wstt_tmp_combhistobin6523_53;           /* 0x2d4 */
    u_vpss_wstt_tmp_combhistobin6523_54 vpss_wstt_tmp_combhistobin6523_54;           /* 0x2d8 */
    u_vpss_wstt_tmp_combhistobin6523_55 vpss_wstt_tmp_combhistobin6523_55;           /* 0x2dc */
    u_vpss_wstt_tmp_combhistobin6523_56 vpss_wstt_tmp_combhistobin6523_56;           /* 0x2e0 */
    u_vpss_wstt_tmp_combhistobin6523_57 vpss_wstt_tmp_combhistobin6523_57;           /* 0x2e4 */
    u_vpss_wstt_tmp_combhistobin6523_58 vpss_wstt_tmp_combhistobin6523_58;           /* 0x2e8 */
    u_vpss_wstt_tmp_combhistobin6523_59 vpss_wstt_tmp_combhistobin6523_59;           /* 0x2ec */
    u_vpss_wstt_tmp_combhistobin6523_60 vpss_wstt_tmp_combhistobin6523_60;           /* 0x2f0 */
    u_vpss_wstt_tmp_combhistobin6523_61 vpss_wstt_tmp_combhistobin6523_61;           /* 0x2f4 */
    u_vpss_wstt_tmp_combhistobin6523_62 vpss_wstt_tmp_combhistobin6523_62;           /* 0x2f8 */
    u_vpss_wstt_tmp_combhistobin6523_63 vpss_wstt_tmp_combhistobin6523_63;           /* 0x2fc */
    u_vpss_wstt_hipp_di_vline_stt_0 vpss_wstt_hipp_di_vline_stt_0;                   /* 0x300 */
    u_vpss_wstt_hipp_di_vline_stt_1 vpss_wstt_hipp_di_vline_stt_1;                   /* 0x304 */
    u_vpss_wstt_hipp_di_vline_stt_2 vpss_wstt_hipp_di_vline_stt_2;                   /* 0x308 */
    u_vpss_wstt_hipp_di_vline_stt_3 vpss_wstt_hipp_di_vline_stt_3;                   /* 0x30c */
    u_vpss_wstt_hipp_di_vline_stt_4 vpss_wstt_hipp_di_vline_stt_4;                   /* 0x310 */
    u_vpss_wstt_hipp_di_vline_stt_5 vpss_wstt_hipp_di_vline_stt_5;                   /* 0x314 */
    u_vpss_wstt_hipp_di_vline_stt_6 vpss_wstt_hipp_di_vline_stt_6;                   /* 0x318 */
    u_vpss_wstt_hipp_di_vline_stt_7 vpss_wstt_hipp_di_vline_stt_7;                   /* 0x31c */
    u_vpss_wstt_hipp_di_vline_stt_8 vpss_wstt_hipp_di_vline_stt_8;                   /* 0x320 */
    u_vpss_wstt_hipp_di_vline_stt_9 vpss_wstt_hipp_di_vline_stt_9;                   /* 0x324 */
    u_vpss_wstt_hipp_di_vline_stt_10 vpss_wstt_hipp_di_vline_stt_10;                 /* 0x328 */
    u_vpss_wstt_hipp_di_vline_stt_11 vpss_wstt_hipp_di_vline_stt_11;                 /* 0x32c */
    u_vpss_wstt_hipp_di_vline_stt_12 vpss_wstt_hipp_di_vline_stt_12;                 /* 0x330 */
    u_vpss_wstt_hipp_di_vline_stt_13 vpss_wstt_hipp_di_vline_stt_13;                 /* 0x334 */
    u_vpss_wstt_hipp_di_vline_stt_14 vpss_wstt_hipp_di_vline_stt_14;                 /* 0x338 */
    u_vpss_wstt_hipp_di_vline_stt_15 vpss_wstt_hipp_di_vline_stt_15;                 /* 0x33c */
    u_vpss_wstt_hipp_di_vline_stt_16 vpss_wstt_hipp_di_vline_stt_16;                 /* 0x340 */
    u_vpss_wstt_hipp_di_vline_stt_reserve0 vpss_wstt_hipp_di_vline_stt_reserve0;     /* 0x344 */
    u_vpss_wstt_hipp_di_vline_stt_reserve1 vpss_wstt_hipp_di_vline_stt_reserve1;     /* 0x348 */
    u_vpss_wstt_hipp_di_vline_stt_reserve2 vpss_wstt_hipp_di_vline_stt_reserve2;     /* 0x34c */
    unsigned int reserved_0[44];                                                     /* 0x350~0x3fc 44:para */
    u_vpss_wstt_combhistobin6503_00 vpss_wstt_combhistobin6503_00;                   /* 0x400 */
    u_vpss_wstt_combhistobin6503_01 vpss_wstt_combhistobin6503_01;                   /* 0x404 */
    u_vpss_wstt_combhistobin6503_02 vpss_wstt_combhistobin6503_02;                   /* 0x408 */
    u_vpss_wstt_combhistobin6503_03 vpss_wstt_combhistobin6503_03;                   /* 0x40c */
    u_vpss_wstt_combhistobin6503_04 vpss_wstt_combhistobin6503_04;                   /* 0x410 */
    u_vpss_wstt_combhistobin6503_05 vpss_wstt_combhistobin6503_05;                   /* 0x414 */
    u_vpss_wstt_combhistobin6503_06 vpss_wstt_combhistobin6503_06;                   /* 0x418 */
    u_vpss_wstt_combhistobin6503_07 vpss_wstt_combhistobin6503_07;                   /* 0x41c */
    u_vpss_wstt_combhistobin6503_08 vpss_wstt_combhistobin6503_08;                   /* 0x420 */
    u_vpss_wstt_combhistobin6503_09 vpss_wstt_combhistobin6503_09;                   /* 0x424 */
    u_vpss_wstt_combhistobin6503_10 vpss_wstt_combhistobin6503_10;                   /* 0x428 */
    u_vpss_wstt_combhistobin6503_11 vpss_wstt_combhistobin6503_11;                   /* 0x42c */
    u_vpss_wstt_combhistobin6503_12 vpss_wstt_combhistobin6503_12;                   /* 0x430 */
    u_vpss_wstt_combhistobin6503_13 vpss_wstt_combhistobin6503_13;                   /* 0x434 */
    u_vpss_wstt_combhistobin6503_14 vpss_wstt_combhistobin6503_14;                   /* 0x438 */
    u_vpss_wstt_combhistobin6503_15 vpss_wstt_combhistobin6503_15;                   /* 0x43c */
    u_vpss_wstt_combhistobin6503_16 vpss_wstt_combhistobin6503_16;                   /* 0x440 */
    u_vpss_wstt_combhistobin6503_17 vpss_wstt_combhistobin6503_17;                   /* 0x444 */
    u_vpss_wstt_combhistobin6503_18 vpss_wstt_combhistobin6503_18;                   /* 0x448 */
    u_vpss_wstt_combhistobin6503_19 vpss_wstt_combhistobin6503_19;                   /* 0x44c */
    u_vpss_wstt_combhistobin6503_20 vpss_wstt_combhistobin6503_20;                   /* 0x450 */
    u_vpss_wstt_combhistobin6503_21 vpss_wstt_combhistobin6503_21;                   /* 0x454 */
    u_vpss_wstt_combhistobin6503_22 vpss_wstt_combhistobin6503_22;                   /* 0x458 */
    u_vpss_wstt_combhistobin6503_23 vpss_wstt_combhistobin6503_23;                   /* 0x45c */
    u_vpss_wstt_combhistobin6503_24 vpss_wstt_combhistobin6503_24;                   /* 0x460 */
    u_vpss_wstt_combhistobin6503_25 vpss_wstt_combhistobin6503_25;                   /* 0x464 */
    u_vpss_wstt_combhistobin6503_26 vpss_wstt_combhistobin6503_26;                   /* 0x468 */
    u_vpss_wstt_combhistobin6503_27 vpss_wstt_combhistobin6503_27;                   /* 0x46c */
    u_vpss_wstt_combhistobin6503_28 vpss_wstt_combhistobin6503_28;                   /* 0x470 */
    u_vpss_wstt_combhistobin6503_29 vpss_wstt_combhistobin6503_29;                   /* 0x474 */
    u_vpss_wstt_combhistobin6503_30 vpss_wstt_combhistobin6503_30;                   /* 0x478 */
    u_vpss_wstt_combhistobin6503_31 vpss_wstt_combhistobin6503_31;                   /* 0x47c */
    u_vpss_wstt_combhistobin6503_32 vpss_wstt_combhistobin6503_32;                   /* 0x480 */
    u_vpss_wstt_combhistobin6503_33 vpss_wstt_combhistobin6503_33;                   /* 0x484 */
    u_vpss_wstt_combhistobin6503_34 vpss_wstt_combhistobin6503_34;                   /* 0x488 */
    u_vpss_wstt_combhistobin6503_35 vpss_wstt_combhistobin6503_35;                   /* 0x48c */
    u_vpss_wstt_combhistobin6503_36 vpss_wstt_combhistobin6503_36;                   /* 0x490 */
    u_vpss_wstt_combhistobin6503_37 vpss_wstt_combhistobin6503_37;                   /* 0x494 */
    u_vpss_wstt_combhistobin6503_38 vpss_wstt_combhistobin6503_38;                   /* 0x498 */
    u_vpss_wstt_combhistobin6503_39 vpss_wstt_combhistobin6503_39;                   /* 0x49c */
    u_vpss_wstt_combhistobin6503_40 vpss_wstt_combhistobin6503_40;                   /* 0x4a0 */
    u_vpss_wstt_combhistobin6503_41 vpss_wstt_combhistobin6503_41;                   /* 0x4a4 */
    u_vpss_wstt_combhistobin6503_42 vpss_wstt_combhistobin6503_42;                   /* 0x4a8 */
    u_vpss_wstt_combhistobin6503_43 vpss_wstt_combhistobin6503_43;                   /* 0x4ac */
    u_vpss_wstt_combhistobin6503_44 vpss_wstt_combhistobin6503_44;                   /* 0x4b0 */
    u_vpss_wstt_combhistobin6503_45 vpss_wstt_combhistobin6503_45;                   /* 0x4b4 */
    u_vpss_wstt_combhistobin6503_46 vpss_wstt_combhistobin6503_46;                   /* 0x4b8 */
    u_vpss_wstt_combhistobin6503_47 vpss_wstt_combhistobin6503_47;                   /* 0x4bc */
    u_vpss_wstt_combhistobin6503_48 vpss_wstt_combhistobin6503_48;                   /* 0x4c0 */
    u_vpss_wstt_combhistobin6503_49 vpss_wstt_combhistobin6503_49;                   /* 0x4c4 */
    u_vpss_wstt_combhistobin6503_50 vpss_wstt_combhistobin6503_50;                   /* 0x4c8 */
    u_vpss_wstt_combhistobin6503_51 vpss_wstt_combhistobin6503_51;                   /* 0x4cc */
    u_vpss_wstt_combhistobin6503_52 vpss_wstt_combhistobin6503_52;                   /* 0x4d0 */
    u_vpss_wstt_combhistobin6503_53 vpss_wstt_combhistobin6503_53;                   /* 0x4d4 */
    u_vpss_wstt_combhistobin6503_54 vpss_wstt_combhistobin6503_54;                   /* 0x4d8 */
    u_vpss_wstt_combhistobin6503_55 vpss_wstt_combhistobin6503_55;                   /* 0x4dc */
    u_vpss_wstt_combhistobin6503_56 vpss_wstt_combhistobin6503_56;                   /* 0x4e0 */
    u_vpss_wstt_combhistobin6503_57 vpss_wstt_combhistobin6503_57;                   /* 0x4e4 */
    u_vpss_wstt_combhistobin6503_58 vpss_wstt_combhistobin6503_58;                   /* 0x4e8 */
    u_vpss_wstt_combhistobin6503_59 vpss_wstt_combhistobin6503_59;                   /* 0x4ec */
    u_vpss_wstt_combhistobin6503_60 vpss_wstt_combhistobin6503_60;                   /* 0x4f0 */
    u_vpss_wstt_combhistobin6503_61 vpss_wstt_combhistobin6503_61;                   /* 0x4f4 */
    u_vpss_wstt_combhistobin6503_62 vpss_wstt_combhistobin6503_62;                   /* 0x4f8 */
    u_vpss_wstt_combhistobin6503_63 vpss_wstt_combhistobin6503_63;                   /* 0x4fc */
    u_vpss_wstt_combhistobin6523_00 vpss_wstt_combhistobin6523_00;                   /* 0x500 */
    u_vpss_wstt_combhistobin6523_01 vpss_wstt_combhistobin6523_01;                   /* 0x504 */
    u_vpss_wstt_combhistobin6523_02 vpss_wstt_combhistobin6523_02;                   /* 0x508 */
    u_vpss_wstt_combhistobin6523_03 vpss_wstt_combhistobin6523_03;                   /* 0x50c */
    u_vpss_wstt_combhistobin6523_04 vpss_wstt_combhistobin6523_04;                   /* 0x510 */
    u_vpss_wstt_combhistobin6523_05 vpss_wstt_combhistobin6523_05;                   /* 0x514 */
    u_vpss_wstt_combhistobin6523_06 vpss_wstt_combhistobin6523_06;                   /* 0x518 */
    u_vpss_wstt_combhistobin6523_07 vpss_wstt_combhistobin6523_07;                   /* 0x51c */
    u_vpss_wstt_combhistobin6523_08 vpss_wstt_combhistobin6523_08;                   /* 0x520 */
    u_vpss_wstt_combhistobin6523_09 vpss_wstt_combhistobin6523_09;                   /* 0x524 */
    u_vpss_wstt_combhistobin6523_10 vpss_wstt_combhistobin6523_10;                   /* 0x528 */
    u_vpss_wstt_combhistobin6523_11 vpss_wstt_combhistobin6523_11;                   /* 0x52c */
    u_vpss_wstt_combhistobin6523_12 vpss_wstt_combhistobin6523_12;                   /* 0x530 */
    u_vpss_wstt_combhistobin6523_13 vpss_wstt_combhistobin6523_13;                   /* 0x534 */
    u_vpss_wstt_combhistobin6523_14 vpss_wstt_combhistobin6523_14;                   /* 0x538 */
    u_vpss_wstt_combhistobin6523_15 vpss_wstt_combhistobin6523_15;                   /* 0x53c */
    u_vpss_wstt_combhistobin6523_16 vpss_wstt_combhistobin6523_16;                   /* 0x540 */
    u_vpss_wstt_combhistobin6523_17 vpss_wstt_combhistobin6523_17;                   /* 0x544 */
    u_vpss_wstt_combhistobin6523_18 vpss_wstt_combhistobin6523_18;                   /* 0x548 */
    u_vpss_wstt_combhistobin6523_19 vpss_wstt_combhistobin6523_19;                   /* 0x54c */
    u_vpss_wstt_combhistobin6523_20 vpss_wstt_combhistobin6523_20;                   /* 0x550 */
    u_vpss_wstt_combhistobin6523_21 vpss_wstt_combhistobin6523_21;                   /* 0x554 */
    u_vpss_wstt_combhistobin6523_22 vpss_wstt_combhistobin6523_22;                   /* 0x558 */
    u_vpss_wstt_combhistobin6523_23 vpss_wstt_combhistobin6523_23;                   /* 0x55c */
    u_vpss_wstt_combhistobin6523_24 vpss_wstt_combhistobin6523_24;                   /* 0x560 */
    u_vpss_wstt_combhistobin6523_25 vpss_wstt_combhistobin6523_25;                   /* 0x564 */
    u_vpss_wstt_combhistobin6523_26 vpss_wstt_combhistobin6523_26;                   /* 0x568 */
    u_vpss_wstt_combhistobin6523_27 vpss_wstt_combhistobin6523_27;                   /* 0x56c */
    u_vpss_wstt_combhistobin6523_28 vpss_wstt_combhistobin6523_28;                   /* 0x570 */
    u_vpss_wstt_combhistobin6523_29 vpss_wstt_combhistobin6523_29;                   /* 0x574 */
    u_vpss_wstt_combhistobin6523_30 vpss_wstt_combhistobin6523_30;                   /* 0x578 */
    u_vpss_wstt_combhistobin6523_31 vpss_wstt_combhistobin6523_31;                   /* 0x57c */
    u_vpss_wstt_combhistobin6523_32 vpss_wstt_combhistobin6523_32;                   /* 0x580 */
    u_vpss_wstt_combhistobin6523_33 vpss_wstt_combhistobin6523_33;                   /* 0x584 */
    u_vpss_wstt_combhistobin6523_34 vpss_wstt_combhistobin6523_34;                   /* 0x588 */
    u_vpss_wstt_combhistobin6523_35 vpss_wstt_combhistobin6523_35;                   /* 0x58c */
    u_vpss_wstt_combhistobin6523_36 vpss_wstt_combhistobin6523_36;                   /* 0x590 */
    u_vpss_wstt_combhistobin6523_37 vpss_wstt_combhistobin6523_37;                   /* 0x594 */
    u_vpss_wstt_combhistobin6523_38 vpss_wstt_combhistobin6523_38;                   /* 0x598 */
    u_vpss_wstt_combhistobin6523_39 vpss_wstt_combhistobin6523_39;                   /* 0x59c */
    u_vpss_wstt_combhistobin6523_40 vpss_wstt_combhistobin6523_40;                   /* 0x5a0 */
    u_vpss_wstt_combhistobin6523_41 vpss_wstt_combhistobin6523_41;                   /* 0x5a4 */
    u_vpss_wstt_combhistobin6523_42 vpss_wstt_combhistobin6523_42;                   /* 0x5a8 */
    u_vpss_wstt_combhistobin6523_43 vpss_wstt_combhistobin6523_43;                   /* 0x5ac */
    u_vpss_wstt_combhistobin6523_44 vpss_wstt_combhistobin6523_44;                   /* 0x5b0 */
    u_vpss_wstt_combhistobin6523_45 vpss_wstt_combhistobin6523_45;                   /* 0x5b4 */
    u_vpss_wstt_combhistobin6523_46 vpss_wstt_combhistobin6523_46;                   /* 0x5b8 */
    u_vpss_wstt_combhistobin6523_47 vpss_wstt_combhistobin6523_47;                   /* 0x5bc */
    u_vpss_wstt_combhistobin6523_48 vpss_wstt_combhistobin6523_48;                   /* 0x5c0 */
    u_vpss_wstt_combhistobin6523_49 vpss_wstt_combhistobin6523_49;                   /* 0x5c4 */
    u_vpss_wstt_combhistobin6523_50 vpss_wstt_combhistobin6523_50;                   /* 0x5c8 */
    u_vpss_wstt_combhistobin6523_51 vpss_wstt_combhistobin6523_51;                   /* 0x5cc */
    u_vpss_wstt_combhistobin6523_52 vpss_wstt_combhistobin6523_52;                   /* 0x5d0 */
    u_vpss_wstt_combhistobin6523_53 vpss_wstt_combhistobin6523_53;                   /* 0x5d4 */
    u_vpss_wstt_combhistobin6523_54 vpss_wstt_combhistobin6523_54;                   /* 0x5d8 */
    u_vpss_wstt_combhistobin6523_55 vpss_wstt_combhistobin6523_55;                   /* 0x5dc */
    u_vpss_wstt_combhistobin6523_56 vpss_wstt_combhistobin6523_56;                   /* 0x5e0 */
    u_vpss_wstt_combhistobin6523_57 vpss_wstt_combhistobin6523_57;                   /* 0x5e4 */
    u_vpss_wstt_combhistobin6523_58 vpss_wstt_combhistobin6523_58;                   /* 0x5e8 */
    u_vpss_wstt_combhistobin6523_59 vpss_wstt_combhistobin6523_59;                   /* 0x5ec */
    u_vpss_wstt_combhistobin6523_60 vpss_wstt_combhistobin6523_60;                   /* 0x5f0 */
    u_vpss_wstt_combhistobin6523_61 vpss_wstt_combhistobin6523_61;                   /* 0x5f4 */
    u_vpss_wstt_combhistobin6523_62 vpss_wstt_combhistobin6523_62;                   /* 0x5f8 */
    u_vpss_wstt_combhistobin6523_63 vpss_wstt_combhistobin6523_63;                   /* 0x5fc */
    u_vpss_wstt_combhistobin6512_00 vpss_wstt_combhistobin6512_00;                   /* 0x600 */
    u_vpss_wstt_combhistobin6512_01 vpss_wstt_combhistobin6512_01;                   /* 0x604 */
    u_vpss_wstt_combhistobin6512_02 vpss_wstt_combhistobin6512_02;                   /* 0x608 */
    u_vpss_wstt_combhistobin6512_03 vpss_wstt_combhistobin6512_03;                   /* 0x60c */
    u_vpss_wstt_combhistobin6512_04 vpss_wstt_combhistobin6512_04;                   /* 0x610 */
    u_vpss_wstt_combhistobin6512_05 vpss_wstt_combhistobin6512_05;                   /* 0x614 */
    u_vpss_wstt_combhistobin6512_06 vpss_wstt_combhistobin6512_06;                   /* 0x618 */
    u_vpss_wstt_combhistobin6512_07 vpss_wstt_combhistobin6512_07;                   /* 0x61c */
    u_vpss_wstt_combhistobin6512_08 vpss_wstt_combhistobin6512_08;                   /* 0x620 */
    u_vpss_wstt_combhistobin6512_09 vpss_wstt_combhistobin6512_09;                   /* 0x624 */
    u_vpss_wstt_combhistobin6512_10 vpss_wstt_combhistobin6512_10;                   /* 0x628 */
    u_vpss_wstt_combhistobin6512_11 vpss_wstt_combhistobin6512_11;                   /* 0x62c */
    u_vpss_wstt_combhistobin6512_12 vpss_wstt_combhistobin6512_12;                   /* 0x630 */
    u_vpss_wstt_combhistobin6512_13 vpss_wstt_combhistobin6512_13;                   /* 0x634 */
    u_vpss_wstt_combhistobin6512_14 vpss_wstt_combhistobin6512_14;                   /* 0x638 */
    u_vpss_wstt_combhistobin6512_15 vpss_wstt_combhistobin6512_15;                   /* 0x63c */
    u_vpss_wstt_combhistobin6512_16 vpss_wstt_combhistobin6512_16;                   /* 0x640 */
    u_vpss_wstt_combhistobin6512_17 vpss_wstt_combhistobin6512_17;                   /* 0x644 */
    u_vpss_wstt_combhistobin6512_18 vpss_wstt_combhistobin6512_18;                   /* 0x648 */
    u_vpss_wstt_combhistobin6512_19 vpss_wstt_combhistobin6512_19;                   /* 0x64c */
    u_vpss_wstt_combhistobin6512_20 vpss_wstt_combhistobin6512_20;                   /* 0x650 */
    u_vpss_wstt_combhistobin6512_21 vpss_wstt_combhistobin6512_21;                   /* 0x654 */
    u_vpss_wstt_combhistobin6512_22 vpss_wstt_combhistobin6512_22;                   /* 0x658 */
    u_vpss_wstt_combhistobin6512_23 vpss_wstt_combhistobin6512_23;                   /* 0x65c */
    u_vpss_wstt_combhistobin6512_24 vpss_wstt_combhistobin6512_24;                   /* 0x660 */
    u_vpss_wstt_combhistobin6512_25 vpss_wstt_combhistobin6512_25;                   /* 0x664 */
    u_vpss_wstt_combhistobin6512_26 vpss_wstt_combhistobin6512_26;                   /* 0x668 */
    u_vpss_wstt_combhistobin6512_27 vpss_wstt_combhistobin6512_27;                   /* 0x66c */
    u_vpss_wstt_combhistobin6512_28 vpss_wstt_combhistobin6512_28;                   /* 0x670 */
    u_vpss_wstt_combhistobin6512_29 vpss_wstt_combhistobin6512_29;                   /* 0x674 */
    u_vpss_wstt_combhistobin6512_30 vpss_wstt_combhistobin6512_30;                   /* 0x678 */
    u_vpss_wstt_combhistobin6512_31 vpss_wstt_combhistobin6512_31;                   /* 0x67c */
    u_vpss_wstt_combhistobin6512_32 vpss_wstt_combhistobin6512_32;                   /* 0x680 */
    u_vpss_wstt_combhistobin6512_33 vpss_wstt_combhistobin6512_33;                   /* 0x684 */
    u_vpss_wstt_combhistobin6512_34 vpss_wstt_combhistobin6512_34;                   /* 0x688 */
    u_vpss_wstt_combhistobin6512_35 vpss_wstt_combhistobin6512_35;                   /* 0x68c */
    u_vpss_wstt_combhistobin6512_36 vpss_wstt_combhistobin6512_36;                   /* 0x690 */
    u_vpss_wstt_combhistobin6512_37 vpss_wstt_combhistobin6512_37;                   /* 0x694 */
    u_vpss_wstt_combhistobin6512_38 vpss_wstt_combhistobin6512_38;                   /* 0x698 */
    u_vpss_wstt_combhistobin6512_39 vpss_wstt_combhistobin6512_39;                   /* 0x69c */
    u_vpss_wstt_combhistobin6512_40 vpss_wstt_combhistobin6512_40;                   /* 0x6a0 */
    u_vpss_wstt_combhistobin6512_41 vpss_wstt_combhistobin6512_41;                   /* 0x6a4 */
    u_vpss_wstt_combhistobin6512_42 vpss_wstt_combhistobin6512_42;                   /* 0x6a8 */
    u_vpss_wstt_combhistobin6512_43 vpss_wstt_combhistobin6512_43;                   /* 0x6ac */
    u_vpss_wstt_combhistobin6512_44 vpss_wstt_combhistobin6512_44;                   /* 0x6b0 */
    u_vpss_wstt_combhistobin6512_45 vpss_wstt_combhistobin6512_45;                   /* 0x6b4 */
    u_vpss_wstt_combhistobin6512_46 vpss_wstt_combhistobin6512_46;                   /* 0x6b8 */
    u_vpss_wstt_combhistobin6512_47 vpss_wstt_combhistobin6512_47;                   /* 0x6bc */
    u_vpss_wstt_combhistobin6512_48 vpss_wstt_combhistobin6512_48;                   /* 0x6c0 */
    u_vpss_wstt_combhistobin6512_49 vpss_wstt_combhistobin6512_49;                   /* 0x6c4 */
    u_vpss_wstt_combhistobin6512_50 vpss_wstt_combhistobin6512_50;                   /* 0x6c8 */
    u_vpss_wstt_combhistobin6512_51 vpss_wstt_combhistobin6512_51;                   /* 0x6cc */
    u_vpss_wstt_combhistobin6512_52 vpss_wstt_combhistobin6512_52;                   /* 0x6d0 */
    u_vpss_wstt_combhistobin6512_53 vpss_wstt_combhistobin6512_53;                   /* 0x6d4 */
    u_vpss_wstt_combhistobin6512_54 vpss_wstt_combhistobin6512_54;                   /* 0x6d8 */
    u_vpss_wstt_combhistobin6512_55 vpss_wstt_combhistobin6512_55;                   /* 0x6dc */
    u_vpss_wstt_combhistobin6512_56 vpss_wstt_combhistobin6512_56;                   /* 0x6e0 */
    u_vpss_wstt_combhistobin6512_57 vpss_wstt_combhistobin6512_57;                   /* 0x6e4 */
    u_vpss_wstt_combhistobin6512_58 vpss_wstt_combhistobin6512_58;                   /* 0x6e8 */
    u_vpss_wstt_combhistobin6512_59 vpss_wstt_combhistobin6512_59;                   /* 0x6ec */
    u_vpss_wstt_combhistobin6512_60 vpss_wstt_combhistobin6512_60;                   /* 0x6f0 */
    u_vpss_wstt_combhistobin6512_61 vpss_wstt_combhistobin6512_61;                   /* 0x6f4 */
    u_vpss_wstt_combhistobin6512_62 vpss_wstt_combhistobin6512_62;                   /* 0x6f8 */
    u_vpss_wstt_combhistobin6512_63 vpss_wstt_combhistobin6512_63;                   /* 0x6fc */
    u_vpss_wstt_ahistobin00 vpss_wstt_ahistobin00;                                   /* 0x700 */
    u_vpss_wstt_ahistobin01 vpss_wstt_ahistobin01;                                   /* 0x704 */
    u_vpss_wstt_ahistobin02 vpss_wstt_ahistobin02;                                   /* 0x708 */
    u_vpss_wstt_ahistobin03 vpss_wstt_ahistobin03;                                   /* 0x70c */
    u_vpss_wstt_ahistobin04 vpss_wstt_ahistobin04;                                   /* 0x710 */
    u_vpss_wstt_ahistobin05 vpss_wstt_ahistobin05;                                   /* 0x714 */
    u_vpss_wstt_ahistobin06 vpss_wstt_ahistobin06;                                   /* 0x718 */
    u_vpss_wstt_ahistobin07 vpss_wstt_ahistobin07;                                   /* 0x71c */
    u_vpss_wstt_ahistobin08 vpss_wstt_ahistobin08;                                   /* 0x720 */
    u_vpss_wstt_ahistobin09 vpss_wstt_ahistobin09;                                   /* 0x724 */
    u_vpss_wstt_ahistobin10 vpss_wstt_ahistobin10;                                   /* 0x728 */
    u_vpss_wstt_ahistobin11 vpss_wstt_ahistobin11;                                   /* 0x72c */
    u_vpss_wstt_ahistobin12 vpss_wstt_ahistobin12;                                   /* 0x730 */
    u_vpss_wstt_ahistobin13 vpss_wstt_ahistobin13;                                   /* 0x734 */
    u_vpss_wstt_ahistobin14 vpss_wstt_ahistobin14;                                   /* 0x738 */
    u_vpss_wstt_ahistobin15 vpss_wstt_ahistobin15;                                   /* 0x73c */
    u_vpss_wstt_ahistobin16 vpss_wstt_ahistobin16;                                   /* 0x740 */
    u_vpss_wstt_ahistobin17 vpss_wstt_ahistobin17;                                   /* 0x744 */
    u_vpss_wstt_ahistobin18 vpss_wstt_ahistobin18;                                   /* 0x748 */
    u_vpss_wstt_ahistobin19 vpss_wstt_ahistobin19;                                   /* 0x74c */
    u_vpss_wstt_ahistobin20 vpss_wstt_ahistobin20;                                   /* 0x750 */
    u_vpss_wstt_ahistobin21 vpss_wstt_ahistobin21;                                   /* 0x754 */
    u_vpss_wstt_ahistobin22 vpss_wstt_ahistobin22;                                   /* 0x758 */
    u_vpss_wstt_ahistobin23 vpss_wstt_ahistobin23;                                   /* 0x75c */
    u_vpss_wstt_ahistobin24 vpss_wstt_ahistobin24;                                   /* 0x760 */
    u_vpss_wstt_ahistobin25 vpss_wstt_ahistobin25;                                   /* 0x764 */
    u_vpss_wstt_ahistobin26 vpss_wstt_ahistobin26;                                   /* 0x768 */
    u_vpss_wstt_ahistobin27 vpss_wstt_ahistobin27;                                   /* 0x76c */
    u_vpss_wstt_ahistobin28 vpss_wstt_ahistobin28;                                   /* 0x770 */
    u_vpss_wstt_ahistobin29 vpss_wstt_ahistobin29;                                   /* 0x774 */
    u_vpss_wstt_ahistobin30 vpss_wstt_ahistobin30;                                   /* 0x778 */
    u_vpss_wstt_ahistobin31 vpss_wstt_ahistobin31;                                   /* 0x77c */
    u_vpss_wstt_ahistobin32 vpss_wstt_ahistobin32;                                   /* 0x780 */
    u_vpss_wstt_ahistobin33 vpss_wstt_ahistobin33;                                   /* 0x784 */
    u_vpss_wstt_ahistobin34 vpss_wstt_ahistobin34;                                   /* 0x788 */
    u_vpss_wstt_ahistobin35 vpss_wstt_ahistobin35;                                   /* 0x78c */
    u_vpss_wstt_ahistobin36 vpss_wstt_ahistobin36;                                   /* 0x790 */
    u_vpss_wstt_ahistobin37 vpss_wstt_ahistobin37;                                   /* 0x794 */
    u_vpss_wstt_ahistobin38 vpss_wstt_ahistobin38;                                   /* 0x798 */
    u_vpss_wstt_ahistobin39 vpss_wstt_ahistobin39;                                   /* 0x79c */
    u_vpss_wstt_ahistobin40 vpss_wstt_ahistobin40;                                   /* 0x7a0 */
    u_vpss_wstt_ahistobin41 vpss_wstt_ahistobin41;                                   /* 0x7a4 */
    u_vpss_wstt_ahistobin42 vpss_wstt_ahistobin42;                                   /* 0x7a8 */
    u_vpss_wstt_ahistobin43 vpss_wstt_ahistobin43;                                   /* 0x7ac */
    u_vpss_wstt_ahistobin44 vpss_wstt_ahistobin44;                                   /* 0x7b0 */
    u_vpss_wstt_ahistobin45 vpss_wstt_ahistobin45;                                   /* 0x7b4 */
    u_vpss_wstt_ahistobin46 vpss_wstt_ahistobin46;                                   /* 0x7b8 */
    u_vpss_wstt_ahistobin47 vpss_wstt_ahistobin47;                                   /* 0x7bc */
    u_vpss_wstt_ahistobin48 vpss_wstt_ahistobin48;                                   /* 0x7c0 */
    u_vpss_wstt_ahistobin49 vpss_wstt_ahistobin49;                                   /* 0x7c4 */
    u_vpss_wstt_ahistobin50 vpss_wstt_ahistobin50;                                   /* 0x7c8 */
    u_vpss_wstt_ahistobin51 vpss_wstt_ahistobin51;                                   /* 0x7cc */
    u_vpss_wstt_ahistobin52 vpss_wstt_ahistobin52;                                   /* 0x7d0 */
    u_vpss_wstt_ahistobin53 vpss_wstt_ahistobin53;                                   /* 0x7d4 */
    u_vpss_wstt_ahistobin54 vpss_wstt_ahistobin54;                                   /* 0x7d8 */
    u_vpss_wstt_ahistobin55 vpss_wstt_ahistobin55;                                   /* 0x7dc */
    u_vpss_wstt_ahistobin56 vpss_wstt_ahistobin56;                                   /* 0x7e0 */
    u_vpss_wstt_ahistobin57 vpss_wstt_ahistobin57;                                   /* 0x7e4 */
    u_vpss_wstt_ahistobin58 vpss_wstt_ahistobin58;                                   /* 0x7e8 */
    u_vpss_wstt_ahistobin59 vpss_wstt_ahistobin59;                                   /* 0x7ec */
    u_vpss_wstt_ahistobin60 vpss_wstt_ahistobin60;                                   /* 0x7f0 */
    u_vpss_wstt_ahistobin61 vpss_wstt_ahistobin61;                                   /* 0x7f4 */
    u_vpss_wstt_ahistobin62 vpss_wstt_ahistobin62;                                   /* 0x7f8 */
    u_vpss_wstt_ahistobin63 vpss_wstt_ahistobin63;                                   /* 0x7fc */
    u_vpss_wstt_s32_histoofnewestfield00 vpss_wstt_s32_histoofnewestfield00;         /* 0x800 */
    u_vpss_wstt_s32_histoofnewestfield01 vpss_wstt_s32_histoofnewestfield01;         /* 0x804 */
    u_vpss_wstt_s32_histoofnewestfield02 vpss_wstt_s32_histoofnewestfield02;         /* 0x808 */
    u_vpss_wstt_s32_histoofnewestfield03 vpss_wstt_s32_histoofnewestfield03;         /* 0x80c */
    u_vpss_wstt_s32_histoofnewestfield04 vpss_wstt_s32_histoofnewestfield04;         /* 0x810 */
    u_vpss_wstt_s32_histoofnewestfield05 vpss_wstt_s32_histoofnewestfield05;         /* 0x814 */
    u_vpss_wstt_s32_histoofnewestfield06 vpss_wstt_s32_histoofnewestfield06;         /* 0x818 */
    u_vpss_wstt_s32_histoofnewestfield07 vpss_wstt_s32_histoofnewestfield07;         /* 0x81c */
    u_vpss_wstt_s32_histoofnewestfield08 vpss_wstt_s32_histoofnewestfield08;         /* 0x820 */
    u_vpss_wstt_s32_histoofnewestfield09 vpss_wstt_s32_histoofnewestfield09;         /* 0x824 */
    u_vpss_wstt_s32_histoofnewestfield10 vpss_wstt_s32_histoofnewestfield10;         /* 0x828 */
    u_vpss_wstt_s32_histoofnewestfield11 vpss_wstt_s32_histoofnewestfield11;         /* 0x82c */
    u_vpss_wstt_s32_histoofnewestfield12 vpss_wstt_s32_histoofnewestfield12;         /* 0x830 */
    u_vpss_wstt_s32_histoofnewestfield13 vpss_wstt_s32_histoofnewestfield13;         /* 0x834 */
    u_vpss_wstt_s32_histoofnewestfield14 vpss_wstt_s32_histoofnewestfield14;         /* 0x838 */
    u_vpss_wstt_s32_histoofnewestfield15 vpss_wstt_s32_histoofnewestfield15;         /* 0x83c */
    u_vpss_wstt_s32_histoofnewestfield16 vpss_wstt_s32_histoofnewestfield16;         /* 0x840 */
    u_vpss_wstt_s32_histoofnewestfield17 vpss_wstt_s32_histoofnewestfield17;         /* 0x844 */
    u_vpss_wstt_s32_histoofnewestfield18 vpss_wstt_s32_histoofnewestfield18;         /* 0x848 */
    u_vpss_wstt_s32_histoofnewestfield19 vpss_wstt_s32_histoofnewestfield19;         /* 0x84c */
    u_vpss_wstt_s32_histoofnewestfield20 vpss_wstt_s32_histoofnewestfield20;         /* 0x850 */
    u_vpss_wstt_s32_histoofnewestfield21 vpss_wstt_s32_histoofnewestfield21;         /* 0x854 */
    u_vpss_wstt_s32_histoofnewestfield22 vpss_wstt_s32_histoofnewestfield22;         /* 0x858 */
    u_vpss_wstt_s32_histoofnewestfield23 vpss_wstt_s32_histoofnewestfield23;         /* 0x85c */
    u_vpss_wstt_s32_histoofnewestfield24 vpss_wstt_s32_histoofnewestfield24;         /* 0x860 */
    u_vpss_wstt_s32_histoofnewestfield25 vpss_wstt_s32_histoofnewestfield25;         /* 0x864 */
    u_vpss_wstt_s32_histoofnewestfield26 vpss_wstt_s32_histoofnewestfield26;         /* 0x868 */
    u_vpss_wstt_s32_histoofnewestfield27 vpss_wstt_s32_histoofnewestfield27;         /* 0x86c */
    u_vpss_wstt_s32_histoofnewestfield28 vpss_wstt_s32_histoofnewestfield28;         /* 0x870 */
    u_vpss_wstt_s32_histoofnewestfield29 vpss_wstt_s32_histoofnewestfield29;         /* 0x874 */
    u_vpss_wstt_s32_histoofnewestfield30 vpss_wstt_s32_histoofnewestfield30;         /* 0x878 */
    u_vpss_wstt_s32_histoofnewestfield31 vpss_wstt_s32_histoofnewestfield31;         /* 0x87c */
    u_vpss_wstt_s32_histoofnewestfield32 vpss_wstt_s32_histoofnewestfield32;         /* 0x880 */
    u_vpss_wstt_s32_histoofnewestfield33 vpss_wstt_s32_histoofnewestfield33;         /* 0x884 */
    u_vpss_wstt_s32_histoofnewestfield34 vpss_wstt_s32_histoofnewestfield34;         /* 0x888 */
    u_vpss_wstt_s32_histoofnewestfield35 vpss_wstt_s32_histoofnewestfield35;         /* 0x88c */
    u_vpss_wstt_s32_histoofnewestfield36 vpss_wstt_s32_histoofnewestfield36;         /* 0x890 */
    u_vpss_wstt_s32_histoofnewestfield37 vpss_wstt_s32_histoofnewestfield37;         /* 0x894 */
    u_vpss_wstt_s32_histoofnewestfield38 vpss_wstt_s32_histoofnewestfield38;         /* 0x898 */
    u_vpss_wstt_s32_histoofnewestfield39 vpss_wstt_s32_histoofnewestfield39;         /* 0x89c */
    u_vpss_wstt_s32_histoofnewestfield40 vpss_wstt_s32_histoofnewestfield40;         /* 0x8a0 */
    u_vpss_wstt_s32_histoofnewestfield41 vpss_wstt_s32_histoofnewestfield41;         /* 0x8a4 */
    u_vpss_wstt_s32_histoofnewestfield42 vpss_wstt_s32_histoofnewestfield42;         /* 0x8a8 */
    u_vpss_wstt_s32_histoofnewestfield43 vpss_wstt_s32_histoofnewestfield43;         /* 0x8ac */
    u_vpss_wstt_s32_histoofnewestfield44 vpss_wstt_s32_histoofnewestfield44;         /* 0x8b0 */
    u_vpss_wstt_s32_histoofnewestfield45 vpss_wstt_s32_histoofnewestfield45;         /* 0x8b4 */
    u_vpss_wstt_s32_histoofnewestfield46 vpss_wstt_s32_histoofnewestfield46;         /* 0x8b8 */
    u_vpss_wstt_s32_histoofnewestfield47 vpss_wstt_s32_histoofnewestfield47;         /* 0x8bc */
    u_vpss_wstt_s32_histoofnewestfield48 vpss_wstt_s32_histoofnewestfield48;         /* 0x8c0 */
    u_vpss_wstt_s32_histoofnewestfield49 vpss_wstt_s32_histoofnewestfield49;         /* 0x8c4 */
    u_vpss_wstt_s32_histoofnewestfield50 vpss_wstt_s32_histoofnewestfield50;         /* 0x8c8 */
    u_vpss_wstt_s32_histoofnewestfield51 vpss_wstt_s32_histoofnewestfield51;         /* 0x8cc */
    u_vpss_wstt_s32_histoofnewestfield52 vpss_wstt_s32_histoofnewestfield52;         /* 0x8d0 */
    u_vpss_wstt_s32_histoofnewestfield53 vpss_wstt_s32_histoofnewestfield53;         /* 0x8d4 */
    u_vpss_wstt_s32_histoofnewestfield54 vpss_wstt_s32_histoofnewestfield54;         /* 0x8d8 */
    u_vpss_wstt_s32_histoofnewestfield55 vpss_wstt_s32_histoofnewestfield55;         /* 0x8dc */
    u_vpss_wstt_s32_histoofnewestfield56 vpss_wstt_s32_histoofnewestfield56;         /* 0x8e0 */
    u_vpss_wstt_s32_histoofnewestfield57 vpss_wstt_s32_histoofnewestfield57;         /* 0x8e4 */
    u_vpss_wstt_s32_histoofnewestfield58 vpss_wstt_s32_histoofnewestfield58;         /* 0x8e8 */
    u_vpss_wstt_s32_histoofnewestfield59 vpss_wstt_s32_histoofnewestfield59;         /* 0x8ec */
    u_vpss_wstt_s32_histoofnewestfield60 vpss_wstt_s32_histoofnewestfield60;         /* 0x8f0 */
    u_vpss_wstt_s32_histoofnewestfield61 vpss_wstt_s32_histoofnewestfield61;         /* 0x8f4 */
    u_vpss_wstt_s32_histoofnewestfield62 vpss_wstt_s32_histoofnewestfield62;         /* 0x8f8 */
    u_vpss_wstt_s32_histoofnewestfield63 vpss_wstt_s32_histoofnewestfield63;         /* 0x8fc */
    u_vpss_wstt_pccbwdtkr_u vpss_wstt_pccbwdtkr_u;                                   /* 0x900 */
    u_vpss_wstt_pccbwdtkr_d vpss_wstt_pccbwdtkr_d;                                   /* 0x904 */
    u_vpss_wstt_pccbwdtkr_l vpss_wstt_pccbwdtkr_l;                                   /* 0x908 */
    u_vpss_wstt_pccbwdtkr_r vpss_wstt_pccbwdtkr_r;                                   /* 0x90c */
    u_vpss_wstt_pccfwdtkr_u vpss_wstt_pccfwdtkr_u;                                   /* 0x910 */
    u_vpss_wstt_pccfwdtkr_d vpss_wstt_pccfwdtkr_d;                                   /* 0x914 */
    u_vpss_wstt_pccfwdtkr_l vpss_wstt_pccfwdtkr_l;                                   /* 0x918 */
    u_vpss_wstt_pccfwdtkr_r vpss_wstt_pccfwdtkr_r;                                   /* 0x91c */
    u_vpss_wstt_pccmatch vpss_wstt_pccmatch;                                         /* 0x920 */
    u_vpss_wstt_pccnonmatch vpss_wstt_pccnonmatch;                                   /* 0x924 */
    u_vpss_wstt_pcccrss vpss_wstt_pcccrss;                                           /* 0x928 */
    u_vpss_wstt_pccfwdtkr vpss_wstt_pccfwdtkr;                                       /* 0x92c */
    u_vpss_wstt_pccbwdtkr vpss_wstt_pccbwdtkr;                                       /* 0x930 */
    u_vpss_wstt_matchum vpss_wstt_matchum;                                           /* 0x934 */
    u_vpss_wstt_nonmatchum vpss_wstt_nonmatchum;                                     /* 0x938 */
    u_vpss_wstt_matchum2 vpss_wstt_matchum2;                                         /* 0x93c */
    u_vpss_wstt_nonmatchum2 vpss_wstt_nonmatchum2;                                   /* 0x940 */
    u_vpss_wstt_s32_frmitdiff vpss_wstt_s32_frmitdiff;                               /* 0x944 */
    u_vpss_wstt_s32_frmitdiffbe vpss_wstt_s32_frmitdiffbe;                           /* 0x948 */
    u_vpss_wstt_ifmd_reserved_0 vpss_wstt_ifmd_reserved_0;                           /* 0x94c */
    u_vpss_wstt_pd_stlblk_sad_0 vpss_wstt_pd_stlblk_sad_0;                           /* 0x950 */
    u_vpss_wstt_pd_stlblk_sad_1 vpss_wstt_pd_stlblk_sad_1;                           /* 0x954 */
    u_vpss_wstt_pd_stlblk_sad_2 vpss_wstt_pd_stlblk_sad_2;                           /* 0x958 */
    u_vpss_wstt_pd_stlblk_sad_3 vpss_wstt_pd_stlblk_sad_3;                           /* 0x95c */
    u_vpss_wstt_pd_stlblk_sad_4 vpss_wstt_pd_stlblk_sad_4;                           /* 0x960 */
    u_vpss_wstt_pd_stlblk_sad_5 vpss_wstt_pd_stlblk_sad_5;                           /* 0x964 */
    u_vpss_wstt_pd_stlblk_sad_6 vpss_wstt_pd_stlblk_sad_6;                           /* 0x968 */
    u_vpss_wstt_pd_stlblk_sad_7 vpss_wstt_pd_stlblk_sad_7;                           /* 0x96c */
    u_vpss_wstt_pd_stlblk_sad_8 vpss_wstt_pd_stlblk_sad_8;                           /* 0x970 */
    u_vpss_wstt_pd_stlblk_sad_9 vpss_wstt_pd_stlblk_sad_9;                           /* 0x974 */
    u_vpss_wstt_pd_stlblk_sad_10 vpss_wstt_pd_stlblk_sad_10;                         /* 0x978 */
    u_vpss_wstt_pd_stlblk_sad_11 vpss_wstt_pd_stlblk_sad_11;                         /* 0x97c */
    u_vpss_wstt_pd_stlblk_sad_12 vpss_wstt_pd_stlblk_sad_12;                         /* 0x980 */
    u_vpss_wstt_pd_stlblk_sad_13 vpss_wstt_pd_stlblk_sad_13;                         /* 0x984 */
    u_vpss_wstt_pd_stlblk_sad_14 vpss_wstt_pd_stlblk_sad_14;                         /* 0x988 */
    u_vpss_wstt_pd_stlblk_sad_15 vpss_wstt_pd_stlblk_sad_15;                         /* 0x98c */
    u_vpss_wstt_pd_lasi_cnt_00 vpss_wstt_pd_lasi_cnt_00;                             /* 0x990 */
    u_vpss_wstt_pd_lasi_cnt_01 vpss_wstt_pd_lasi_cnt_01;                             /* 0x994 */
    u_vpss_wstt_pd_lasi_cnt_02 vpss_wstt_pd_lasi_cnt_02;                             /* 0x998 */
    u_vpss_wstt_pd_lasi_cnt_10 vpss_wstt_pd_lasi_cnt_10;                             /* 0x99c */
    u_vpss_wstt_pd_lasi_cnt_11 vpss_wstt_pd_lasi_cnt_11;                             /* 0x9a0 */
    u_vpss_wstt_pd_lasi_cnt_12 vpss_wstt_pd_lasi_cnt_12;                             /* 0x9a4 */
    u_vpss_wstt_pd_reserved_0 vpss_wstt_pd_reserved_0;                               /* 0x9a8 */
    u_vpss_wstt_pd_reserved_1 vpss_wstt_pd_reserved_1;                               /* 0x9ac */
    unsigned int reserved_1[60];                                                     /* 0x9b0~0xa9c 60:para */
    u_vpss_wstt_hipp_di_film0 vpss_wstt_hipp_di_film0;                               /* 0xaa0 */
    u_vpss_wstt_hipp_di_film1 vpss_wstt_hipp_di_film1;                               /* 0xaa4 */
    u_vpss_wstt_hipp_di_film2 vpss_wstt_hipp_di_film2;                               /* 0xaa8 */
    u_vpss_wstt_hipp_di_film3 vpss_wstt_hipp_di_film3;                               /* 0xaac */
    u_vpss_wstt_hipp_di_film4 vpss_wstt_hipp_di_film4;                               /* 0xab0 */
    u_vpss_wstt_hipp_di_film5 vpss_wstt_hipp_di_film5;                               /* 0xab4 */
    u_vpss_wstt_hipp_di_reserve0 vpss_wstt_hipp_di_reserve0;                         /* 0xab8 */
    u_vpss_wstt_hipp_di_reserve1 vpss_wstt_hipp_di_reserve1;                         /* 0xabc */
    u_vpss_wstt_hipp_di_jitter0 vpss_wstt_hipp_di_jitter0;                           /* 0xac0 */
    u_vpss_wstt_hipp_di_jitter1 vpss_wstt_hipp_di_jitter1;                           /* 0xac4 */
    u_vpss_wstt_hipp_di_jitter2 vpss_wstt_hipp_di_jitter2;                           /* 0xac8 */
    u_vpss_wstt_hipp_di_jitter3 vpss_wstt_hipp_di_jitter3;                           /* 0xacc */
    u_vpss_wstt_hipp_di_slight0 vpss_wstt_hipp_di_slight0;                           /* 0xad0 */
    u_vpss_wstt_hipp_di_slight1 vpss_wstt_hipp_di_slight1;                           /* 0xad4 */
    u_vpss_wstt_hipp_di_slight2 vpss_wstt_hipp_di_slight2;                           /* 0xad8 */
    u_vpss_wstt_hipp_di_reserve2 vpss_wstt_hipp_di_reserve2;                         /* 0xadc */
    u_vpss_wstt_hipp_di_fusion0 vpss_wstt_hipp_di_fusion0;                           /* 0xae0 */
    u_vpss_wstt_hipp_di_fusion1 vpss_wstt_hipp_di_fusion1;                           /* 0xae4 */
    u_vpss_wstt_hipp_di_reserve3 vpss_wstt_hipp_di_reserve3;                         /* 0xae8 */
    u_vpss_wstt_hipp_di_reserve4 vpss_wstt_hipp_di_reserve4;                         /* 0xaec */
    unsigned int reserved_2[4];                                                      /* 0xaf0~0xafc 2,4,0,0,0:para */
    u_vpss_wstt_mt_stat0 vpss_wstt_mt_stat0;                                         /* 0xb00 */
    u_vpss_wstt_mt_stat1 vpss_wstt_mt_stat1;                                         /* 0xb04 */
    u_vpss_wstt_mt_stat2 vpss_wstt_mt_stat2;                                         /* 0xb08 */
    u_vpss_wstt_mt_stat3 vpss_wstt_mt_stat3;                                         /* 0xb0c */
    u_vpss_wstt_zmvsad_stat0 vpss_wstt_zmvsad_stat0;                                 /* 0xb10 */
    u_vpss_wstt_zmvsad_stat1 vpss_wstt_zmvsad_stat1;                                 /* 0xb14 */
    u_vpss_wstt_zmvsad_stat2 vpss_wstt_zmvsad_stat2;                                 /* 0xb18 */
    u_vpss_wstt_zmvsad_stat3 vpss_wstt_zmvsad_stat3;                                 /* 0xb1c */
    unsigned int reserved_3[56];                                                     /* 0xb20~0xbfc 3,56,0,20,0:para */
    u_vpss_wstt_scd_hist_bin_1 vpss_wstt_scd_hist_bin_1;                             /* 0xc00 */
    u_vpss_wstt_scd_hist_bin_2 vpss_wstt_scd_hist_bin_2;                             /* 0xc04 */
    u_vpss_wstt_scd_hist_bin_3 vpss_wstt_scd_hist_bin_3;                             /* 0xc08 */
    u_vpss_wstt_scd_hist_bin_4 vpss_wstt_scd_hist_bin_4;                             /* 0xc0c */
    u_vpss_wstt_scd_hist_bin_5 vpss_wstt_scd_hist_bin_5;                             /* 0xc10 */
    u_vpss_wstt_scd_hist_bin_6 vpss_wstt_scd_hist_bin_6;                             /* 0xc14 */
    u_vpss_wstt_scd_hist_bin_7 vpss_wstt_scd_hist_bin_7;                             /* 0xc18 */
    u_vpss_wstt_scd_hist_bin_8 vpss_wstt_scd_hist_bin_8;                             /* 0xc1c */
    u_vpss_wstt_scd_hist_bin_9 vpss_wstt_scd_hist_bin_9;                             /* 0xc20 */
    u_vpss_wstt_scd_hist_bin_10 vpss_wstt_scd_hist_bin_10;                           /* 0xc24 */
    u_vpss_wstt_scd_hist_bin_11 vpss_wstt_scd_hist_bin_11;                           /* 0xc28 */
    u_vpss_wstt_scd_hist_bin_12 vpss_wstt_scd_hist_bin_12;                           /* 0xc2c */
    u_vpss_wstt_scd_hist_bin_13 vpss_wstt_scd_hist_bin_13;                           /* 0xc30 */
    u_vpss_wstt_scd_hist_bin_14 vpss_wstt_scd_hist_bin_14;                           /* 0xc34 */
    u_vpss_wstt_scd_hist_bin_15 vpss_wstt_scd_hist_bin_15;                           /* 0xc38 */
    u_vpss_wstt_scd_hist_bin_16 vpss_wstt_scd_hist_bin_16;                           /* 0xc3c */
    u_vpss_wstt_scd_hist_bin_17 vpss_wstt_scd_hist_bin_17;                           /* 0xc40 */
    u_vpss_wstt_scd_hist_bin_18 vpss_wstt_scd_hist_bin_18;                           /* 0xc44 */
    u_vpss_wstt_scd_hist_bin_19 vpss_wstt_scd_hist_bin_19;                           /* 0xc48 */
    u_vpss_wstt_scd_hist_bin_20 vpss_wstt_scd_hist_bin_20;                           /* 0xc4c */
    u_vpss_wstt_scd_hist_bin_21 vpss_wstt_scd_hist_bin_21;                           /* 0xc50 */
    u_vpss_wstt_scd_hist_bin_22 vpss_wstt_scd_hist_bin_22;                           /* 0xc54 */
    u_vpss_wstt_scd_hist_bin_23 vpss_wstt_scd_hist_bin_23;                           /* 0xc58 */
    u_vpss_wstt_scd_hist_bin_24 vpss_wstt_scd_hist_bin_24;                           /* 0xc5c */
    u_vpss_wstt_scd_hist_bin_25 vpss_wstt_scd_hist_bin_25;                           /* 0xc60 */
    u_vpss_wstt_scd_hist_bin_26 vpss_wstt_scd_hist_bin_26;                           /* 0xc64 */
    u_vpss_wstt_scd_hist_bin_27 vpss_wstt_scd_hist_bin_27;                           /* 0xc68 */
    u_vpss_wstt_scd_hist_bin_28 vpss_wstt_scd_hist_bin_28;                           /* 0xc6c */
    u_vpss_wstt_scd_hist_bin_29 vpss_wstt_scd_hist_bin_29;                           /* 0xc70 */
    u_vpss_wstt_scd_hist_bin_30 vpss_wstt_scd_hist_bin_30;                           /* 0xc74 */
    u_vpss_wstt_scd_hist_bin_31 vpss_wstt_scd_hist_bin_31;                           /* 0xc78 */
    u_vpss_wstt_scd_hist_bin_32 vpss_wstt_scd_hist_bin_32;                           /* 0xc7c */
    u_vpss_wstt_tnr_noisepointcnt_min vpss_wstt_tnr_noisepointcnt_min;               /* 0xc80 */
    u_vpss_wstt_tnr_noisepointcnt_med vpss_wstt_tnr_noisepointcnt_med;               /* 0xc84 */
    u_vpss_wstt_tnr_noisepointcnt_max vpss_wstt_tnr_noisepointcnt_max;               /* 0xc88 */
    u_vpss_wstt_tnr_noisepointnum vpss_wstt_tnr_noisepointnum;                       /* 0xc8c */
    u_vpss_wstt_tnr_sumnoiseinfo_min vpss_wstt_tnr_sumnoiseinfo_min;                 /* 0xc90 */
    u_vpss_wstt_tnr_sumnoiseinfo_med vpss_wstt_tnr_sumnoiseinfo_med;                 /* 0xc94 */
    u_vpss_wstt_tnr_sumnoiseinfo_max vpss_wstt_tnr_sumnoiseinfo_max;                 /* 0xc98 */
    u_vpss_wstt_tnr_reserved vpss_wstt_tnr_reserved;                                 /* 0xc9c */
    unsigned int reserved_4[88];                                                     /* 0xca0~0xdfc 88:para */
    u_vpss_wstt_db_hy_counter vpss_wstt_db_hy_counter[2048];                         /* 0xe00~0x2dfc 2048:para */
    u_vpss_wstt_db_border vpss_wstt_db_border[128];                                  /* 0x2e00~0x2ffc 128:para */
    u_vpss_wstt_db_hy_size vpss_wstt_db_hy_size;                                     /* 0x3000 */
    u_vpss_wstt_db_hc_size vpss_wstt_db_hc_size;                                     /* 0x3004 */
    u_vpss_wstt_db_vy_size vpss_wstt_db_vy_size;                                     /* 0x3008 */
    u_vpss_wstt_db_max_index vpss_wstt_db_max_index;                                 /* 0x300c */
    u_vpss_wstt_db_hy_size_idx0 vpss_wstt_db_hy_size_idx0;                           /* 0x3010 */
    u_vpss_wstt_db_hy_size_idx1 vpss_wstt_db_hy_size_idx1;                           /* 0x3014 */
    u_vpss_wstt_db_hy_size_idx2 vpss_wstt_db_hy_size_idx2;                           /* 0x3018 */
    u_vpss_wstt_db_hy_size_idx3 vpss_wstt_db_hy_size_idx3;                           /* 0x301c */
    u_vpss_wstt_db_hy_size_idx4 vpss_wstt_db_hy_size_idx4;                           /* 0x3020 */
    u_vpss_wstt_db_hy_size_idx5 vpss_wstt_db_hy_size_idx5;                           /* 0x3024 */
    u_vpss_wstt_db_hy_size_idx6 vpss_wstt_db_hy_size_idx6;                           /* 0x3028 */
    u_vpss_wstt_db_hy_size_idx7 vpss_wstt_db_hy_size_idx7;                           /* 0x302c */
    u_vpss_wstt_db_vy_size_idx0 vpss_wstt_db_vy_size_idx0;                           /* 0x3030 */
    u_vpss_wstt_db_vy_size_idx1 vpss_wstt_db_vy_size_idx1;                           /* 0x3034 */
    u_vpss_wstt_db_vy_size_idx2 vpss_wstt_db_vy_size_idx2;                           /* 0x3038 */
    u_vpss_wstt_db_vy_size_idx3 vpss_wstt_db_vy_size_idx3;                           /* 0x303c */
    u_vpss_wstt_db_vy_size_idx4 vpss_wstt_db_vy_size_idx4;                           /* 0x3040 */
    u_vpss_wstt_db_vy_size_idx5 vpss_wstt_db_vy_size_idx5;                           /* 0x3044 */
    u_vpss_wstt_db_vy_size_idx6 vpss_wstt_db_vy_size_idx6;                           /* 0x3048 */
    u_vpss_wstt_db_vy_size_idx7 vpss_wstt_db_vy_size_idx7;                           /* 0x304c */
    u_vpss_wstt_db_hu_size_idx0 vpss_wstt_db_hu_size_idx0;                           /* 0x3050 */
    u_vpss_wstt_db_hu_size_idx1 vpss_wstt_db_hu_size_idx1;                           /* 0x3054 */
    u_vpss_wstt_db_hu_size_idx2 vpss_wstt_db_hu_size_idx2;                           /* 0x3058 */
    u_vpss_wstt_db_hu_size_idx3 vpss_wstt_db_hu_size_idx3;                           /* 0x305c */
    u_vpss_wstt_db_hu_size_idx4 vpss_wstt_db_hu_size_idx4;                           /* 0x3060 */
    u_vpss_wstt_db_hu_size_idx5 vpss_wstt_db_hu_size_idx5;                           /* 0x3064 */
    u_vpss_wstt_db_hu_size_idx6 vpss_wstt_db_hu_size_idx6;                           /* 0x3068 */
    u_vpss_wstt_db_hu_size_idx7 vpss_wstt_db_hu_size_idx7;                           /* 0x306c */
    u_vpss_wstt_db_hv_size_idx0 vpss_wstt_db_hv_size_idx0;                           /* 0x3070 */
    u_vpss_wstt_db_hv_size_idx1 vpss_wstt_db_hv_size_idx1;                           /* 0x3074 */
    u_vpss_wstt_db_hv_size_idx2 vpss_wstt_db_hv_size_idx2;                           /* 0x3078 */
    u_vpss_wstt_db_hv_size_idx3 vpss_wstt_db_hv_size_idx3;                           /* 0x307c */
    u_vpss_wstt_db_hv_size_idx4 vpss_wstt_db_hv_size_idx4;                           /* 0x3080 */
    u_vpss_wstt_db_hv_size_idx5 vpss_wstt_db_hv_size_idx5;                           /* 0x3084 */
    u_vpss_wstt_db_hv_size_idx6 vpss_wstt_db_hv_size_idx6;                           /* 0x3088 */
    u_vpss_wstt_db_hv_size_idx7 vpss_wstt_db_hv_size_idx7;                           /* 0x308c */
    u_vpss_wstt_db_bord_str vpss_wstt_db_bord_str;                                   /* 0x3090 */
    u_vpss_wstt_db_reserved_0 vpss_wstt_db_reserved_0;                               /* 0x3094 */
    u_vpss_wstt_db_reserved_1 vpss_wstt_db_reserved_1;                               /* 0x3098 */
    u_vpss_wstt_db_reserved_2 vpss_wstt_db_reserved_2;                               /* 0x309c */
    unsigned int reserved_5[24];                                                     /* 0x30a0~0x30fc 24:para */
    u_vpss_wstt_ccs_2_d_glbcc vpss_wstt_ccs_2_d_glbcc;                               /* 0x3100 */
    u_vpss_wstt_ccs_2_d_reserved_0 vpss_wstt_ccs_2_d_reserved_0;                     /* 0x3104 */
    u_vpss_wstt_ccs_2_d_reserved_1 vpss_wstt_ccs_2_d_reserved_1;                     /* 0x3108 */
    u_vpss_wstt_ccs_2_d_reserved_2 vpss_wstt_ccs_2_d_reserved_2;                     /* 0x310c */
    u_vpss_wstt_lbd_stt_space_0 vpss_wstt_lbd_stt_space_0;                           /* 0x3110 */
    u_vpss_wstt_lbd_stt_space_1 vpss_wstt_lbd_stt_space_1;                           /* 0x3114 */
    u_vpss_wstt_lbd_stt_space_2 vpss_wstt_lbd_stt_space_2;                           /* 0x3118 */
    u_vpss_wstt_lbd_stt_space_3 vpss_wstt_lbd_stt_space_3;                           /* 0x311c */
} vpss_stt_reg_type;

#endif /* __VPSS_REG_STT_H__ */
